{
  "2025-12-08T00:00:00-08:00": [
    "The T56 traded 16-year-old minor league center fielder P63474 to the T54, getting $1 in cash in return.",
    "The T33 traded 21-year-old minor league second baseman P61164 to the T37, getting 23-year-old right fielder P53075 and 26-year-old minor league reliever P29855 in return.",
    "T33: Placed RF P53075 on the active roster.",
    "T36: C P15535 was designated for assignment and placed on waivers.",
    "T45: Placed LF P33562 on the active roster.",
    "T45: Activated LF P33562 from the disabled list.",
    "T53: 1B P24280 was designated for assignment and placed on waivers."
  ],
  "2025-12-11T00:00:00-08:00": [
    "T58: Claimed RP P53423 off waivers from San Francisco."
  ],
  "2025-12-12T00:00:00-08:00": [
    "T54: Placed 2B P30589 on the active roster."
  ],
  "2025-12-14T00:00:00-08:00": [
    "T34: Placed RP P33785 on the active roster."
  ],
  "2025-12-15T00:00:00-08:00": [
    "T52: Signed free agent C P1439 to a 1-year contract worth a total of $3,200,000.",
    "T55: Signed free agent RP P29127 to a 2-year contract worth a total of $5,200,000.",
    "T37: Signed RP P29811 to a 4-year contract extension worth a total of $26,000,000.",
    "T33: Signed free agent SP P36073 to a 3-year contract worth a total of $3,600,000.",
    "T58: Signed free agent RP P39243 to a 2-year contract worth a total of $5,600,000.",
    "The T40 traded 24-year-old minor league starting pitcher P53785 and 21-year-old minor league center fielder P58947 to the T45, getting 29-year-old catcher P28425 and 19-year-old minor league starting pitcher P58342 in return.",
    "The T50 traded 24-year-old catcher P53384 to the T34, getting 21-year-old minor league starting pitcher P56912 in return.",
    "The T40 traded 19-year-old minor league starting pitcher P58258 to the T38, getting 21-year-old minor league starting pitcher P62226 in return.",
    "The T49 traded 36-year-old right fielder P27200 and 20-year-old minor league catcher P58725 to the T58, getting 20-year-old minor league first baseman P54405 in return."
  ]
}
