{
  "2025-05-05T00:00:00-07:00": [
    "T54: 3B P34032 diagnosed with a dislocated finger, but will not miss any additional time.",
    "T45: 3B P50298 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 3 days.",
    "T35: RP P55801 diagnosed with hamstring soreness, is day-to-day for 5 days.",
    "T59: C P58043 was injured . The Diagnosis: Virus. This is a day-to-day injury expected to last 6 days.",
    "T43: 3B P37049 was injured being hit by a pitch. The Diagnosis: Bruised elbow. This is a day-to-day injury expected to last 1 day.",
    "T45: SS P39877 was injured while running the bases. The Diagnosis: Groin soreness. This is a day-to-day injury expected to last one week.",
    "T37: SS P33265 was injured while running the bases. The Diagnosis: Hamstring strain. He's expected to miss about 5-6 weeks.",
    "T52: LF P22470 was injured while running the bases. The diagnosis is not yet known.",
    "T34: SP P29686 was injured while pitching. The diagnosis is not yet known.",
    "T35: C P584 was injured while running the bases. The Diagnosis: Latissimus dorsi (back) strain. He's expected to miss about 5 days.",
    "T34: RP P24453 was injured while pitching. The diagnosis is not yet known.",
    "T44: C P50274 was injured while running the bases. The Diagnosis: Hamstring spasms. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-05-06T00:00:00-07:00": [
    "T52: LF P22470 diagnosed with a strained abdominal muscle, is day-to-day for 6 days.",
    "T34: SP P29686 diagnosed with forearm stiffness, will miss 4 days.",
    "T50: LF P55254 diagnosed with a strained anterior cruciate ligament, will miss 4 weeks.",
    "T59: RF P35938 was injured being hit by a pitch. The Diagnosis: Bruised finger. This is a day-to-day injury expected to last 1 day.",
    "T47: RP P35889 was injured while pitching. The Diagnosis: Back tightness. He's expected to miss about 2 weeks.",
    "T49: C P22632 was injured while running the bases. The Diagnosis: Bruised wrist. This is a day-to-day injury expected to last 6 days.",
    "T57: SP P243 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 5 days.",
    "T55: SP P37045 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 4 days.",
    "T46: SP P35495 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about one week.",
    "T32: RP P49704 was injured while pitching. The Diagnosis: Elbow strain. This is a day-to-day injury expected to last 2 weeks."
  ],
  "2025-05-07T00:00:00-07:00": [
    "T34: DH P30166 diagnosed with a strained hamstring, will miss 6 weeks.",
    "T57: RF P37421 diagnosed with a concussion, will miss 2-3 months.",
    "T59: SS P39888 diagnosed with a separated shoulder, will miss 5-6 weeks.",
    "T47: RP P28677 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 1 day.",
    "T41: SP P36073 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 3 days.",
    "T45: SP P53651 was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 2 weeks.",
    "T32: SP P22377 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-05-08T00:00:00-07:00": [
    "T32: SP P22627 diagnosed with a strained biceps, will miss 4-5 weeks.",
    "T34: RP P24453 diagnosed with bone chips in his elbow, will miss 5-6 months.",
    "T39: 1B P34175 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "T38: 2B P35840 was injured while running the bases. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 1 day.",
    "T56: RP P29127 was injured while pitching. The diagnosis is not yet known.",
    "T45: 2B P55306 was injured while throwing the ball. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week."
  ],
  "2025-05-09T00:00:00-07:00": [
    "T39: CF P53787 was injured while throwing the ball. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last one week.",
    "T38: 3B P25141 was injured while running the bases. The Diagnosis: Hamstring tightness. This is a day-to-day injury expected to last one week.",
    "T58: SS P55249 was injured while running the bases. The diagnosis is not yet known.",
    "T32: SS P29818 was injured being hit by a pitch. The diagnosis is not yet known."
  ],
  "2025-05-10T00:00:00-07:00": [
    "T56: RP P29127 diagnosed with a partially torn labrum, will miss 3 months.",
    "T58: SS P55249 diagnosed with groin soreness, is day-to-day for 6 days.",
    "T49: SS P55542 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 2 days.",
    "T54: RF P37113 was injured while running the bases. The diagnosis is not yet known.",
    "T55: RP P53832 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-05-11T00:00:00-07:00": [
    "T32: SS P29818 diagnosed with a fractured thumb, will miss 5 weeks.",
    "T58: CL P36469 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 5 days.",
    "T53: SP P54511 was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 2 days.",
    "T49: SP P24984 was injured while pitching. The diagnosis is not yet known.",
    "T40: SP P34824 was injured while pitching. The diagnosis is not yet known.",
    "T42: LF P34868 was injured while throwing the ball. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-05-12T00:00:00-07:00": [
    "T54: RF P37113 diagnosed with a sore ankle, is day-to-day for 4 days."
  ]
}
