{
  "2025-06-23T00:00:00-07:00": [
    "T42: SP P24039 diagnosed with shoulder inflammation, will miss 3 weeks.",
    "T40: SP P24817 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 6 days.",
    "T39: SS P50304 was injured while running the bases. The diagnosis is not yet known.",
    "T56: SP P29699 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 5 days.",
    "T56: 1B P56436 was injured while running the bases. The Diagnosis: Hamstring tendinitis. He's expected to miss about one week.",
    "T56: RF P34049 was injured in a collision at a base. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last one week."
  ],
  "2025-06-24T00:00:00-07:00": [
    "T43: SP P28940 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 3 days.",
    "T39: SS P50304 diagnosed with a bruised finger, but will not miss any additional time.",
    "T58: P54839 has suffered a setback in his recovery. He is not expected to recover for another 2 weeks.",
    "T47: SP P57954 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days.",
    "T52: RP P37214 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 5 days.",
    "T42: RP P25116 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-06-25T00:00:00-07:00": [
    "T54: RP P1811 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days.",
    "T42: RP P53678 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 2 days.",
    "T37: CF P33105 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T57: SP P16 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 6 days.",
    "T33: CF P30724 was injured on a defensive play. The Diagnosis: Sprained ankle. He's expected to miss about 4 weeks.",
    "T56: 2B P28860 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T40: RP P2212 was injured while pitching. The diagnosis is not yet known.",
    "T53: RP P55648 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 6 days.",
    "T47: SP P25132 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 3 days.",
    "T47: RP P28677 was injured while pitching. The diagnosis is not yet known.",
    "T41: RP P30109 was injured while pitching. The Diagnosis: Strained forearm. This is a day-to-day injury expected to last one week.",
    "T58: RP P41003 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-06-26T00:00:00-07:00": [
    "T47: RP P28677 diagnosed with a mild shoulder strain, is day-to-day for 5 days.",
    "T56: CF P63036 was injured . The Diagnosis: Heat exhaustion. This is a day-to-day injury expected to last 1 day.",
    "T53: SP P54511 was injured while pitching. The Diagnosis: Abdominal soreness. This is a day-to-day injury expected to last 2 days.",
    "T40: C P19997 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T46: SP P35495 was injured while pitching. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 2 weeks.",
    "T46: RP P37 was injured while pitching. The diagnosis is not yet known.",
    "T42: SP P29661 was injured while pitching. The diagnosis is not yet known.",
    "T58: RP P36248 was injured while pitching. The diagnosis is not yet known.",
    "T32: SP P31901 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-06-27T00:00:00-07:00": [
    "T40: RP P2212 diagnosed with forearm inflammation, will miss 5 weeks.",
    "T40: C P19997 diagnosed with a knee contusion, is day-to-day for 1-2 weeks.",
    "T42: SP P29661 diagnosed with a torn biceps, will miss 2-3 months.",
    "T32: SP P31901 diagnosed with back spasms, but will not miss any additional time.",
    "T53: SP P53756 was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 5 days.",
    "T50: 1B P25419 was injured while running the bases. The Diagnosis: Quadriceps strain. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-06-28T00:00:00-07:00": [
    "T46: RP P37 diagnosed with biceps tendinitis, will miss one week.",
    "T43: SP P22463 was injured . The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 1 day.",
    "T56: 2B P28860 diagnosed with a fractured finger, will miss 4-5 weeks.",
    "T57: 1B P62076 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "T58: C P25189 was injured while running the bases. The Diagnosis: Bruised finger. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-06-29T00:00:00-07:00": [
    "T37: CF P33105 diagnosed with a fractured finger, will miss 5 weeks.",
    "T39: 2B P23264 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T50: SS P31862 was injured while running the bases. The Diagnosis: Hamstring strain. He's expected to miss about 6-7 weeks.",
    "T46: SP P35392 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 4 days.",
    "T33: RP P52429 was injured while pitching. The Diagnosis: Neck stiffness. This is a day-to-day injury expected to last 2 days.",
    "T42: RP P25116 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 6 days.",
    "T55: RP P53656 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-06-30T00:00:00-07:00": [
    "T39: 2B P23264 diagnosed with a broken kneecap, will miss 6 months.",
    "T53: 1B P35554 was injured . The Diagnosis: Strep throat. This is a day-to-day injury expected to last 6 days.",
    "T58: RP P36248 diagnosed with a forearm strain, will miss 8 weeks."
  ]
}
