{
  "2025-06-30T00:00:00-07:00": [
    "T39: 2B P23264 diagnosed with a broken kneecap, will miss 6 months.",
    "T53: 1B P35554 was injured . The Diagnosis: Strep throat. This is a day-to-day injury expected to last 6 days.",
    "T58: RP P36248 diagnosed with a forearm strain, will miss 8 weeks.",
    "T53: RF P50254 was injured while running the bases. The diagnosis is not yet known.",
    "T58: SP P37050 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last one week.",
    "T58: C P23917 was injured while running the bases. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 6 days.",
    "T54: SP P53369 was injured while pitching. The Diagnosis: Tender shoulder. This is a day-to-day injury expected to last 4 days.",
    "T50: SP P26336 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days.",
    "T38: RP P31811 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-07-01T00:00:00-07:00": [
    "T46: SP P62002 was injured . The Diagnosis: Dehydration. This is a day-to-day injury expected to last 1 day.",
    "T52: RP P37214 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-07-02T00:00:00-07:00": [
    "T44: SP P54892 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last one week.",
    "T44: RP P31833 was injured while pitching. The diagnosis is not yet known.",
    "T58: SS P55249 was injured in a collision at a base. The Diagnosis: Chronic back soreness. He's expected to miss about 3-4 weeks.",
    "T57: RP P23534 was injured while pitching. The Diagnosis: Tender shoulder. This is a day-to-day injury expected to last 5 days.",
    "T43: CF P50262 was injured on a defensive play. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last one week.",
    "T43: CF P26631 was injured while throwing the ball. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-07-03T00:00:00-07:00": [
    "T52: RP P37214 diagnosed with a sore elbow, will miss 5 weeks.",
    "T53: RF P50254 diagnosed with a severely strained hip muscle, will miss 3 months.",
    "T43: SP P26951 was injured while pitching. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last one week.",
    "T43: RF P36482 was injured while throwing the ball. The diagnosis is not yet known.",
    "T44: SP P34825 was injured while pitching. The Diagnosis: Sprained elbow. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-07-04T00:00:00-07:00": [
    "T38: RP P31811 diagnosed with elbow tendinitis, will miss 2 months.",
    "T44: RP P31833 diagnosed with a strained oblique, is day-to-day for 4 days.",
    "T35: SP P25144 was injured while pitching. The Diagnosis: Tired arm. This is a day-to-day injury expected to last 1-2 weeks.",
    "T42: RP P34703 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 2 days.",
    "T34: CL P23597 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 1 day.",
    "T33: SP P1380 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 5 days.",
    "T44: 2B P46900 was injured in a collision at a base. The Diagnosis: Strained rib cage muscle. This is a day-to-day injury expected to last 2 weeks."
  ],
  "2025-07-05T00:00:00-07:00": [
    "T43: RF P36482 diagnosed with a forearm strain, will miss 4 weeks.",
    "T49: 1B P53351 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T35: SP P8 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 1 day.",
    "T55: SS P50670 was injured in a collision at a base. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 1-2 weeks.",
    "T55: CF P56774 was injured while throwing the ball. The diagnosis is not yet known.",
    "T56: RP P25201 was injured while pitching. The diagnosis is not yet known.",
    "T32: LF P37047 was injured while throwing the ball. The Diagnosis: Dead arm. He's expected to miss about 3 weeks."
  ],
  "2025-07-06T00:00:00-07:00": [
    "T32: P29818 has suffered a setback in his recovery. He is not expected to recover for another 4 weeks.",
    "T49: 1B P53351 diagnosed with a swollen ear, is day-to-day for 2 days.",
    "T55: CF P56774 diagnosed with a strained abdominal muscle, will miss 6 weeks.",
    "T59: 3B P54464 was injured while running the bases. The diagnosis is not yet known.",
    "T57: RP P23534 was injured while pitching. The diagnosis is not yet known.",
    "T33: CF P55381 was injured being hit by a pitch. The Diagnosis: Thumb contusion. This is a day-to-day injury expected to last 2 days.",
    "T44: CF P55236 was injured while running the bases. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-07-07T00:00:00-07:00": [
    "T57: RP P23534 diagnosed with a sore elbow, is day-to-day for 2 weeks.",
    "T59: 3B P54464 diagnosed with a mild hamstring strain, is day-to-day for 2 weeks.",
    "T31: SP P59639 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days."
  ]
}
