{
  "2025-03-03T00:00:00-08:00": [
    "Chicago White Sox: <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29657.html\">Anthony Molina</a> has suffered a setback in his recovery. He is not expected to recover for another 6-7 months.",
    "Detroit Tigers: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52990.html\">Héctor García</a> was injured . The Diagnosis: Strep throat. This is a day-to-day injury expected to last 4 days.",
    "Boston Red Sox: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53414.html\">Chris Thomas</a> was injured while pitching. The diagnosis is not yet known.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52160.html\">Ánibal Álvarez</a> was injured while pitching. The diagnosis is not yet known.",
    "Detroit Tigers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_13.html\">Jeff Hoffman</a> was injured while pitching. The diagnosis is not yet known.",
    "Detroit Tigers: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_50264.html\">Nick Donnelly</a> was injured while running the bases. The diagnosis is not yet known.",
    "Chicago Cubs: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55417.html\">Jim Meyer</a> was injured while pitching. The diagnosis is not yet known.",
    "St. Louis Cardinals: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_34049.html\">Steven Moya</a> was injured while throwing the ball. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 4 days.",
    "San Diego Padres: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55096.html\">Robby O'Neill</a> was injured while running the bases. The Diagnosis: Bruised shoulder. This is a day-to-day injury expected to last one week.",
    "Colorado Rockies: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22840.html\">Michael Matuella</a> was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 4 days.",
    "New York Mets: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1816.html\">David A. Peterson</a> was injured being hit by a pitch. The Diagnosis: Bruised elbow. This is a day-to-day injury expected to last one week.",
    "New York Mets: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_39655.html\">Rafael Devers</a> was injured being hit by a pitch. The diagnosis is not yet known."
  ],
  "2025-03-04T00:00:00-08:00": [
    "Detroit Tigers: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_50264.html\">Nick Donnelly</a> diagnosed with a bruised shoulder, is day-to-day for 6 days.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52160.html\">Ánibal Álvarez</a> diagnosed with back tightness, is day-to-day for 5 days.",
    "Boston Red Sox: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53414.html\">Chris Thomas</a> diagnosed with a mild calf strain, is day-to-day for 5 days.",
    "Texas Rangers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55379.html\">Jorge Martínez</a> was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 3 days.",
    "Chicago Cubs: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55417.html\">Jim Meyer</a> diagnosed with a sore forearm, is day-to-day for 5 days.",
    "Minnesota Twins: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55283.html\">António Gómez</a> was injured being hit by a pitch. The Diagnosis: Precautionary reasons (head injury). He's expected to miss about 1 day.",
    "Oakland Athletics: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_56787.html\">Steve McGee</a> was injured while running the bases. The diagnosis is not yet known.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23534.html\">Al Stoner</a> was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 6 days.",
    "New York Mets: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53718.html\">Don Spencer</a> was injured while running the bases. The Diagnosis: Strained groin. This is a day-to-day injury expected to last 2-3 weeks.",
    "St. Louis Cardinals: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55342.html\">Liam Harrison</a> was injured while pitching. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-03-05T00:00:00-08:00": [
    "New York Mets: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_39655.html\">Rafael Devers</a> diagnosed with a fractured thumb, will miss 3 weeks.",
    "Cleveland Indians: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26704.html\">Christifer Andritsos</a> was injured while pitching. The Diagnosis: Strained forearm. This is a day-to-day injury expected to last 1-2 weeks.",
    "Houston Astros: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53238.html\">Josh Hansen</a> was injured while pitching. The Diagnosis: Pulled abdominal muscle. This is a day-to-day injury expected to last 5 days.",
    "Colorado Rockies: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_37072.html\">Jesse Winker</a> was injured while running the bases. The diagnosis is not yet known.",
    "Arizona Diamondbacks: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52975.html\">Jeff Rowe</a> was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 5 days.",
    "Philadelphia Phillies: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_48257.html\">Franklyn Kilome</a> was injured while pitching. The Diagnosis: Forearm soreness. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-03-06T00:00:00-08:00": [
    "Detroit Tigers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_13.html\">Jeff Hoffman</a> diagnosed with a torn rotator cuff, will miss 13 months.",
    "Miami Marlins: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55267.html\">Shawn Swift</a> was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33217.html\">Juan Valentín</a> was injured while pitching. The diagnosis is not yet known.",
    "Washington Nationals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27076.html\">Tristan Beck</a> was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 5 days.",
    "St. Louis Cardinals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27493.html\">Stephen Strasburg</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-07T00:00:00-08:00": [
    "Kansas City Royals: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1376.html\">Ryan Castellani</a> was injured . The Diagnosis: Nausea. This is a day-to-day injury expected to last 3 days.",
    "Miami Marlins: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25202.html\">Wesley Rodriguez</a> was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 2 days.",
    "St. Louis Cardinals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27493.html\">Stephen Strasburg</a> diagnosed with a sore shoulder, will miss 4-5 weeks.",
    "Kansas City Royals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_28940.html\">Ian Anderson</a> was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 3 days.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33217.html\">Juan Valentín</a> diagnosed with a shoulder subluxation, is day-to-day for 6 days.",
    "Oakland Athletics: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_56787.html\">Steve McGee</a> diagnosed with a strained posterior cruciate ligament, will miss 2 weeks.",
    "Minnesota Twins: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35903.html\">Jose Fernandez</a> was injured while pitching. The diagnosis is not yet known.",
    "Pittsburgh Pirates: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30874.html\">Josh Magee</a> was injured in a collision at a base. The diagnosis is not yet known.",
    "Washington Nationals: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_206.html\">Casey Gillaspie</a> was injured while running the bases. The Diagnosis: Hip soreness. This is a day-to-day injury expected to last 4 days.",
    "Chicago Cubs: C <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_20809.html\">Chris Hudgins</a> was injured in a collision at a base. The diagnosis is not yet known.",
    "Cincinnati Reds: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29575.html\">Cesar Trejo</a> was injured while running the bases. The diagnosis is not yet known.",
    "Cincinnati Reds: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33474.html\">Trevor Rosenthal</a> was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 6 days."
  ],
  "2025-03-08T00:00:00-08:00": [
    "Chicago Cubs: C <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_20809.html\">Chris Hudgins</a> diagnosed with blurred vision, is day-to-day for 2 weeks.",
    "Cincinnati Reds: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29575.html\">Cesar Trejo</a> diagnosed with torn ankle ligaments, will miss 5-6 weeks.",
    "Minnesota Twins: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35903.html\">Jose Fernandez</a> diagnosed with a torn labrum, will miss 4-5 months.",
    "Colorado Rockies: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_37072.html\">Jesse Winker</a> diagnosed with an intercostal strain, will miss 1 day.",
    "San Francisco Giants: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_38604.html\">Colin Moran</a> was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "Minnesota Twins: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27200.html\">Jason Heyward</a> was injured while running the bases. The diagnosis is not yet known.",
    "Kansas City Royals: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36482.html\">Mookie Betts</a> was injured while throwing the ball. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 2 days.",
    "Kansas City Royals: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35250.html\">Michael Feliz</a> was injured while pitching. The diagnosis is not yet known.",
    "Los Angeles Angels: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_54892.html\">Joe Glass</a> was injured while pitching. The Diagnosis: Forearm cramp. This is a day-to-day injury expected to last 4 days.",
    "Cincinnati Reds: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53075.html\">Sam Hall</a> was injured while running the bases. The diagnosis is not yet known.",
    "San Francisco Giants: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53656.html\">Mario Fernández</a> was injured while pitching. The Diagnosis: Elbow inflammation. He's expected to miss about 2 weeks.",
    "San Francisco Giants: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_57098.html\">Norm Hamilton</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-09T00:00:00-08:00": [
    "Chicago White Sox: C <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_20821.html\">Andrew Sharpe</a> was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days.",
    "Minnesota Twins: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27200.html\">Jason Heyward</a> diagnosed with a sore hamstring, is day-to-day for 3 days.",
    "Cincinnati Reds: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53075.html\">Sam Hall</a> diagnosed with an intercostal strain, will miss 3 weeks.",
    "Cleveland Indians: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23822.html\">Tim Hines</a> was injured while pitching. The diagnosis is not yet known.",
    "Oakland Athletics: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_28815.html\">Andrew Noviello</a> was injured while running the bases. The diagnosis is not yet known.",
    "Oakland Athletics: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26992.html\">Edgardo López</a> was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days.",
    "Los Angeles Angels: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_38621.html\">Nick Rumbelow</a> was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 5 days.",
    "Arizona Diamondbacks: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33991.html\">Jacob deGrom</a> was injured while pitching. The diagnosis is not yet known.",
    "Boston Red Sox: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33526.html\">Brad Boxberger</a> was injured while pitching. The diagnosis is not yet known.",
    "Washington Nationals: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53701.html\">Chuck O'Day</a> was injured while running the bases. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-03-10T00:00:00-07:00": [
    "Cleveland Indians: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23822.html\">Tim Hines</a> diagnosed with bone chips in his elbow, will miss 4 months.",
    "Boston Red Sox: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33526.html\">Brad Boxberger</a> diagnosed with bone chips in his elbow, will miss 4 months.",
    "San Francisco Giants: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_57098.html\">Norm Hamilton</a> diagnosed with a finger blister, but will not miss any additional time.",
    "Colorado Rockies: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_59868.html\">Víctor Barbosa</a> was injured . The Diagnosis: Sinus infection. This is a day-to-day injury expected to last 3 days.",
    "Houston Astros: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53238.html\">Josh Hansen</a> was injured while pitching. The diagnosis is not yet known.",
    "Oakland Athletics: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55254.html\">Yang-cheng Jiang</a> was injured while running the bases. The Diagnosis: Bruised thigh. This is a day-to-day injury expected to last 6 days.",
    "Los Angeles Dodgers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33236.html\">Mario Ramírez</a> was injured while pitching. The diagnosis is not yet known.",
    "San Francisco Giants: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22464.html\">Kyle Funkhouser</a> was injured while pitching. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last 6 days.",
    "Pittsburgh Pirates: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_37214.html\">Seth Streich</a> was injured while pitching. The diagnosis is not yet known.",
    "Milwaukee Brewers: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53678.html\">Josh Norris</a> was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-03-11T00:00:00-07:00": [
    "Oakland Athletics: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_28815.html\">Andrew Noviello</a> diagnosed with a torn posterior cruciate ligament, will miss 6 months.",
    "Pittsburgh Pirates: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30874.html\">Josh Magee</a> diagnosed with a sprained ankle, will miss 2 months.",
    "Los Angeles Dodgers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33236.html\">Mario Ramírez</a> diagnosed with a mild hamstring strain, but will not miss any additional time.",
    "Houston Astros: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53238.html\">Josh Hansen</a> diagnosed with bone chips in his elbow, will miss 5-6 months.",
    "Oakland Athletics: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52940.html\">Stu Key</a> was injured while running the bases. The Diagnosis: Sprained ankle. He's expected to miss about 5 weeks.",
    "Oakland Athletics: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1459.html\">Kirvin Moesquit</a> was injured being hit by a pitch. The Diagnosis: Bruised hand. This is a day-to-day injury expected to last one week.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33217.html\">Juan Valentín</a> was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last one week.",
    "Pittsburgh Pirates: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27712.html\">Jose Cisnero</a> was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about one week."
  ],
  "2025-03-12T00:00:00-07:00": [
    "Arizona Diamondbacks: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33991.html\">Jacob deGrom</a> diagnosed with shoulder inflammation, will miss 5 weeks.",
    "Kansas City Royals: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35250.html\">Michael Feliz</a> diagnosed with a torn ulnar collateral ligament, will miss 12-13 months.",
    "Pittsburgh Pirates: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_37214.html\">Seth Streich</a> diagnosed with a partially torn labrum, will miss 5-6 weeks.",
    "Toronto Blue Jays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53401.html\">Jim Porter</a> was injured while pitching. The diagnosis is not yet known.",
    "Seattle Mariners: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_38656.html\">J.P. Crawford</a> was injured being hit by a pitch. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 3 days.",
    "Boston Red Sox: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30166.html\">Trevor Boone</a> was injured while running the bases. The Diagnosis: Bruised shoulder. This is a day-to-day injury expected to last one week.",
    "Colorado Rockies: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55203.html\">Greg Ross</a> was injured while pitching. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 4 days.",
    "Pittsburgh Pirates: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23737.html\">Sammy Fuller</a> was injured while pitching. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last one week.",
    "Washington Nationals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27076.html\">Tristan Beck</a> was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 2 days.",
    "Cincinnati Reds: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33105.html\">Pancho López</a> was injured while running the bases. The Diagnosis: Knee inflammation. This is a day-to-day injury expected to last 3 days.",
    "Washington Nationals: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_38820.html\">Caleb Smith</a> was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-03-13T00:00:00-07:00": [
    "Chicago White Sox: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25144.html\">Grant Sloan</a> was injured while pitching. The diagnosis is not yet known.",
    "Texas Rangers: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53426.html\">Clarence Crosby</a> was injured while throwing the ball. The Diagnosis: Acromioclavicular joint irritation. He's expected to miss about 2 weeks.",
    "Los Angeles Angels: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_54892.html\">Joe Glass</a> was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 5 days.",
    "Arizona Diamondbacks: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_50263.html\">Jacob Allred</a> was injured on a defensive play. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last 2 weeks.",
    "Miami Marlins: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25651.html\">Kevin Collard</a> was injured while throwing the ball. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 1 day.",
    "Philadelphia Phillies: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23344.html\">Albert Vázquez</a> was injured while pitching. The Diagnosis: Shoulder subluxation. This is a day-to-day injury expected to last one week.",
    "New York Mets: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23601.html\">Jim Howard</a> was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-03-14T00:00:00-07:00": [
    "Kansas City Royals: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_58305.html\">Kenzo Yoshida</a> was injured while pitching. The Diagnosis: Forearm tendinitis. He's expected to miss about 2-3 weeks.",
    "Miami Marlins: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_40985.html\">Jose A. Abreu</a> was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last one week.",
    "Houston Astros: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_34703.html\">Jesús Miranda</a> was injured while pitching. The diagnosis is not yet known.",
    "Philadelphia Phillies: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36132.html\">Harold Martinez</a> was injured while running the bases. The Diagnosis: Bruised wrist. This is a day-to-day injury expected to last one week."
  ],
  "2025-03-15T00:00:00-07:00": [
    "Chicago Cubs: C <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_20809.html\">Chris Hudgins</a> was injured . The Diagnosis: Gout. This injury keeps him out of action for 4 days.",
    "Houston Astros: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_34703.html\">Jesús Miranda</a> diagnosed with bone chips in his elbow, will miss 2-3 months.",
    "Toronto Blue Jays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53401.html\">Jim Porter</a> diagnosed with a sprained ankle, will miss 2 months."
  ],
  "2025-03-16T00:00:00-07:00": [
    "Chicago White Sox: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25144.html\">Grant Sloan</a> diagnosed with chronic back soreness, will miss 4-5 weeks.",
    "San Diego Padres: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55320.html\">Steve Sullivan</a> was injured . The Diagnosis: Earache. This is a day-to-day injury expected to last 2 days.",
    "San Diego Padres: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_58069.html\">Junior Vega</a> was injured . The Diagnosis: Dehydration. This is a day-to-day injury expected to last 2 days.",
    "Boston Red Sox: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25187.html\">L.T. Tolbert</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Chicago White Sox: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36682.html\">Wilmer Difo</a> was injured while throwing the ball. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 5 days.",
    "San Diego Padres: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53626.html\">Phil Dunlap</a> was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-03-17T00:00:00-07:00": [
    "Boston Red Sox: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25187.html\">L.T. Tolbert</a> diagnosed with a pulled abdominal muscle, is day-to-day for 3 days."
  ]
}
