{
  "2025-08-18T00:00:00-07:00": [
    "T55: 2B P35263 diagnosed with a strained hamstring, will miss 6 weeks.",
    "T50: C P1421 was injured while running the bases. The Diagnosis: Bruised foot. This is a day-to-day injury expected to last 1-2 weeks.",
    "T32: SP P22377 was injured while pitching. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last 5 days.",
    "T58: RP P35937 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 6 days.",
    "T45: RP P55350 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 4 days.",
    "T40: SP P35495 was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 6 days.",
    "T55: RP P57098 was injured while running the bases. The Diagnosis: Mild groin strain. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-08-19T00:00:00-07:00": [
    "T32: P19 has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "T39: SP P53268 was injured while throwing the ball. The diagnosis is not yet known.",
    "T59: SP P240 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 5 days.",
    "T53: RP P29862 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-08-20T00:00:00-07:00": [
    "T55: SS P62154 was injured . The Diagnosis: Viral infection. This is a day-to-day injury expected to last 4 days.",
    "T35: SP P62248 was injured . The Diagnosis: Asthma. This is a day-to-day injury expected to last 3 days.",
    "T33: SP P24376 was injured while pitching. The diagnosis is not yet known.",
    "T58: SP P23588 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last one week.",
    "T48: SP P53711 was injured while pitching. The Diagnosis: Strained hamstring. He's expected to miss about 6 weeks.",
    "T33: RF P53671 was injured while throwing the ball. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 2 days.",
    "T31: LF P22620 was injured being hit by a pitch. The Diagnosis: Bruised wrist. This is a day-to-day injury expected to last 1 day.",
    "T57: 3B P30918 was injured while running the bases. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 5 days.",
    "T36: RP P29659 was injured while pitching. The diagnosis is not yet known.",
    "T45: RP P53708 was injured while pitching. The Diagnosis: Forearm stiffness. He's expected to miss about 5 days."
  ],
  "2025-08-21T00:00:00-07:00": [
    "T33: SP P24376 diagnosed with a strained abdominal muscle, will miss 5-6 weeks.",
    "T45: RP P49738 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days.",
    "T52: 2B P36987 was injured while throwing the ball. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 2 days.",
    "T52: SP P56974 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 6 days.",
    "T31: RP P1363 was injured while pitching. The Diagnosis: Tender shoulder. This is a day-to-day injury expected to last 6 days.",
    "T32: SP P22627 was injured while pitching. The Diagnosis: Hand soreness. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-08-22T00:00:00-07:00": [
    "T39: SP P53268 diagnosed with a torn flexor tendon in his elbow, will miss 5-6 months.",
    "T40: SS P25221 was injured in a collision at a base. The diagnosis is not yet known.",
    "T45: 2B P28185 was injured while running the bases. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 4 days.",
    "T47: SP P35903 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-08-23T00:00:00-07:00": [
    "T40: SS P25221 diagnosed with an oblique strain, will miss 3-4 weeks.",
    "T57: SP P61866 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 1 day.",
    "T49: SP P243 was injured while pitching. The Diagnosis: Tired arm. This is a day-to-day injury expected to last one week."
  ],
  "2025-08-24T00:00:00-07:00": [
    "T36: RP P29659 diagnosed with a fractured coracoid bone in his shoulder, will miss 5 months.",
    "T41: RP P30109 was injured while pitching. The Diagnosis: Forearm soreness. This is a day-to-day injury expected to last 6 days.",
    "T57: RF P37421 was injured while throwing the ball. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last one week.",
    "T36: 3B P19583 was injured while running the bases. The diagnosis is not yet known.",
    "T58: RP P26270 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-08-25T00:00:00-07:00": [
    "T36: 3B P19583 diagnosed with hamstring spasms, is day-to-day for 2 days.",
    "T35: SP P26430 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 1 day."
  ]
}
