{
  "2025-05-26T00:00:00-07:00": [
    "T38: LF P20111 diagnosed with a ruptured finger tendon, will miss 4 months.",
    "T32: RF P26879 diagnosed with a concussion, is day-to-day for 2 days.",
    "T59: 3B P56515 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 4 days.",
    "T50: 3B P23933 was injured while running the bases. The Diagnosis: Bruised shoulder. This is a day-to-day injury expected to last 1 day.",
    "T50: SP P24403 was injured while pitching. The diagnosis is not yet known.",
    "T58: RF P54839 was injured while running the bases. The diagnosis is not yet known.",
    "T49: SP P1816 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last one week.",
    "T56: SP P29699 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 6 days.",
    "T56: 2B P28860 was injured in a collision at a base. The Diagnosis: Sprained elbow. This is a day-to-day injury expected to last 2 weeks."
  ],
  "2025-05-27T00:00:00-07:00": [
    "T32: P22627 has suffered a setback in his recovery. He is not expected to recover for another 3 weeks.",
    "T50: SP P24403 diagnosed with a torn rotator cuff, will miss 13 months.",
    "T50: RF P27864 diagnosed with an oblique strain, will miss 5 weeks.",
    "T59: P39888 has suffered a setback in his recovery. He is not expected to recover for another 5 weeks.",
    "T58: RF P54839 diagnosed with a strained quad, is day-to-day for 5 weeks.",
    "T34: RP P25102 was injured while pitching. The diagnosis is not yet known.",
    "T52: C P50013 was injured while running the bases. The diagnosis is not yet known.",
    "T33: 2B P32425 was injured while throwing the ball. The diagnosis is not yet known.",
    "T33: CF P55381 was injured while throwing the ball. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-05-28T00:00:00-07:00": [
    "T59: RP P26074 diagnosed with shoulder inflammation, will miss 7-8 months.",
    "T38: CF P55650 diagnosed with a fractured cheekbone, will miss 4 weeks.",
    "T53: SP P54511 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 2 weeks.",
    "T53: RP P53626 was injured while pitching. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last 5 days.",
    "T32: 2B P37609 was injured while running the bases. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-05-29T00:00:00-07:00": [
    "T32: P29818 has suffered a setback in his recovery. He is not expected to recover for another 8 weeks.",
    "T37: P33265 has suffered a setback in his recovery. He is not expected to recover for another 2-3 weeks.",
    "T52: C P50013 diagnosed with a thumb contusion, is day-to-day for 1 day.",
    "T49: RP P23601 was injured while pitching. The diagnosis is not yet known.",
    "T55: 2B P35263 was injured while throwing the ball. The Diagnosis: Triceps strain. He's expected to miss about 6 weeks.",
    "T44: C P37330 was injured while running the bases. The Diagnosis: Hamstring tightness. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-05-30T00:00:00-07:00": [
    "T34: RP P25102 diagnosed with a torn flexor tendon in his elbow, will miss 8 months.",
    "T33: 2B P32425 diagnosed with a sprained ankle, will miss 5 weeks.",
    "T34: C P28405 was injured while running the bases. The Diagnosis: Sprained ankle. He's expected to miss about 5 weeks.",
    "T55: SP P49917 was injured while pitching. The Diagnosis: Tired arm. This is a day-to-day injury expected to last one week.",
    "T60: SS P53701 was injured while throwing the ball. The diagnosis is not yet known.",
    "T46: SP P35495 was injured while pitching. The Diagnosis: Sore thumb. This is a day-to-day injury expected to last 1 day.",
    "T54: CF P28737 was injured on a defensive play. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 2 weeks."
  ],
  "2025-05-31T00:00:00-07:00": [
    "T49: RP P23601 diagnosed with a strained oblique, is day-to-day for 4 weeks.",
    "T43: 1B P27172 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days.",
    "T35: CF P29786 was injured in a collision at a base. The Diagnosis: Fractured foot. He's expected to miss about 3 weeks."
  ],
  "2025-06-01T00:00:00-07:00": [
    "T58: RP P22613 was injured while pitching. The Diagnosis: Shoulder tendinitis. This is a day-to-day injury expected to last one week.",
    "T59: RP P34312 was injured while pitching. The Diagnosis: Heel soreness. This is a day-to-day injury expected to last 1 day.",
    "T47: RF P27200 was injured while running the bases. The Diagnosis: Sprained thumb. This is a day-to-day injury expected to last 1-2 weeks.",
    "T44: SP P54892 was injured while pitching. The diagnosis is not yet known.",
    "T32: RP P25031 was injured while pitching. The diagnosis is not yet known."
  ]
}
