{
  "2025-09-22T00:00:00-07:00": [
    "T50: SP P29693 diagnosed with a strained oblique, will miss 5-6 weeks.",
    "T60: CL P30307 diagnosed with shoulder inflammation, will miss 5 months.",
    "T42: RP P34703 diagnosed with ulnar nerve entrapment, will miss 3-4 months.",
    "T34: SP P37157 diagnosed with an elbow strain, will miss 6 weeks.",
    "T36: CF P55785 diagnosed with a strained anterior cruciate ligament, will miss 4-5 weeks.",
    "T31: 2B P57379 diagnosed with a fractured ankle, will miss 4 months.",
    "T54: LF P22818 was injured while running the bases. The Diagnosis: Sore groin. This is a day-to-day injury expected to last 3 days.",
    "T33: SP P1380 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 1-2 weeks.",
    "T58: SS P55249 was injured while running the bases. The Diagnosis: Knee inflammation. This is a day-to-day injury expected to last 4 days.",
    "T31: RP P24464 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last one week."
  ],
  "2025-09-23T00:00:00-07:00": [
    "T38: P31802 has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "T33: C P31093 was injured in a collision at a base. The Diagnosis: Sprained finger. This is a day-to-day injury expected to last one week.",
    "T57: RP P23534 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 2 days.",
    "T50: SP P34824 was injured while pitching. The Diagnosis: Pulled abdominal muscle. This is a day-to-day injury expected to last one week."
  ],
  "2025-09-24T00:00:00-07:00": [
    "T57: P53267 has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "T31: CF P55780 was injured . The Diagnosis: Allergic reaction. This injury keeps him out of action for 4 days.",
    "T31: CL P1461 was injured while pitching. The Diagnosis: Sprained ankle. He's expected to miss about 2-3 weeks.",
    "T31: RP P1363 was injured while pitching. The diagnosis is not yet known.",
    "T45: CF P1473 was injured while throwing the ball. The Diagnosis: Strained back. This is a day-to-day injury expected to last 2 weeks.",
    "T34: CF P56373 was injured while running the bases. The Diagnosis: Sprained ankle. He's expected to miss about 2-3 weeks.",
    "T38: 2B P25761 was injured being hit by a pitch. The Diagnosis: Concussion. This is a day-to-day injury expected to last 6 days.",
    "T39: 2B P33564 was injured while running the bases. The Diagnosis: Strained abdominal muscle. This is a day-to-day injury expected to last 3 weeks.",
    "T55: RF P47317 was injured being hit by a pitch. The Diagnosis: Bruised ankle. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-09-25T00:00:00-07:00": [
    "T57: P37027 has suffered a setback in his recovery from injury. He has elected to retire rather than continue his rehabilitation. This is a CAREER ENDING injury!",
    "T43: SP P28940 was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 2 days.",
    "T45: CF P1473 was injured while throwing the ball. The diagnosis is not yet known.",
    "T42: RP P53219 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 4 days.",
    "T52: RP P53509 was injured while pitching. The Diagnosis: Hand soreness. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-09-26T00:00:00-07:00": [
    "T31: RP P1363 diagnosed with a strained abdominal muscle, will miss 4 weeks.",
    "T45: CF P1473 diagnosed with elbow inflammation, will miss 2 weeks.",
    "T48: CL P27415 diagnosed with elbow inflammation, will miss 2 days.",
    "T33: RP P54493 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 1 day.",
    "T43: RF P36482 was injured while throwing the ball. The Diagnosis: Dead arm. He's expected to miss about 2 weeks.",
    "T52: RP P53509 was injured while pitching. The diagnosis is not yet known.",
    "T60: CF P39648 was injured in a collision at a base. The Diagnosis: Oblique strain. He's expected to miss about 4 weeks.",
    "T42: CL P55108 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-09-27T00:00:00-07:00": [
    "T52: RP P53509 diagnosed with a dead arm, will miss 2 days.",
    "T49: SP P27028 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 1 day.",
    "T38: SP P55495 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days.",
    "T40: RF P33764 was injured being hit by a pitch. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 4 days.",
    "T56: 1B P56436 was injured being hit by a pitch. The Diagnosis: Thumb contusion. This is a day-to-day injury expected to last 6 days.",
    "T46: 2B P53461 was injured while running the bases. The Diagnosis: Bruised thigh. This is a day-to-day injury expected to last 6 days.",
    "T44: RP P38781 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-09-28T00:00:00-07:00": [
    "T38: 2B P35840 was injured . The Diagnosis: Earache. This is a day-to-day injury expected to last 1 day.",
    "T56: SP P42128 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "T38: 2B P36759 was injured in a collision at a base. The Diagnosis: Fractured foot. He's expected to miss about 3 weeks.",
    "T45: LF P33562 was injured while running the bases. The diagnosis is not yet known.",
    "T45: SS P39877 was injured while running the bases. The Diagnosis: Strained abdominal muscle. This is a day-to-day injury expected to last 2 weeks.",
    "T52: RP P28962 was injured while pitching. The diagnosis is not yet known.",
    "T54: CL P30472 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 1 day.",
    "T56: RP P55342 was injured while pitching. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-09-29T00:00:00-07:00": [
    "T31: P24464 has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "T44: RP P38781 diagnosed with radial nerve compression, will miss 7 months."
  ]
}
