{
  "2025-04-28T00:00:00-07:00": [
    "T37: CF P33873 diagnosed with a fractured jaw, will miss 4 weeks.",
    "T36: SP P58024 was injured . The Diagnosis: Heat exhaustion. This is a day-to-day injury expected to last 2 days.",
    "T52: LF P1604 was injured being hit by a pitch. The Diagnosis: Concussion. He's expected to miss about 3-4 weeks.",
    "T32: RF P26879 was injured while running the bases. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 2 days.",
    "T46: 1B P45075 was injured being hit by a pitch. The Diagnosis: Hand contusion. He's expected to miss about 4 days.",
    "T50: CF P23504 was injured while running the bases. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 6 days.",
    "T59: SP P30082 was injured while pitching. The Diagnosis: Sore thumb. This is a day-to-day injury expected to last 2 days.",
    "T35: 2B P36682 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-04-29T00:00:00-07:00": [
    "T55: P53423 has suffered a setback in his recovery. He is not expected to recover for another 6 months.",
    "T39: 2B P62247 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days.",
    "T46: SS P23809 was injured in a collision at a base. The diagnosis is not yet known.",
    "T45: RP P49738 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-04-30T00:00:00-07:00": [
    "T48: SP P18682 diagnosed with bone chips in his elbow, will miss 3 months.",
    "T35: 2B P36682 diagnosed with a twisted ankle, is day-to-day for 2 days.",
    "T48: CF P60131 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "T40: SS P61738 was injured when he attempted to do a wheelie on his motorcycle. The Diagnosis: Foot soreness. This is a day-to-day injury expected to last 5 days.",
    "T47: RP P35889 was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week.",
    "T46: LF P24576 was injured being hit by a pitch. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 1 day.",
    "T37: 2B P25145 was injured while throwing the ball. The Diagnosis: Sore shoulder. He's expected to miss about 5 weeks.",
    "T48: SP P21 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-05-01T00:00:00-07:00": [
    "T46: SS P23809 diagnosed with a partially torn labrum, will miss 6 weeks.",
    "T41: RP P30109 was injured while pitching. The diagnosis is not yet known.",
    "T55: 2B P50670 was injured while throwing the ball. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-05-02T00:00:00-07:00": [
    "T41: RP P30109 diagnosed with hamstring soreness, is day-to-day for 3 days.",
    "T49: 2B P53050 was injured in a collision at a base. The Diagnosis: Sprained elbow. This is a day-to-day injury expected to last 2-3 weeks.",
    "T34: SP P38158 was injured while pitching. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-05-03T00:00:00-07:00": [
    "T48: SP P21 diagnosed with a partially torn labrum, will miss 4 months.",
    "T59: SS P39888 was injured in a collision at a base. The diagnosis is not yet known.",
    "T35: RP P55801 was injured while pitching. The diagnosis is not yet known.",
    "T32: SP P28401 was injured while throwing the ball. The diagnosis is not yet known.",
    "T57: RF P37421 was injured on a defensive play. The diagnosis is not yet known.",
    "T44: SP P43033 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last one week.",
    "T50: LF P55254 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-05-04T00:00:00-07:00": [
    "T32: SP P28401 diagnosed with a sore elbow, is day-to-day for 3 days.",
    "T54: 3B P34032 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T32: SP P22627 was injured while pitching. The diagnosis is not yet known.",
    "T33: C P1439 was injured while running the bases. The Diagnosis: Sprained knee. This is a day-to-day injury expected to last one week.",
    "T33: C P31093 was injured in a collision at a base. The Diagnosis: Hamstring strain. He's expected to miss about 3 weeks.",
    "T34: DH P30166 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-05-05T00:00:00-07:00": [
    "T54: 3B P34032 diagnosed with a dislocated finger, but will not miss any additional time.",
    "T45: 3B P50298 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 3 days.",
    "T35: RP P55801 diagnosed with hamstring soreness, is day-to-day for 5 days.",
    "T59: C P58043 was injured . The Diagnosis: Virus. This is a day-to-day injury expected to last 6 days."
  ]
}
