{
  "2025-04-07T00:00:00-07:00": [
    "T57: RP P1958 diagnosed with forearm inflammation, will miss 4 weeks.",
    "T45: RP P26672 diagnosed with radial nerve compression, will miss 4-5 months.",
    "T47: SP P58334 was injured . The Diagnosis: Migraine. This is a day-to-day injury expected to last 2 days.",
    "T53: SS P50269 was injured in a collision at a base. The diagnosis is not yet known.",
    "T59: 1B P53368 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-04-08T00:00:00-07:00": [
    "T34: 2B P20675 was injured . The Diagnosis: Virus. This is a day-to-day injury expected to last 3 days.",
    "T57: CF P53732 was injured while running the bases. The Diagnosis: Sore Achilles tendon. This is a day-to-day injury expected to last one week.",
    "T42: RP P53263 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-04-09T00:00:00-07:00": [
    "T59: 1B P53368 diagnosed with a mild hamstring strain, is day-to-day for one week.",
    "T50: 3B P23933 was injured being hit by a pitch. The diagnosis is not yet known."
  ],
  "2025-04-10T00:00:00-07:00": [
    "T50: SS P1459 was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 3 days.",
    "T53: SS P50269 diagnosed with a torn ligament in his thumb, will miss 5 weeks.",
    "T35: CF P52197 was injured on a defensive play. The Diagnosis: Strained hamstring. He's expected to miss about 5 weeks.",
    "T33: C P1439 was injured being hit by a pitch. The Diagnosis: Jammed finger. This is a day-to-day injury expected to last 1 day.",
    "T59: SP P34312 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 4 days.",
    "T42: SP P24039 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last one week.",
    "T60: SP P27076 was injured while pitching. The Diagnosis: Tender shoulder. This is a day-to-day injury expected to last 4 days.",
    "T42: RP P53263 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 4 days.",
    "T31: SP P39005 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 2 weeks.",
    "T31: 3B P51127 was injured in a collision at a base. The diagnosis is not yet known.",
    "T47: SP P37102 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-04-11T00:00:00-07:00": [
    "T50: 3B P23933 diagnosed with a fractured thumb, will miss 3 weeks.",
    "T47: SP P37102 diagnosed with bone chips in his elbow, will miss 7 months.",
    "T37: CF P36858 was injured being hit by a pitch. The Diagnosis: Concussion. He's expected to miss about 4 weeks.",
    "T48: SP P18682 was injured while pitching. The diagnosis is not yet known.",
    "T41: CL P50900 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 1 day.",
    "T44: RF P35161 was injured on a defensive play. The Diagnosis: Herniated disc (neck). He's expected to miss about 4 weeks."
  ],
  "2025-04-12T00:00:00-07:00": [
    "T48: SP P18682 diagnosed with a strained abdominal muscle, is day-to-day for 6 days.",
    "T43: SP P28940 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 3 days.",
    "T39: SP P22840 was injured while pitching. The diagnosis is not yet known.",
    "T57: RP P33217 was injured while pitching. The diagnosis is not yet known.",
    "T44: CF P53206 was injured while running the bases. The Diagnosis: Patellar tendinitis. He's expected to miss about 1-2 weeks.",
    "T47: CF P62067 was injured while running the bases. The Diagnosis: Bruised foot. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-04-13T00:00:00-07:00": [
    "T47: SP P29860 was injured . The Diagnosis: Conjunctivitis. This is a day-to-day injury expected to last 2 days.",
    "T57: RP P33217 diagnosed with elbow inflammation, will miss 6 weeks.",
    "T31: 3B P51127 diagnosed with a sprained ankle, will miss 4 weeks.",
    "T42: 3B P60187 was injured . The Diagnosis: Viral infection. This is a day-to-day injury expected to last 3 days.",
    "T44: C P37330 was injured while running the bases. The diagnosis is not yet known.",
    "T56: SS P30248 was injured being hit by a pitch. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 3 days.",
    "T49: SP P35120 was injured while pitching. The Diagnosis: Acute elbow soreness. He's expected to miss about 7-8 weeks.",
    "T42: RP P25116 was injured while pitching. The Diagnosis: Strained hamstring. He's expected to miss about 6 weeks."
  ]
}
