{
  "2025-07-14T00:00:00-07:00": [
    "T56: P28860 has suffered a setback in his recovery. He is not expected to recover for another 3 months.",
    "T39: RP P29724 diagnosed with a partially torn labrum, will miss 3 months.",
    "T45: SP P38782 diagnosed with back tightness, is day-to-day for 1-2 weeks.",
    "T49: LF P39461 diagnosed with a sore ankle, is day-to-day for 3 days.",
    "T35: RP P53687 was injured while pitching. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last 3 weeks."
  ],
  "2025-07-15T00:00:00-07:00": [
    "T48: C P33558 diagnosed with a strained abdominal muscle, is day-to-day for one week."
  ],
  "2025-07-16T00:00:00-07:00": [
    "T49: P52269 has suffered a setback in his recovery. He is not expected to recover for another 5 months."
  ],
  "2025-07-17T00:00:00-07:00": [
    "T39: SP P57760 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-07-18T00:00:00-07:00": [
    "T33: P30724 has suffered a setback in his recovery. He is not expected to recover for another one week."
  ],
  "2025-07-19T00:00:00-07:00": [
    "T40: LF P49648 was injured in a collision at a base. The diagnosis is not yet known.",
    "T33: 2B P32425 was injured while running the bases. The diagnosis is not yet known.",
    "T60: RP P22192 was injured while pitching. The diagnosis is not yet known.",
    "T43: SP P42765 was injured while pitching. The diagnosis is not yet known.",
    "T58: LF P25233 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T43: RP P26298 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-07-20T00:00:00-07:00": [
    "T43: RP P26298 diagnosed with a strained oblique, is day-to-day for 2-3 weeks.",
    "T43: SP P42765 diagnosed with a bone spur in his elbow, will miss 4-5 months.",
    "T47: SP P35903 was injured while pitching. The diagnosis is not yet known.",
    "T53: SP P50114 was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 1 day.",
    "T34: SP P28398 was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 4 days.",
    "T35: SP P8 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-07-21T00:00:00-07:00": [
    "T33: 2B P32425 diagnosed with knee inflammation, is day-to-day for 1-2 weeks.",
    "T40: LF P49648 diagnosed with an intercostal strain, will miss 6 days."
  ]
}
