{
  "2025-09-15T00:00:00-07:00": [
    "T35: SP P25144 diagnosed with an arthritic elbow, will miss 4 months.",
    "T33: P52589 has suffered a setback in his recovery. He is not expected to recover for another 1-2 weeks.",
    "T54: RF P37110 was injured while running the bases. The Diagnosis: Bruised thigh. This is a day-to-day injury expected to last 3 days.",
    "T58: RP P22613 was injured while pitching. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 2 weeks.",
    "T58: SS P52926 was injured while running the bases. The Diagnosis: Sprained knee. This is a day-to-day injury expected to last 6 days.",
    "T58: DH P33470 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T57: RF P53267 was injured while running the bases. The diagnosis is not yet known.",
    "T46: SP P38690 was injured while pitching. The Diagnosis: Neck stiffness. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-09-16T00:00:00-07:00": [
    "T35: SP P26430 diagnosed with an elbow strain, will miss 5 weeks.",
    "T57: RF P53267 diagnosed with a hyperextended knee, but will not miss any additional time.",
    "T55: CF P56774 diagnosed with a broken hand, will miss 4 months.",
    "T39: RP P20230 was injured while pitching. The Diagnosis: Neck stiffness. This is a day-to-day injury expected to last 4 days.",
    "T55: RP P53656 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 3 days.",
    "T40: RP P2212 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last one week.",
    "T43: 3B P37049 was injured while running the bases. The Diagnosis: Sprained ankle. He's expected to miss about 3 weeks."
  ],
  "2025-09-17T00:00:00-07:00": [
    "T38: SP P26985 diagnosed with bone chips in his elbow, will miss 5-6 months.",
    "T40: RP P35495 diagnosed with shoulder inflammation, will miss 3 months.",
    "T53: RF P55096 was injured while throwing the ball. The diagnosis is not yet known.",
    "T50: SP P29693 was injured while pitching. The diagnosis is not yet known.",
    "T59: SP P23920 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-09-18T00:00:00-07:00": [
    "T59: SP P23920 diagnosed with a tired arm, is day-to-day for one week.",
    "T39: RP P20230 was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 4 days.",
    "T34: RP P29714 was injured while pitching. The diagnosis is not yet known.",
    "T46: SS P22823 was injured in a collision at a base. The Diagnosis: Strained back. He's expected to miss about 2 weeks.",
    "T38: RP P31811 was injured while pitching. The Diagnosis: Elbow tendinitis. He's expected to miss about 4-5 weeks.",
    "T38: SS P31802 was injured while running the bases. The Diagnosis: Elbow contusion. This is a day-to-day injury expected to last one week.",
    "T45: RP P55350 was injured while pitching. The Diagnosis: Hand soreness. This is a day-to-day injury expected to last 3 days.",
    "T42: SP P24039 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last one week.",
    "T42: RP P34703 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-09-19T00:00:00-07:00": [
    "T58: DH P33470 diagnosed with a concussion, will miss 2 weeks.",
    "T56: C P53522 was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 2 days.",
    "T60: CL P30307 was injured while pitching. The diagnosis is not yet known.",
    "T34: SP P37157 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-09-20T00:00:00-07:00": [
    "T51: SP P38786 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 3 days.",
    "T54: SP P53369 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 5 days.",
    "T54: 1B P50897 was injured being hit by a pitch. The Diagnosis: Fractured hand. He's expected to miss about 4 weeks."
  ],
  "2025-09-21T00:00:00-07:00": [
    "T34: RP P29714 diagnosed with a bone spur in his elbow, will miss 4-5 months.",
    "T53: RF P55096 diagnosed with a hamstring strain, will miss 4 weeks.",
    "T35: RP P53687 was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week.",
    "T38: RP P41084 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 3 days.",
    "T48: CL P27415 was injured while pitching. The diagnosis is not yet known.",
    "T31: 2B P57379 was injured while running the bases. The diagnosis is not yet known.",
    "T60: RP P22763 was injured while pitching. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 4 days.",
    "T36: C P20809 was injured while running the bases. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last one week.",
    "T36: CF P55785 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-09-22T00:00:00-07:00": [
    "T50: SP P29693 diagnosed with a strained oblique, will miss 5-6 weeks.",
    "T60: CL P30307 diagnosed with shoulder inflammation, will miss 5 months.",
    "T42: RP P34703 diagnosed with ulnar nerve entrapment, will miss 3-4 months.",
    "T34: SP P37157 diagnosed with an elbow strain, will miss 6 weeks.",
    "T36: CF P55785 diagnosed with a strained anterior cruciate ligament, will miss 4-5 weeks.",
    "T31: 2B P57379 diagnosed with a fractured ankle, will miss 4 months."
  ]
}
