{
  "2025-06-02T00:00:00-07:00": [
    "T47: SP P38571 was injured while pitching. The Diagnosis: Elbow inflammation. He's expected to miss about one week.",
    "T43: SP P28940 was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-06-03T00:00:00-07:00": [
    "T56: P28860 has suffered a setback in his recovery. He is not expected to recover for another one week.",
    "T60: SS P53701 diagnosed with a forearm strain, will miss 4 weeks.",
    "T44: SP P54892 diagnosed with a strained back muscle, will miss 3 weeks.",
    "T38: 1B P54928 was injured in a collision at a base. The Diagnosis: Intercostal strain. He's expected to miss about 2 weeks.",
    "T32: SP P22377 was injured while pitching. The Diagnosis: Herniated disc (back). He's expected to miss about 6 days.",
    "T38: SP P25296 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days.",
    "T58: 2B P52260 was injured while running the bases. The Diagnosis: Mild hip strain. This is a day-to-day injury expected to last 2 weeks.",
    "T52: 3B P30583 was injured while running the bases. The Diagnosis: Patellar tendinitis. He's expected to miss about 2 weeks.",
    "T53: SS P50265 was injured in a collision at a base. The Diagnosis: Bruised foot. This is a day-to-day injury expected to last one week.",
    "T33: RP P23653 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days.",
    "T53: RP P29862 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 2 days.",
    "T35: RF P23180 was injured while running the bases. The Diagnosis: Sprained thumb. This is a day-to-day injury expected to last 1-2 weeks.",
    "T50: CF P52940 was injured while running the bases. The Diagnosis: Strained posterior cruciate ligament. He's expected to miss about 3-4 weeks.",
    "T48: SP P53054 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 2 weeks.",
    "T49: SP P35120 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last one week."
  ],
  "2025-06-04T00:00:00-07:00": [
    "T32: RP P25031 diagnosed with a strained shoulder, will miss 8 weeks.",
    "T48: SP P37031 was injured while pitching. The diagnosis is not yet known.",
    "T45: CF P1473 was injured while running the bases. The diagnosis is not yet known.",
    "T31: LF P22620 was injured while throwing the ball. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last 6 days.",
    "T51: CL P37013 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-06-05T00:00:00-07:00": [
    "T33: LF P36905 was injured . The Diagnosis: Sinus infection. This is a day-to-day injury expected to last 1 day.",
    "T42: SP P57713 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 1 day.",
    "T57: 1B P62076 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 1 day.",
    "T33: SP P24376 was injured while pitching. The diagnosis is not yet known.",
    "T33: RP P54493 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days.",
    "T51: 2B P42045 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-06-06T00:00:00-07:00": [
    "T51: CL P37013 diagnosed with hamstring soreness, is day-to-day for 1 day.",
    "T51: 2B P42045 diagnosed with an oblique strain, will miss 2 weeks.",
    "T31: C P52932 was injured . The Diagnosis: Heat exhaustion. This is a day-to-day injury expected to last 2 days.",
    "T46: RP P653 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last one week."
  ],
  "2025-06-07T00:00:00-07:00": [
    "T45: CF P1473 diagnosed with a strained hamstring, will miss 6 weeks.",
    "T52: LF P1604 was injured . The Diagnosis: Sinus infection. This is a day-to-day injury expected to last 1 day.",
    "T33: SP P24376 diagnosed with a torn biceps, will miss 2 months.",
    "T48: SP P37031 diagnosed with a sprained ankle, will miss 2 months.",
    "T57: SP P57161 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-06-08T00:00:00-07:00": [
    "T42: RP P26980 was injured . The Diagnosis: Inner ear infection. This is a day-to-day injury expected to last 4 days.",
    "T31: RF P1390 was injured being hit by a pitch. The Diagnosis: Thumb contusion. This is a day-to-day injury expected to last 3 days.",
    "T34: 2B P22595 was injured while running the bases. The Diagnosis: Oblique strain. He's expected to miss about one week.",
    "T47: SP P25132 was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 3 days.",
    "T43: RF P36482 was injured while throwing the ball. The Diagnosis: Dead arm. He's expected to miss about 2 weeks.",
    "T42: CL P55108 was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 3 days.",
    "T59: SS P18196 was injured being hit by a pitch. The Diagnosis: Bone bruise (wrist). He's expected to miss about 2 weeks.",
    "T52: RF P23261 was injured while throwing the ball. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 2 days."
  ]
}
