{
  "2025-09-29T00:00:00-07:00": [
    "T31: P24464 has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "T44: RP P38781 diagnosed with radial nerve compression, will miss 7 months.",
    "T43: SP P22463 was injured while pitching. The diagnosis is not yet known.",
    "T45: 2B P28185 was injured in a collision at a base. The diagnosis is not yet known.",
    "T60: LF P53593 was injured on a defensive play. The diagnosis is not yet known."
  ],
  "2025-09-30T00:00:00-07:00": [
    "T52: RP P28962 diagnosed with a torn flexor tendon in his elbow, will miss 12-13 months.",
    "T34: C P61565 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 1 day.",
    "T45: SP P24221 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 1-2 weeks.",
    "T48: SP P53054 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 5 days.",
    "T58: SS P55249 was injured in a collision at a base. The diagnosis is not yet known."
  ],
  "2025-10-01T00:00:00-07:00": [
    "T45: 2B P28185 diagnosed with a sore elbow, is day-to-day for 3-4 weeks.",
    "T60: LF P53593 diagnosed with a finger sprain, is day-to-day for 1-2 weeks.",
    "T55: SP P62140 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 2 days.",
    "T34: 3B P25187 was injured while running the bases. The diagnosis is not yet known.",
    "T53: C P55237 was injured while running the bases. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 6 days.",
    "T60: C P57250 was injured while running the bases. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 1 day.",
    "T48: SP P32146 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-10-02T00:00:00-07:00": [
    "T43: SP P22463 diagnosed with a strained back muscle, will miss 3 weeks.",
    "T31: P24464 has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "T34: 3B P25187 diagnosed with a bruised toe, is day-to-day for 2 days.",
    "T45: LF P33562 diagnosed with a fractured ankle, will miss 3 months.",
    "T58: SS P55249 diagnosed with chronic back soreness, will miss 4-5 weeks.",
    "T47: SP P35903 was injured while pitching. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 5 days.",
    "T54: CL P30472 was injured while pitching. The diagnosis is not yet known.",
    "T44: CF P53206 was injured while running the bases. The diagnosis is not yet known.",
    "T52: SS P53182 was injured in a collision at a base. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 2 weeks.",
    "T38: 2B P26531 was injured while running the bases. The Diagnosis: Fractured foot. He's expected to miss about 5 weeks."
  ],
  "2025-10-03T00:00:00-07:00": [
    "T47: 1B P27296 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 1 day.",
    "T54: CL P30472 diagnosed with a sore back, is day-to-day for 2 days.",
    "T47: LF P37294 was injured while playing football. The Diagnosis: Strained forearm. This injury keeps him out of action for 4 weeks.",
    "T39: SP P63825 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 2 days.",
    "T52: C P29948 was injured being hit by a pitch. The Diagnosis: Bruised thigh. This is a day-to-day injury expected to last one week."
  ],
  "2025-10-04T00:00:00-07:00": [
    "T44: CF P53206 diagnosed with a sore groin, but will not miss any additional time.",
    "T52: SS P53182 was injured while running the bases. The Diagnosis: Torn hamstring. He's expected to miss about 4 weeks."
  ],
  "2025-10-05T00:00:00-07:00": [
    "T60: P52538 has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "T32: 3B P36477 was injured in a collision at a base. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 3 days.",
    "T40: RF P23845 was injured while running the bases. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 3 days.",
    "T32: 2B P53560 was injured in a collision at a base. The Diagnosis: Sprained ankle. He's expected to miss about 4 weeks.",
    "T37: SS P33265 was injured while running the bases. The diagnosis is not yet known.",
    "T37: 2B P53964 was injured while running the bases. The Diagnosis: Sore groin. This is a day-to-day injury expected to last 1 day.",
    "T55: SP P52164 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-10-06T00:00:00-07:00": [
    "T45: P24221 has suffered a setback in his recovery. He is not expected to recover for another one week."
  ]
}
