{
  "2025-04-14T00:00:00-07:00": [
    "T54: RP P1533 was injured while pitching. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 2 days.",
    "T51: RF P34915 was injured in a collision at a base. The diagnosis is not yet known.",
    "T37: SP P29832 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 1 day.",
    "T45: RP P24221 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-04-15T00:00:00-07:00": [
    "T44: C P37330 diagnosed with a strained oblique, is day-to-day for 2 weeks.",
    "T53: CF P56446 was injured . The Diagnosis: Stomach virus. This is a day-to-day injury expected to last 3 days.",
    "T36: 3B P30062 was injured while running the bases. The Diagnosis: Heel soreness. This is a day-to-day injury expected to last 2 days.",
    "T58: CF P53426 was injured while running the bases. The diagnosis is not yet known.",
    "T59: SP P34312 was injured while pitching. The diagnosis is not yet known.",
    "T49: SP P52269 was injured while pitching. The diagnosis is not yet known.",
    "T49: RP P23027 was injured while pitching. The Diagnosis: Strained forearm. This is a day-to-day injury expected to last one week.",
    "T34: RP P50246 was injured while pitching. The diagnosis is not yet known.",
    "T49: RP P24589 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 6 days.",
    "T59: SP P23920 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-04-16T00:00:00-07:00": [
    "T39: SP P22840 diagnosed with a torn labrum, will miss 7 months.",
    "T45: RP P24221 diagnosed with rotator cuff inflammation, will miss 2 months.",
    "T36: RP P26062 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 1 day.",
    "T59: SP P34312 diagnosed with a strained oblique, but will not miss any additional time.",
    "T34: RP P50246 diagnosed with a torn flexor tendon in his elbow, will miss 6 months.",
    "T60: RF P33603 was injured while running the bases. The Diagnosis: Foot soreness. This is a day-to-day injury expected to last 2 days.",
    "T51: RP P37013 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 3 days.",
    "T40: RF P23845 was injured while throwing the ball. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last one week.",
    "T32: 3B P36477 was injured in a collision at a base. The Diagnosis: Bruised forearm. This is a day-to-day injury expected to last 4 days.",
    "T48: RP P21968 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 5 days.",
    "T53: SS P50265 was injured in a collision at a base. The Diagnosis: Oblique strain. He's expected to miss about 1-2 weeks."
  ],
  "2025-04-17T00:00:00-07:00": [
    "T59: SP P23920 diagnosed with a torn back muscle, will miss 5 months.",
    "T49: SP P52269 diagnosed with a bone spur in his elbow, will miss 4-5 months.",
    "T58: CF P53426 diagnosed with an intercostal strain, will miss 3 days.",
    "T40: SS P60178 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 1 day.",
    "T54: 1B P36650 was injured in a collision at a base. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last one week.",
    "T42: LF P34868 was injured while running the bases. The Diagnosis: Sore groin. This is a day-to-day injury expected to last 1 day.",
    "T42: CF P50258 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T48: CF P25047 was injured while throwing the ball. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 3 days.",
    "T58: LF P25233 was injured on a defensive play. The Diagnosis: Post-concussion syndrome. He's expected to miss about 3 months."
  ],
  "2025-04-18T00:00:00-07:00": [
    "T60: P206 has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "T51: RF P34915 diagnosed with a hamstring strain, will miss 3 weeks.",
    "T58: RP P41003 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days.",
    "T40: SP P37027 was injured while pitching. The Diagnosis: Rotator cuff strain. He's expected to miss about 2 weeks.",
    "T35: SP P22516 was injured while pitching. The diagnosis is not yet known.",
    "T34: CL P37285 was injured while pitching. The Diagnosis: Shoulder tendinitis. He's expected to miss about 6 weeks.",
    "T55: RP P53617 was injured while pitching. The diagnosis is not yet known.",
    "T46: RP P1128 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 3 weeks."
  ],
  "2025-04-19T00:00:00-07:00": [
    "T35: SP P22516 diagnosed with a sprained ankle, is day-to-day for 5 days.",
    "T34: RF P25187 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 1 day.",
    "T55: RP P53617 diagnosed with a sore ankle, is day-to-day for 2 days.",
    "T56: CF P62079 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 1 day.",
    "T51: SP P28755 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 3 days.",
    "T50: CF P37040 was injured in a collision at a base. The diagnosis is not yet known.",
    "T32: CF P281 was injured while running the bases. The Diagnosis: Bruised ankle. This is a day-to-day injury expected to last 3 days.",
    "T38: SP P33166 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 1 day.",
    "T60: RP P52538 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 6 days.",
    "T41: SP P39138 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last one week."
  ],
  "2025-04-20T00:00:00-07:00": [
    "T42: CF P50258 diagnosed with a broken kneecap, will miss 4 months.",
    "T35: LF P53205 was injured in a collision at a base. The Diagnosis: Intercostal strain. He's expected to miss about 3-4 weeks.",
    "T57: 3B P30918 was injured while running the bases. The Diagnosis: Hamstring spasms. This is a day-to-day injury expected to last 4 days.",
    "T57: 2B P50894 was injured while running the bases. The Diagnosis: Hand contusion. He's expected to miss about one week.",
    "T45: 2B P40464 was injured while running the bases. The Diagnosis: Patellar tendinitis. He's expected to miss about one week."
  ],
  "2025-04-21T00:00:00-07:00": [
    "T50: CF P37040 diagnosed with a broken hamate bone in his wrist, will miss 2-3 months.",
    "T51: RP P38611 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 1 day.",
    "T49: RF P61748 was injured while playing football. The Diagnosis: Hand soreness. This is a day-to-day injury expected to last 3 days."
  ]
}
