{
  "2025-05-19T00:00:00-07:00": [
    "T48: SP P37031 diagnosed with hamstring soreness, is day-to-day for 4 days.",
    "T40: LF P55546 diagnosed with a mild hamstring strain, is day-to-day for 1-2 weeks.",
    "T56: SP P37318 was injured while pitching. The diagnosis is not yet known.",
    "T47: SP P2144 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 1 day.",
    "T42: 2B P1150 was injured in a collision at a base. The Diagnosis: Strained back. This is a day-to-day injury expected to last 3 days.",
    "T33: RP P52589 was injured while pitching. The diagnosis is not yet known.",
    "T45: 3B P50298 was injured while throwing the ball. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 2 days.",
    "T50: SS P31862 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-05-20T00:00:00-07:00": [
    "T40: RP P26432 diagnosed with elbow tendinitis, will miss 6 weeks.",
    "T56: SP P27493 diagnosed with elbow inflammation, will miss 5-6 weeks.",
    "T33: RP P52589 diagnosed with radial nerve compression, will miss 4 months.",
    "T59: SS P25509 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-05-21T00:00:00-07:00": [
    "T59: SS P25509 diagnosed with knee tendinitis, is day-to-day for 3 weeks.",
    "T50: SS P31862 diagnosed with a sore heel, but will not miss any additional time.",
    "T56: SP P37318 diagnosed with a sore elbow, is day-to-day for 3 days.",
    "T59: SP P57971 was injured . The Diagnosis: Dizziness and nausea. This is a day-to-day injury expected to last 3 days.",
    "T48: 1B P25185 was injured while running the bases. The Diagnosis: Strained hamstring. This is a day-to-day injury expected to last 2-3 weeks.",
    "T48: LF P38630 was injured while running the bases. The Diagnosis: Mild hip strain. This is a day-to-day injury expected to last 3 days.",
    "T41: 2B P30965 was injured in a collision at a base. The Diagnosis: Foot soreness. This is a day-to-day injury expected to last 5 days.",
    "T41: RP P22776 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 6 days.",
    "T54: RP P54914 was injured while pitching. The diagnosis is not yet known.",
    "T46: SP P30024 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-05-22T00:00:00-07:00": [
    "T54: RP P54914 diagnosed with a finger blister, is day-to-day for 2 days.",
    "T56: SP P54513 was injured while pitching. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 4 days.",
    "T41: RP P22776 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 3 days.",
    "T54: 2B P37079 was injured while running the bases. The diagnosis is not yet known.",
    "T54: RP P53584 was injured while pitching. The diagnosis is not yet known.",
    "T46: 3B P21306 was injured being hit by a pitch. The Diagnosis: Bone bruise (wrist). He's expected to miss about 3 weeks.",
    "T33: CF P55381 was injured while throwing the ball. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-05-23T00:00:00-07:00": [
    "T52: RF P23261 was injured . The Diagnosis: Viral infection. This is a day-to-day injury expected to last 4 days.",
    "T42: 2B P1150 was injured in a collision at a base. The diagnosis is not yet known.",
    "T42: 2B P25156 was injured in a collision at a base. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 1 day.",
    "T48: 2B P25190 was injured while running the bases. The diagnosis is not yet known.",
    "T60: CL P30307 was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 2 weeks.",
    "T38: RP P53453 was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week."
  ],
  "2025-05-24T00:00:00-07:00": [
    "T54: 2B P37079 diagnosed with a hyperextended ankle, is day-to-day for 1 day.",
    "T44: C P62168 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 3 days.",
    "T40: RF P23845 was injured being hit by a pitch. The Diagnosis: Bruised toe. This is a day-to-day injury expected to last 1 day.",
    "T49: CF P32323 was injured while running the bases. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 1 day.",
    "T38: LF P20111 was injured on a defensive play. The diagnosis is not yet known."
  ],
  "2025-05-25T00:00:00-07:00": [
    "T42: 2B P1150 diagnosed with a knee sprain, is day-to-day for 3 days.",
    "T48: 2B P25190 diagnosed with a torn hamstring, will miss 4 weeks.",
    "T37: LF P50086 was injured . The Diagnosis: Stomach virus. This is a day-to-day injury expected to last 4 days.",
    "T54: RP P53584 diagnosed with a strained hamstring, will miss 5 weeks.",
    "T48: SP P22420 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last one week.",
    "T50: RF P27864 was injured while running the bases. The diagnosis is not yet known.",
    "T50: 3B P23933 was injured while running the bases. The Diagnosis: Bruised shoulder. This is a day-to-day injury expected to last 3 days.",
    "T59: RP P26074 was injured while pitching. The diagnosis is not yet known.",
    "T38: CF P55650 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T32: RF P26879 was injured while stealing a base. The diagnosis is not yet known.",
    "T47: SP P38571 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last one week.",
    "T45: CF P1473 was injured while running the bases. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last one week.",
    "T58: RP P41003 was injured while pitching. The Diagnosis: Strained abdominal muscle. This is a day-to-day injury expected to last one week."
  ],
  "2025-05-26T00:00:00-07:00": [
    "T38: LF P20111 diagnosed with a ruptured finger tendon, will miss 4 months.",
    "T32: RF P26879 diagnosed with a concussion, is day-to-day for 2 days.",
    "T59: 3B P56515 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 4 days."
  ]
}
