{
  "2025-04-21T00:00:00-07:00": [
    "T50: CF P37040 diagnosed with a broken hamate bone in his wrist, will miss 2-3 months.",
    "T51: RP P38611 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 1 day.",
    "T49: RF P61748 was injured while playing football. The Diagnosis: Hand soreness. This is a day-to-day injury expected to last 3 days.",
    "T44: 1B P50059 was injured being hit by a pitch. The Diagnosis: Bruised thumb. This is a day-to-day injury expected to last 6 days.",
    "T47: CL P57073 was injured while pitching. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 4 days.",
    "T45: 3B P50298 was injured while running the bases. The Diagnosis: Hip flexor strain. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-04-22T00:00:00-07:00": [
    "T47: 1B P50252 was injured while running the bases. The Diagnosis: Hamstring tightness. This is a day-to-day injury expected to last 6 days.",
    "T31: SS P57379 was injured in a collision at a base. The diagnosis is not yet known.",
    "T54: RP P1811 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 1-2 weeks."
  ],
  "2025-04-23T00:00:00-07:00": [
    "T58: C P25189 was injured . The Diagnosis: Migraine. This is a day-to-day injury expected to last 2 days.",
    "T50: SP P24403 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 4 days.",
    "T35: CF P53147 was injured on a defensive play. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-04-24T00:00:00-07:00": [
    "T52: P30874 has suffered a setback in his recovery. He is not expected to recover for another 4-5 weeks.",
    "T47: 1B P50252 was injured while running the bases. The Diagnosis: Hamstring tendinitis. He's expected to miss about 2 weeks.",
    "T55: SP P49917 was injured while pitching. The Diagnosis: Neck stiffness. This is a day-to-day injury expected to last 4 days.",
    "T44: SP P54892 was injured while pitching. The diagnosis is not yet known.",
    "T60: CL P30307 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 5 days.",
    "T31: SP P29751 was injured while pitching. The diagnosis is not yet known.",
    "T38: SP P33166 was injured while pitching. The diagnosis is not yet known.",
    "T48: SP P53711 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-04-25T00:00:00-07:00": [
    "T38: SP P33166 diagnosed with a forearm strain, will miss 7 weeks.",
    "T44: SP P54892 diagnosed with a forearm cramp, is day-to-day for 3 days.",
    "T57: SP P16 was injured while pitching. The Diagnosis: Elbow inflammation. He's expected to miss about 2 weeks.",
    "T57: RP P23534 was injured while pitching. The Diagnosis: Forearm tendinitis. He's expected to miss about one week.",
    "T37: CF P33873 was injured while running the bases. The Diagnosis: Bruised foot. This is a day-to-day injury expected to last 4 days.",
    "T60: RF P33603 was injured in a collision at a base. The Diagnosis: Bruised elbow. This is a day-to-day injury expected to last 2 weeks."
  ],
  "2025-04-26T00:00:00-07:00": [
    "T31: SP P29751 diagnosed with shoulder inflammation, will miss 4 months.",
    "T48: SP P53711 diagnosed with a mild shoulder strain, is day-to-day for 2 days.",
    "T56: 1B P56436 was injured . The Diagnosis: Nausea. This is a day-to-day injury expected to last 3 days.",
    "T31: SS P57379 diagnosed with a broken kneecap, will miss 4 months.",
    "T59: SP P34312 was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last one week.",
    "T59: RP P23634 was injured while pitching. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 2 weeks.",
    "T59: RF P37158 was injured while throwing the ball. The Diagnosis: Dead arm. He's expected to miss about 6 days.",
    "T48: SP P18682 was injured while pitching. The diagnosis is not yet known.",
    "T36: RF P29769 was injured in a collision at a base. The diagnosis is not yet known.",
    "T37: CF P33873 was injured being hit by a pitch. The diagnosis is not yet known."
  ],
  "2025-04-27T00:00:00-07:00": [
    "T47: CF P28483 was injured . The Diagnosis: Dizziness and nausea. This is a day-to-day injury expected to last 2 days.",
    "T36: RF P29769 diagnosed with a herniated disc, will miss 5 days.",
    "T51: P34915 has suffered a setback in his recovery. He is not expected to recover for another 3 weeks.",
    "T58: SP P26578 was injured while pitching. The Diagnosis: Biceps strain. This is a day-to-day injury expected to last 2 weeks.",
    "T51: CF P40742 was injured while throwing the ball. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last one week.",
    "T55: RP P24127 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 2 weeks.",
    "T59: SS P18196 was injured in a collision at a base. The Diagnosis: Sprained thumb. This is a day-to-day injury expected to last 6 days.",
    "T44: SP P43033 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-04-28T00:00:00-07:00": [
    "T37: CF P33873 diagnosed with a fractured jaw, will miss 4 weeks.",
    "T36: SP P58024 was injured . The Diagnosis: Heat exhaustion. This is a day-to-day injury expected to last 2 days."
  ]
}
