{
  "2025-03-17T00:00:00-07:00": [
    "Boston Red Sox: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25187.html\">L.T. Tolbert</a> diagnosed with a pulled abdominal muscle, is day-to-day for 3 days.",
    "Oakland Athletics: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23933.html\">Greg Burnett</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Minnesota Twins: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_49108.html\">Dany Rojas</a> was injured while running the bases. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 5 days.",
    "Minnesota Twins: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55283.html\">António Gómez</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Milwaukee Brewers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35495.html\">Dylan Bundy</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-18T00:00:00-07:00": [
    "Oakland Athletics: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23933.html\">Greg Burnett</a> diagnosed with a strained hamstring, is day-to-day for 2-3 weeks.",
    "Boston Red Sox: <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30166.html\">Trevor Boone</a> has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "Pittsburgh Pirates: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33100.html\">Jon Singleton</a> was injured . The Diagnosis: Viral infection. This is a day-to-day injury expected to last 4 days.",
    "Minnesota Twins: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55283.html\">António Gómez</a> diagnosed with a sore wrist, is day-to-day for 3 days.",
    "Boston Red Sox: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55046.html\">Robby Graham</a> was injured while pitching. The Diagnosis: Tender shoulder. This is a day-to-day injury expected to last one week.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23534.html\">Al Stoner</a> was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days.",
    "Los Angeles Angels: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_43033.html\">José Morín</a> was injured while pitching. The Diagnosis: Sore thumb. This is a day-to-day injury expected to last 3 days.",
    "Los Angeles Dodgers: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1473.html\">Jeren Kendall</a> was injured on a defensive play. The Diagnosis: Strained hamstring. This is a day-to-day injury expected to last 3 weeks.",
    "Arizona Diamondbacks: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52975.html\">Jeff Rowe</a> was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 5-6 weeks."
  ],
  "2025-03-19T00:00:00-07:00": [
    "New York Yankees: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_32146.html\">Lúcio Martínez</a> was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 1 day.",
    "Milwaukee Brewers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35495.html\">Dylan Bundy</a> diagnosed with a stiff neck, is day-to-day for 4 days.",
    "Atlanta Braves: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26879.html\">Giancarlo Stanton</a> was injured while running the bases. The Diagnosis: Mild hip strain. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-03-20T00:00:00-07:00": [
    "Kansas City Royals: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36482.html\">Mookie Betts</a> was injured while running the bases. The Diagnosis: Strained groin. This is a day-to-day injury expected to last 2 weeks.",
    "Texas Rangers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55379.html\">Jorge Martínez</a> was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days.",
    "Los Angeles Angels: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29862.html\">Brayden Stringer</a> was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 2 days.",
    "Los Angeles Dodgers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26087.html\">Jarrod Parker</a> was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 4 days.",
    "Miami Marlins: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_51506.html\">Daniel Kihle</a> was injured in a collision at a base. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last 1-2 weeks.",
    "Washington Nationals: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55310.html\">Phil Bovey</a> was injured while running the bases. The Diagnosis: Thumb contusion. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-03-21T00:00:00-07:00": [
    "Cincinnati Reds: <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53075.html\">Sam Hall</a> has suffered a setback in his recovery. He is not expected to recover for another 2 weeks.",
    "Texas Rangers: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_59972.html\">José Icaza</a> was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 2 days.",
    "Kansas City Royals: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25793.html\">Al Pesto</a> was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last one week.",
    "New York Yankees: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22420.html\">Gerrit Cole</a> was injured while pitching. The diagnosis is not yet known.",
    "Chicago White Sox: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23180.html\">Tim King</a> was injured being hit by a pitch. The Diagnosis: Bruised elbow. This is a day-to-day injury expected to last 2 days.",
    "Los Angeles Dodgers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_24031.html\">Clint Parker</a> was injured while pitching. The diagnosis is not yet known.",
    "Chicago Cubs: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27268.html\">David Carrasco</a> was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-03-22T00:00:00-07:00": [
    "New York Yankees: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22420.html\">Gerrit Cole</a> diagnosed with a sore back, but will not miss any additional time.",
    "Chicago Cubs: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_27268.html\">David Carrasco</a> diagnosed with a mild groin strain, is day-to-day for 3 days.",
    "Minnesota Twins: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35889.html\">Andrew McKirahan</a> was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 2 weeks.",
    "Kansas City Royals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25817.html\">Cole Baker</a> was injured while pitching. The Diagnosis: Strained shoulder. He's expected to miss about 5 weeks.",
    "Los Angeles Angels: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35161.html\">Drew Vettleson</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Baltimore Orioles: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55381.html\">Gene Bell</a> was injured being hit by a pitch. The Diagnosis: Bruised thumb. This is a day-to-day injury expected to last one week.",
    "San Diego Padres: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36515.html\">Mike Clevinger</a> was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 5 days.",
    "Miami Marlins: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_50900.html\">Brady Scott</a> was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 2 days.",
    "Milwaukee Brewers: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22823.html\">Raúl Brioso</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Los Angeles Dodgers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26087.html\">Jarrod Parker</a> was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-03-23T00:00:00-07:00": [
    "Milwaukee Brewers: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22823.html\">Raúl Brioso</a> diagnosed with a mild calf strain, is day-to-day for 3 days.",
    "Los Angeles Dodgers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_24031.html\">Clint Parker</a> diagnosed with shoulder inflammation, will miss 4 months.",
    "Kansas City Royals: <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_58305.html\">Kenzo Yoshida</a> has suffered a setback in his recovery. He is not expected to recover for another 2-3 weeks.",
    "Chicago White Sox: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53662.html\">Waylon Gustafson</a> was injured while pitching. The Diagnosis: Rotator cuff strain. He's expected to miss about 6 weeks.",
    "Texas Rangers: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52260.html\">James Nelson</a> was injured while running the bases. The Diagnosis: Hyperextended ankle. This is a day-to-day injury expected to last 5 days.",
    "Arizona Diamondbacks: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_57379.html\">Edwin Gordon</a> was injured while running the bases. The Diagnosis: Mild hip strain. This is a day-to-day injury expected to last 1-2 weeks.",
    "Washington Nationals: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_206.html\">Casey Gillaspie</a> was injured while running the bases. The Diagnosis: Quadriceps strain. This is a day-to-day injury expected to last 4 weeks.",
    "Cincinnati Reds: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55026.html\">Jerry Davis</a> was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last 2 weeks."
  ],
  "2025-03-24T00:00:00-07:00": [
    "Pittsburgh Pirates: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53182.html\">Cal Carlisle</a> was injured being hit by a pitch. The diagnosis is not yet known.",
    "Washington Nationals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30254.html\">Zach Zientarski</a> was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week.",
    "Chicago Cubs: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_47043.html\">Esteban Ruíz</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-25T00:00:00-07:00": [
    "Los Angeles Angels: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35161.html\">Drew Vettleson</a> diagnosed with forearm stiffness, will miss 2 days.",
    "Pittsburgh Pirates: C <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_58078.html\">Bernardo Gonzáles</a> was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 1 day.",
    "Boston Red Sox: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_49595.html\">Juan De Leon</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Baltimore Orioles: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53722.html\">Jeremy Middleton</a> was injured while pitching. The diagnosis is not yet known.",
    "Baltimore Orioles: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52447.html\">Kendall Simmons</a> was injured while running the bases. The diagnosis is not yet known.",
    "Baltimore Orioles: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52589.html\">José Silva</a> was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 5 days.",
    "Philadelphia Phillies: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33604.html\">Jameson Taillon</a> was injured while pitching. The diagnosis is not yet known.",
    "New York Mets: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_24589.html\">Norm Nelson</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-26T00:00:00-07:00": [
    "Los Angeles Dodgers: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1473.html\">Jeren Kendall</a> was injured . The Diagnosis: Strained hamstring. This is a day-to-day injury expected to last 2 days.",
    "New York Mets: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_24589.html\">Norm Nelson</a> diagnosed with a stiff back, but will not miss any additional time.",
    "Kansas City Royals: <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25793.html\">Al Pesto</a> has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "Chicago Cubs: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_47043.html\">Esteban Ruíz</a> diagnosed with a mild calf strain, is day-to-day for 3 days.",
    "Baltimore Orioles: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52447.html\">Kendall Simmons</a> diagnosed with a bruised heel, is day-to-day for 2 days.",
    "Pittsburgh Pirates: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53182.html\">Cal Carlisle</a> diagnosed with a fractured foot, will miss 3-4 weeks.",
    "Tampa Bay Rays: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_28266.html\">Pancho Sánchez</a> was injured while throwing the ball. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 5 days.",
    "Arizona Diamondbacks: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29998.html\">Tyler Powell</a> was injured while pitching. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last 1-2 weeks.",
    "Philadelphia Phillies: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1392.html\">Michael Chavis</a> was injured in a collision at a base. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 1 day.",
    "San Francisco Giants: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_59234.html\">Jeff Williams</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Atlanta Braves: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26993.html\">Juan Hidalgo</a> was injured while pitching. The diagnosis is not yet known.",
    "Los Angeles Dodgers: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30047.html\">Austin Shenton</a> was injured on a defensive play. The diagnosis is not yet known.",
    "Atlanta Braves: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36835.html\">José Delgado</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-27T00:00:00-07:00": [
    "Arizona Diamondbacks: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22620.html\">Christin Stewart</a> was injured . The Diagnosis: Migraine. This is a day-to-day injury expected to last 1 day.",
    "Atlanta Braves: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26993.html\">Juan Hidalgo</a> diagnosed with a sore forearm, is day-to-day for 5 days.",
    "Los Angeles Dodgers: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30047.html\">Austin Shenton</a> diagnosed with a partially torn labrum, will miss 2-3 months.",
    "Philadelphia Phillies: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33604.html\">Jameson Taillon</a> diagnosed with a torn ulnar collateral ligament, will miss 14 months.",
    "Atlanta Braves: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36835.html\">José Delgado</a> diagnosed with a sore back, is day-to-day for 1 day.",
    "Boston Red Sox: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_49595.html\">Juan De Leon</a> diagnosed with a sprained ankle, is day-to-day for 2 days.",
    "Baltimore Orioles: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53722.html\">Jeremy Middleton</a> diagnosed with rotator cuff inflammation, will miss 2-3 months.",
    "Oakland Athletics: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36333.html\">Zach Cone</a> was injured while running the bases. The Diagnosis: Strained groin. He's expected to miss about 5 weeks.",
    "Detroit Tigers: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29941.html\">Nicholas Tellache</a> was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-03-28T00:00:00-07:00": [
    "San Francisco Giants: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_59234.html\">Jeff Williams</a> diagnosed with hamstring soreness, is day-to-day for 5 days."
  ],
  "2025-03-29T00:00:00-07:00": [
    "Boston Red Sox: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33785.html\">Cam Bedrosian</a> was injured while pitching. The diagnosis is not yet known.",
    "Baltimore Orioles: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22048.html\">Connor Seabold</a> was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 6 days.",
    "Arizona Diamondbacks: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_20213.html\">Dalton Ewing</a> was injured while throwing the ball. The Diagnosis: Neck stiffness. This is a day-to-day injury expected to last 3 days.",
    "Chicago Cubs: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55417.html\">Jim Meyer</a> was injured while pitching. The Diagnosis: Hand soreness. This is a day-to-day injury expected to last 3 days.",
    "Chicago Cubs: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33134.html\">Leonardo Chapa</a> was injured while throwing the ball. The diagnosis is not yet known."
  ],
  "2025-03-30T00:00:00-07:00": [
    "Chicago Cubs: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33134.html\">Leonardo Chapa</a> diagnosed with a tired arm, will miss 2-3 weeks.",
    "Toronto Blue Jays: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_58323.html\">Tomás Perales</a> was injured . The Diagnosis: Stomach virus. This is a day-to-day injury expected to last 2 days.",
    "Boston Red Sox: 3B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_38573.html\">Kris Bryant</a> was injured in a collision at a base. The Diagnosis: Herniated disc (back). He's expected to miss about 4 weeks.",
    "Los Angeles Angels: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_62072.html\">Sumitomo Ogasahara</a> was injured while pitching. The diagnosis is not yet known.",
    "Colorado Rockies: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55203.html\">Greg Ross</a> was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 6 days.",
    "Chicago Cubs: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_39883.html\">Ricardo Sanchez</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-31T00:00:00-07:00": [
    "Boston Red Sox: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33785.html\">Cam Bedrosian</a> diagnosed with a torn back muscle, will miss 4-5 months.",
    "Oakland Athletics: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_31862.html\">Jesús Rivera</a> was injured while running the bases. The Diagnosis: Bruised shoulder. This is a day-to-day injury expected to last 6 days.",
    "Houston Astros: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_55108.html\">Elvis Mata</a> was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 5 days.",
    "Seattle Mariners: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_37079.html\">Corey Seager</a> was injured in a collision at a base. The Diagnosis: Torn thumb ligament. He's expected to miss about 2 weeks.",
    "Los Angeles Angels: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53349.html\">Phil McClellan</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "New York Mets: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52269.html\">Jake Lochner</a> was injured while pitching. The diagnosis is not yet known.",
    "San Francisco Giants: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22464.html\">Kyle Funkhouser</a> was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-04-01T00:00:00-07:00": [
    "Chicago Cubs: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_39883.html\">Ricardo Sanchez</a> diagnosed with a torn rotator cuff, will miss 5 months.",
    "Los Angeles Angels: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53349.html\">Phil McClellan</a> diagnosed with a sore forearm, is day-to-day for 5 days.",
    "Los Angeles Angels: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_43033.html\">José Morín</a> was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 1 day.",
    "Washington Nationals: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_33603.html\">Bryce Harper</a> was injured while running the bases. The Diagnosis: Hamstring tightness. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-04-02T00:00:00-07:00": [
    "Pittsburgh Pirates: 2B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_36987.html\">Dilson Herrera</a> was injured . The Diagnosis: Sinus infection. This is a day-to-day injury expected to last 1 day.",
    "New York Mets: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_52269.html\">Jake Lochner</a> diagnosed with shoulder tendinitis, is day-to-day for 5 days.",
    "Los Angeles Angels: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_62072.html\">Sumitomo Ogasahara</a> diagnosed with a torn flexor tendon in his elbow, will miss 11 months.",
    "Cleveland Indians: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25147.html\">Joe DeMers</a> was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 3 days.",
    "Houston Astros: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25116.html\">Riley Thompson</a> was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 5 days.",
    "Texas Rangers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25907.html\">Pedro Baez</a> was injured while pitching. The diagnosis is not yet known.",
    "St. Louis Cardinals: SS <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_30248.html\">Drew Mendoza</a> was injured being hit by a pitch. The Diagnosis: Bruised calf. This is a day-to-day injury expected to last 4 days.",
    "Baltimore Orioles: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25610.html\">Will Neely</a> was injured while pitching. The diagnosis is not yet known.",
    "New York Mets: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23761.html\">Phil Johnson</a> was injured while pitching. The diagnosis is not yet known.",
    "Atlanta Braves: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53121.html\">Ted Britt</a> was injured in a collision at a base. The diagnosis is not yet known."
  ],
  "2025-04-03T00:00:00-07:00": [
    "Baltimore Orioles: CL <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25610.html\">Will Neely</a> diagnosed with a tired arm, is day-to-day for 5 days.",
    "Los Angeles Angels: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29736.html\">Blake Rutherford</a> was injured while throwing the ball. The diagnosis is not yet known.",
    "Texas Rangers: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_54839.html\">Eric Jones</a> was injured while running the bases. The diagnosis is not yet known.",
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1958.html\">Javier Medina</a> was injured while pitching. The diagnosis is not yet known.",
    "Kansas City Royals: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26951.html\">Madison Bumgarner</a> was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 2 weeks.",
    "New York Mets: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_35120.html\">Matt Harvey</a> was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last one week.",
    "Atlanta Braves: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_22760.html\">Colin Poche</a> was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 2 weeks.",
    "Atlanta Braves: CF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_49103.html\">Victor Robles</a> was injured while running the bases. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last one week.",
    "Los Angeles Dodgers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26672.html\">Keegan James</a> was injured while pitching. The diagnosis is not yet known.",
    "Los Angeles Dodgers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26087.html\">Jarrod Parker</a> was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-04-04T00:00:00-07:00": [
    "New York Mets: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_23761.html\">Phil Johnson</a> diagnosed with a strained hamstring, will miss 2 months.",
    "Texas Rangers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_25907.html\">Pedro Baez</a> diagnosed with a tender shoulder, is day-to-day for 5 days.",
    "Los Angeles Angels: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_29736.html\">Blake Rutherford</a> diagnosed with a forearm strain, is day-to-day for 3 weeks.",
    "Atlanta Braves: LF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_53121.html\">Ted Britt</a> diagnosed with a torn ligament in his thumb, will miss 2 months.",
    "Texas Rangers: RF <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_54839.html\">Eric Jones</a> diagnosed with back spasms, but will not miss any additional time.",
    "San Diego Padres: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_59695.html\">Héctor Medellín</a> was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-04-05T00:00:00-07:00": [
    "Los Angeles Dodgers: <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1473.html\">Jeren Kendall</a> has suffered a setback in his recovery. He is not expected to recover for another 5 days."
  ],
  "2025-04-06T00:00:00-07:00": [
    "Los Angeles Dodgers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26087.html\">Jarrod Parker</a> diagnosed with shoulder inflammation, will miss 5 months.",
    "Pittsburgh Pirates: 1B <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_60122.html\">César Hernández</a> was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-04-07T00:00:00-07:00": [
    "Tampa Bay Rays: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_1958.html\">Javier Medina</a> diagnosed with forearm inflammation, will miss 4 weeks.",
    "Los Angeles Dodgers: RP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_26672.html\">Keegan James</a> diagnosed with radial nerve compression, will miss 4-5 months.",
    "Minnesota Twins: SP <a href=\"https://statsplus.net/oblootp/reports/news/html/players/player_58334.html\">Bernardo Acosta</a> was injured . The Diagnosis: Migraine. This is a day-to-day injury expected to last 2 days."
  ]
}
