{
  "2025-08-11T00:00:00-07:00": [
    "T41: SP P22503 diagnosed with back tightness, is day-to-day for 1 day.",
    "T36: RP P24227 diagnosed with a hamstring strain, will miss 5 weeks.",
    "T51: CF P40742 diagnosed with a sore elbow, is day-to-day for 2 weeks.",
    "T33: CL P42908 diagnosed with a sprained ankle, will miss 3 weeks."
  ],
  "2025-08-12T00:00:00-07:00": [
    "T53: RF P24196 diagnosed with an intercostal strain, will miss one week.",
    "T37: 2B P33873 was injured while throwing the ball. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-08-13T00:00:00-07:00": [
    "T40: C P27474 was injured while getting beaned during batting practice. The Diagnosis: Bruised thumb. This is a day-to-day injury expected to last 6 days.",
    "T56: 2B P37637 was injured . The Diagnosis: Asthma. This is a day-to-day injury expected to last 4 days.",
    "T40: SP P35495 was injured while throwing the ball. The diagnosis is not yet known.",
    "T31: RP P53269 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days.",
    "T58: SP P37050 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 6 days.",
    "T46: SS P23809 was injured while running the bases. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-08-14T00:00:00-07:00": [
    "T48: SP P18682 diagnosed with a ruptured finger tendon, will miss 4 months.",
    "T38: P20111 has suffered a setback in his recovery. He is not expected to recover for another 4 months.",
    "T40: SP P35495 diagnosed with a sore elbow, is day-to-day for 5 days.",
    "T55: SP P62140 was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 1 day.",
    "T32: 1B P19 was injured while running the bases. The Diagnosis: Foot soreness. This is a day-to-day injury expected to last one week.",
    "T33: RP P54493 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 3 days.",
    "T41: SP P22635 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last one week.",
    "T39: RP P22457 was injured while pitching. The diagnosis is not yet known.",
    "T34: RP P28592 was injured while pitching. The Diagnosis: Forearm soreness. This is a day-to-day injury expected to last 6 days."
  ],
  "2025-08-15T00:00:00-07:00": [
    "T39: RP P22457 diagnosed with back tightness, is day-to-day for one week.",
    "T43: RP P58305 was injured while pitching. The diagnosis is not yet known.",
    "T36: RP P24340 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 2 days.",
    "T54: LF P22818 was injured while running the bases. The Diagnosis: Sore back. This is a day-to-day injury expected to last 4 days.",
    "T46: RP P38681 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 1 day.",
    "T41: SP P36073 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-08-16T00:00:00-07:00": [
    "T53: 3B P30248 was injured while running the bases. The Diagnosis: Mild groin strain. This is a day-to-day injury expected to last 3 days.",
    "T58: SS P55249 was injured while running the bases. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 3 days.",
    "T51: 3B P1392 was injured while throwing the ball. The diagnosis is not yet known.",
    "T55: 2B P35263 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-08-17T00:00:00-07:00": [
    "T51: 3B P1392 diagnosed with an oblique strain, will miss 5 weeks.",
    "T43: RP P58305 diagnosed with shoulder inflammation, will miss 5 months.",
    "T52: LF P22470 was injured while running the bases. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 4 days.",
    "T59: SP P54894 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 1-2 weeks.",
    "T59: RF P35938 was injured while throwing the ball. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-08-18T00:00:00-07:00": [
    "T55: 2B P35263 diagnosed with a strained hamstring, will miss 6 weeks."
  ]
}
