{
  "2025-06-09T00:00:00-07:00": [
    "T34: SP P28398 was injured while pitching. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last one week.",
    "T34: RP P1417 was injured while pitching. The diagnosis is not yet known.",
    "T57: CF P53732 was injured on a defensive play. The Diagnosis: Wrist tendinitis. This is a day-to-day injury expected to last 2 weeks.",
    "T55: RP P53832 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 6 days.",
    "T52: 1B P33100 was injured while running the bases. The Diagnosis: Hamstring strain. He's expected to miss about 5-6 weeks."
  ],
  "2025-06-10T00:00:00-07:00": [
    "T48: SS P33611 was injured in a collision at a base. The diagnosis is not yet known.",
    "T44: SP P43033 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 6 days.",
    "T52: SS P22552 was injured in a collision at a base. The diagnosis is not yet known.",
    "T36: RP P50291 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-06-11T00:00:00-07:00": [
    "T52: SS P22552 diagnosed with a sprained wrist, is day-to-day for 4 weeks.",
    "T34: RF P49595 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 1 day.",
    "T36: RP P50291 diagnosed with shoulder inflammation, will miss 6 weeks.",
    "T59: RP P34312 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 6 days.",
    "T50: SP P36508 was injured while pitching. The Diagnosis: Forearm soreness. This is a day-to-day injury expected to last 6 days.",
    "T48: RP P50829 was injured while pitching. The diagnosis is not yet known.",
    "T43: CL P52958 was injured while pitching. The Diagnosis: Hamstring strain. He's expected to miss about 5-6 weeks.",
    "T32: RF P26879 was injured while running the bases. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 1 day.",
    "T49: RP P59482 was injured while pitching. The Diagnosis: Biceps tendinitis. He's expected to miss about 1-2 weeks."
  ],
  "2025-06-12T00:00:00-07:00": [
    "T34: RP P1417 diagnosed with a torn ulnar collateral ligament, will miss 9-10 months.",
    "T52: SS P22552 was injured . The Diagnosis: Sprained wrist. This is a day-to-day injury expected to last 1 day.",
    "T48: SS P33611 diagnosed with an intercostal strain, will miss one week.",
    "T48: RP P50829 diagnosed with a mild abdominal strain, is day-to-day for 3 days.",
    "T40: SS P55609 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about one week.",
    "T45: RP P49738 was injured while pitching. The diagnosis is not yet known.",
    "T56: 2B P28860 was injured being hit by a pitch. The Diagnosis: Sprained elbow. This is a day-to-day injury expected to last 4 days.",
    "T55: SS P50670 was injured in a collision at a base. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-06-13T00:00:00-07:00": [
    "T49: P23601 has suffered a setback in his recovery. He is not expected to recover for another 3 weeks.",
    "T45: RP P49738 diagnosed with a sore elbow, is day-to-day for 5 days.",
    "T46: RF P34118 was injured while throwing the ball. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 5 days.",
    "T55: 2B P29929 was injured being hit by a pitch. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 4 days.",
    "T34: SP P55046 was injured while pitching. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last 1-2 weeks.",
    "T59: SP P53401 was injured while pitching. The Diagnosis: Forearm stiffness. He's expected to miss about 5 days.",
    "T60: SP P28926 was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-06-14T00:00:00-07:00": [
    "T40: SP P37027 was injured while pitching. The diagnosis is not yet known.",
    "T44: RF P35161 was injured while throwing the ball. The Diagnosis: Herniated disc (neck). He's expected to miss about 2 months.",
    "T52: RP P36064 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 1 day.",
    "T52: 3B P54508 was injured being hit by a pitch. The Diagnosis: Bruised shoulder. This is a day-to-day injury expected to last 3 days.",
    "T54: CF P24455 was injured being hit by a pitch. The Diagnosis: Concussion. He's expected to miss about 3-4 weeks.",
    "T50: 1B P25419 was injured while stealing a base. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 2 weeks.",
    "T34: RP P29714 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 3 days.",
    "T53: RP P55648 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 4 days.",
    "T45: RF P23989 was injured in a collision at a base. The diagnosis is not yet known."
  ],
  "2025-06-15T00:00:00-07:00": [
    "T45: RF P23989 diagnosed with a strained rib cage muscle, is day-to-day for 2 weeks.",
    "T43: RP P38933 was injured falling down the stairs at his house. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 4 days.",
    "T60: SP P62094 was injured . The Diagnosis: Stomach virus. This is a day-to-day injury expected to last 5 days.",
    "T48: SP P53711 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 1 day.",
    "T49: SP P1816 was injured while pitching. The diagnosis is not yet known.",
    "T49: RP P23761 was injured while pitching. The diagnosis is not yet known.",
    "T48: RP P30475 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 4 days.",
    "T38: RF P28678 was injured on a defensive play. The Diagnosis: Hamstring strain. He's expected to miss about 2-3 weeks.",
    "T44: SP P43033 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 2 weeks.",
    "T44: RP P38781 was injured while pitching. The diagnosis is not yet known.",
    "T50: RF P1478 was injured while running the bases. The Diagnosis: Hyperextended knee. This is a day-to-day injury expected to last one week."
  ],
  "2025-06-16T00:00:00-07:00": [
    "T44: RP P38781 diagnosed with a sore back, but will not miss any additional time."
  ]
}
