{
  "2025-07-21T00:00:00-07:00": [
    "T33: 2B P32425 diagnosed with knee inflammation, is day-to-day for 1-2 weeks.",
    "T40: LF P49648 diagnosed with an intercostal strain, will miss 6 days.",
    "T50: 1B P25419 was injured while running the bases. The diagnosis is not yet known.",
    "T36: 2B P25200 was injured while running the bases. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last one week.",
    "T58: CF P53426 was injured while running the bases. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 5 days.",
    "T42: CL P55108 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-07-22T00:00:00-07:00": [
    "T58: LF P25233 diagnosed with a fractured thumb, will miss 6 weeks.",
    "T47: SP P35903 diagnosed with forearm tendinitis, will miss 1-2 weeks.",
    "T41: C P53652 was injured . The Diagnosis: Allergic reaction. This injury keeps him out of action for 2 days.",
    "T56: RP P34371 was injured while pitching. The diagnosis is not yet known.",
    "T48: CF P60110 was injured while running the bases. The Diagnosis: Hip flexor strain. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-07-23T00:00:00-07:00": [
    "T35: SP P8 diagnosed with a ruptured ulnar collateral ligament, will miss 9 months.",
    "T50: 1B P25419 diagnosed with a strained quad, is day-to-day for 1-2 weeks.",
    "T56: RP P34371 diagnosed with a torn ulnar collateral ligament, will miss 13-14 months.",
    "T42: CL P55108 diagnosed with a sore back, is day-to-day for 5 days.",
    "T39: 1B P31079 was injured while running the bases. The Diagnosis: Strained back. This is a day-to-day injury expected to last 4 days.",
    "T42: RP P34703 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 3 days.",
    "T59: CF P52976 was injured while running the bases. The diagnosis is not yet known.",
    "T47: SS P55283 was injured in a collision at a base. The Diagnosis: Hyperextended elbow. This is a day-to-day injury expected to last 1-2 weeks.",
    "T58: C P23917 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T55: SS P53282 was injured while throwing the ball. The Diagnosis: Sprained elbow. This is a day-to-day injury expected to last one week."
  ],
  "2025-07-24T00:00:00-07:00": [
    "T60: RP P22192 diagnosed with a torn labrum, will miss 11 months.",
    "T59: CF P52976 diagnosed with a bruised thumb, is day-to-day for 2 days.",
    "T35: P53687 has suffered a setback in his recovery. He is not expected to recover for another 2 weeks.",
    "T46: C P26894 was injured while running the bases. The diagnosis is not yet known.",
    "T56: RP P25561 was injured while pitching. The diagnosis is not yet known.",
    "T36: SS P33134 was injured while running the bases. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last one week."
  ],
  "2025-07-25T00:00:00-07:00": [
    "T58: C P23917 diagnosed with a fractured wrist, will miss 4-5 weeks.",
    "T43: RP P53072 was injured while pitching. The diagnosis is not yet known.",
    "T57: SP P16 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 1 day.",
    "T60: CF P50651 was injured while running the bases. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last one week."
  ],
  "2025-07-26T00:00:00-07:00": [
    "T56: RP P25561 diagnosed with a strained oblique, will miss 8 weeks.",
    "T46: C P26894 diagnosed with a strained lat, will miss 5 days.",
    "T33: P30724 has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "T35: SS P60084 was injured . The Diagnosis: Viral infection. This is a day-to-day injury expected to last 2 days.",
    "T48: SP P53711 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 1 day.",
    "T59: CL P53622 was injured while pitching. The Diagnosis: Forearm soreness. This is a day-to-day injury expected to last 4 days.",
    "T53: RP P55648 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 2 days.",
    "T31: RP P29998 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last one week.",
    "T45: SP P24221 was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-07-27T00:00:00-07:00": [
    "T52: P37214 has suffered a setback in his recovery. He is not expected to recover for another 2 weeks.",
    "T43: RP P53072 diagnosed with a sore wrist, is day-to-day for 3 days.",
    "T41: CF P30804 was injured while throwing the ball. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 6 days.",
    "T53: SP P54511 was injured while pitching. The diagnosis is not yet known.",
    "T34: 3B P25187 was injured while throwing the ball. The diagnosis is not yet known.",
    "T51: SP P38844 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-07-28T00:00:00-07:00": [
    "T53: SP P54511 diagnosed with a sore ankle, is day-to-day for 2 days.",
    "T55: 2B P29929 was injured in a collision at a base. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last one week.",
    "T51: 2B P42045 was injured while running the bases. The diagnosis is not yet known.",
    "T49: RP P23027 was injured while pitching. The Diagnosis: Rotator cuff strain. He's expected to miss about 5 weeks.",
    "T42: RP P34703 was injured while pitching. The Diagnosis: Elbow inflammation. He's expected to miss about one week."
  ],
  "2025-07-29T00:00:00-07:00": [
    "T34: 3B P25187 diagnosed with a pulled abdominal muscle, is day-to-day for 4 days.",
    "T39: SP P62121 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "T48: SP P22420 was injured while pitching. The diagnosis is not yet known.",
    "T58: RF P24176 was injured while throwing the ball. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last one week."
  ],
  "2025-07-30T00:00:00-07:00": [
    "T36: 3B P59846 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 4 days.",
    "T49: CL P50250 was injured while pitching. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 4 days.",
    "T43: RP P38933 was injured while pitching. The Diagnosis: Tired arm. This is a day-to-day injury expected to last 1-2 weeks.",
    "T35: CF P29786 was injured while throwing the ball. The Diagnosis: Sore thumb. This is a day-to-day injury expected to last 1 day.",
    "T38: SP P23995 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-07-31T00:00:00-07:00": [
    "T48: SP P22420 diagnosed with bone chips in his elbow, will miss 6 months.",
    "T38: SP P23995 diagnosed with shoulder inflammation, will miss 5 months.",
    "T51: 2B P42045 diagnosed with back spasms, will miss 4 weeks.",
    "T42: P50258 has suffered a setback in his recovery. He is not expected to recover for another 9 months.",
    "T56: RF P34049 was injured while running the bases. The Diagnosis: Sore groin. This is a day-to-day injury expected to last 1 day.",
    "T45: 2B P28185 was injured being hit by a pitch. The Diagnosis: Bruised hand. This is a day-to-day injury expected to last 3 days.",
    "T36: SP P35153 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 2 days.",
    "T31: RP P1363 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 1 day.",
    "T59: CF P52976 was injured while running the bases. The Diagnosis: Strained anterior cruciate ligament. He's expected to miss about 6 weeks."
  ],
  "2025-08-01T00:00:00-07:00": [
    "T41: SP P40985 was injured while pitching. The diagnosis is not yet known.",
    "T46: LF P24576 was injured while running the bases. The diagnosis is not yet known.",
    "T51: RF P91 was injured while throwing the ball. The Diagnosis: Oblique strain. He's expected to miss about one week."
  ],
  "2025-08-02T00:00:00-07:00": [
    "T41: SP P40985 diagnosed with back tightness, but will not miss any additional time.",
    "T31: C P29836 was injured being hit by a pitch. The Diagnosis: Bruised thigh. This is a day-to-day injury expected to last 4 days.",
    "T57: RP P27027 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 1 day.",
    "T43: 3B P53432 was injured in a collision at a base. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 1-2 weeks.",
    "T36: RP P28811 was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 5 days."
  ],
  "2025-08-03T00:00:00-07:00": [
    "T46: LF P24576 diagnosed with calf cramps, but will not miss any additional time.",
    "T37: CF P33105 was injured . The Diagnosis: Gout. This injury keeps him out of action for 4 days.",
    "T56: SS P50319 was injured in a collision at a base. The diagnosis is not yet known.",
    "T46: SP P38690 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 2 days.",
    "T35: CF P53147 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T59: CF P2174 was injured while running the bases. The diagnosis is not yet known.",
    "T51: CL P37013 was injured while pitching. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-08-04T00:00:00-07:00": [
    "T32: 2B P283 was injured while getting in a fight with a neighbor. The Diagnosis: Broken hamate bone. This injury keeps him out of action for 8 weeks.",
    "T56: SS P50319 diagnosed with a torn ligament in his thumb, will miss 5 weeks.",
    "T56: SS P57934 was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 3 days."
  ]
}
