{
  "2025-03-17T00:00:00-07:00": [
    "T34: RF P25187 diagnosed with a pulled abdominal muscle, is day-to-day for 3 days.",
    "T50: 3B P23933 was injured while throwing the ball. The diagnosis is not yet known.",
    "T47: LF P49108 was injured while running the bases. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 5 days.",
    "T47: 2B P55283 was injured while throwing the ball. The diagnosis is not yet known.",
    "T46: SP P35495 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-18T00:00:00-07:00": [
    "T50: 3B P23933 diagnosed with a strained hamstring, is day-to-day for 2-3 weeks.",
    "T34: P30166 has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "T52: 1B P33100 was injured . The Diagnosis: Viral infection. This is a day-to-day injury expected to last 4 days.",
    "T47: 2B P55283 diagnosed with a sore wrist, is day-to-day for 3 days.",
    "T34: SP P55046 was injured while pitching. The Diagnosis: Tender shoulder. This is a day-to-day injury expected to last one week.",
    "T57: RP P23534 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days.",
    "T44: SP P43033 was injured while pitching. The Diagnosis: Sore thumb. This is a day-to-day injury expected to last 3 days.",
    "T45: CF P1473 was injured on a defensive play. The Diagnosis: Strained hamstring. This is a day-to-day injury expected to last 3 weeks.",
    "T31: CL P52975 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 5-6 weeks."
  ],
  "2025-03-19T00:00:00-07:00": [
    "T48: SP P32146 was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 1 day.",
    "T46: SP P35495 diagnosed with a stiff neck, is day-to-day for 4 days.",
    "T32: RF P26879 was injured while running the bases. The Diagnosis: Mild hip strain. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-03-20T00:00:00-07:00": [
    "T43: RF P36482 was injured while running the bases. The Diagnosis: Strained groin. This is a day-to-day injury expected to last 2 weeks.",
    "T58: SP P55379 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days.",
    "T44: SP P29862 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 2 days.",
    "T45: RP P26087 was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 4 days.",
    "T41: LF P51506 was injured in a collision at a base. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last 1-2 weeks.",
    "T60: 2B P55310 was injured while running the bases. The Diagnosis: Thumb contusion. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-03-21T00:00:00-07:00": [
    "T37: P53075 has suffered a setback in his recovery. He is not expected to recover for another 2 weeks.",
    "T58: SS P59972 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 2 days.",
    "T43: RP P25793 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last one week.",
    "T48: SP P22420 was injured while pitching. The diagnosis is not yet known.",
    "T35: RF P23180 was injured being hit by a pitch. The Diagnosis: Bruised elbow. This is a day-to-day injury expected to last 2 days.",
    "T45: SP P24031 was injured while pitching. The diagnosis is not yet known.",
    "T36: 1B P27268 was injured while running the bases. The diagnosis is not yet known."
  ],
  "2025-03-22T00:00:00-07:00": [
    "T48: SP P22420 diagnosed with a sore back, but will not miss any additional time.",
    "T36: 1B P27268 diagnosed with a mild groin strain, is day-to-day for 3 days.",
    "T47: RP P35889 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 2 weeks.",
    "T43: SP P25817 was injured while pitching. The Diagnosis: Strained shoulder. He's expected to miss about 5 weeks.",
    "T44: RF P35161 was injured while throwing the ball. The diagnosis is not yet known.",
    "T33: CF P55381 was injured being hit by a pitch. The Diagnosis: Bruised thumb. This is a day-to-day injury expected to last one week.",
    "T53: SP P36515 was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 5 days.",
    "T41: CL P50900 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 2 days.",
    "T46: SS P22823 was injured while throwing the ball. The diagnosis is not yet known.",
    "T45: RP P26087 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-03-23T00:00:00-07:00": [
    "T46: SS P22823 diagnosed with a mild calf strain, is day-to-day for 3 days.",
    "T45: SP P24031 diagnosed with shoulder inflammation, will miss 4 months.",
    "T43: P58305 has suffered a setback in his recovery. He is not expected to recover for another 2-3 weeks.",
    "T35: SP P53662 was injured while pitching. The Diagnosis: Rotator cuff strain. He's expected to miss about 6 weeks.",
    "T58: 2B P52260 was injured while running the bases. The Diagnosis: Hyperextended ankle. This is a day-to-day injury expected to last 5 days.",
    "T31: SS P57379 was injured while running the bases. The Diagnosis: Mild hip strain. This is a day-to-day injury expected to last 1-2 weeks.",
    "T60: 1B P206 was injured while running the bases. The Diagnosis: Quadriceps strain. This is a day-to-day injury expected to last 4 weeks.",
    "T37: SP P55026 was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last 2 weeks."
  ],
  "2025-03-24T00:00:00-07:00": [
    "T52: SS P53182 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T60: SP P30254 was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week.",
    "T36: SP P47043 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-25T00:00:00-07:00": [
    "T44: RF P35161 diagnosed with forearm stiffness, will miss 2 days.",
    "T52: C P58078 was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 1 day.",
    "T34: RF P49595 was injured while throwing the ball. The diagnosis is not yet known.",
    "T33: RP P53722 was injured while pitching. The diagnosis is not yet known.",
    "T33: SS P52447 was injured while running the bases. The diagnosis is not yet known.",
    "T33: CL P52589 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 5 days.",
    "T51: SP P33604 was injured while pitching. The diagnosis is not yet known.",
    "T49: RP P24589 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-26T00:00:00-07:00": [
    "T45: CF P1473 was injured . The Diagnosis: Strained hamstring. This is a day-to-day injury expected to last 2 days.",
    "T49: RP P24589 diagnosed with a stiff back, but will not miss any additional time.",
    "T43: P25793 has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "T36: SP P47043 diagnosed with a mild calf strain, is day-to-day for 3 days.",
    "T33: SS P52447 diagnosed with a bruised heel, is day-to-day for 2 days.",
    "T52: SS P53182 diagnosed with a fractured foot, will miss 3-4 weeks.",
    "T57: RF P28266 was injured while throwing the ball. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 5 days.",
    "T31: RP P29998 was injured while pitching. The Diagnosis: Mild shoulder inflammation. This is a day-to-day injury expected to last 1-2 weeks.",
    "T51: 3B P1392 was injured in a collision at a base. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 1 day.",
    "T55: LF P59234 was injured while throwing the ball. The diagnosis is not yet known.",
    "T32: RP P26993 was injured while pitching. The diagnosis is not yet known.",
    "T45: 3B P30047 was injured on a defensive play. The diagnosis is not yet known.",
    "T32: SP P36835 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-27T00:00:00-07:00": [
    "T31: LF P22620 was injured . The Diagnosis: Migraine. This is a day-to-day injury expected to last 1 day.",
    "T32: RP P26993 diagnosed with a sore forearm, is day-to-day for 5 days.",
    "T45: 3B P30047 diagnosed with a partially torn labrum, will miss 2-3 months.",
    "T51: SP P33604 diagnosed with a torn ulnar collateral ligament, will miss 14 months.",
    "T32: SP P36835 diagnosed with a sore back, is day-to-day for 1 day.",
    "T34: RF P49595 diagnosed with a sprained ankle, is day-to-day for 2 days.",
    "T33: RP P53722 diagnosed with rotator cuff inflammation, will miss 2-3 months.",
    "T50: RF P36333 was injured while running the bases. The Diagnosis: Strained groin. He's expected to miss about 5 weeks.",
    "T40: SP P29941 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-03-28T00:00:00-07:00": [
    "T55: LF P59234 diagnosed with hamstring soreness, is day-to-day for 5 days."
  ],
  "2025-03-29T00:00:00-07:00": [
    "T34: RP P33785 was injured while pitching. The diagnosis is not yet known.",
    "T33: SP P22048 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 6 days.",
    "T31: CF P20213 was injured while throwing the ball. The Diagnosis: Neck stiffness. This is a day-to-day injury expected to last 3 days.",
    "T36: SP P55417 was injured while pitching. The Diagnosis: Hand soreness. This is a day-to-day injury expected to last 3 days.",
    "T36: SS P33134 was injured while throwing the ball. The diagnosis is not yet known."
  ],
  "2025-03-30T00:00:00-07:00": [
    "T36: SS P33134 diagnosed with a tired arm, will miss 2-3 weeks.",
    "T59: 1B P58323 was injured . The Diagnosis: Stomach virus. This is a day-to-day injury expected to last 2 days.",
    "T34: 3B P38573 was injured in a collision at a base. The Diagnosis: Herniated disc (back). He's expected to miss about 4 weeks.",
    "T44: RP P62072 was injured while pitching. The diagnosis is not yet known.",
    "T39: RP P55203 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 6 days.",
    "T36: RP P39883 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-03-31T00:00:00-07:00": [
    "T34: RP P33785 diagnosed with a torn back muscle, will miss 4-5 months.",
    "T50: SS P31862 was injured while running the bases. The Diagnosis: Bruised shoulder. This is a day-to-day injury expected to last 6 days.",
    "T42: RP P55108 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 5 days.",
    "T54: 2B P37079 was injured in a collision at a base. The Diagnosis: Torn thumb ligament. He's expected to miss about 2 weeks.",
    "T44: SS P53349 was injured while throwing the ball. The diagnosis is not yet known.",
    "T49: SP P52269 was injured while pitching. The diagnosis is not yet known.",
    "T55: RP P22464 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-04-01T00:00:00-07:00": [
    "T36: RP P39883 diagnosed with a torn rotator cuff, will miss 5 months.",
    "T44: SS P53349 diagnosed with a sore forearm, is day-to-day for 5 days.",
    "T44: SP P43033 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 1 day.",
    "T60: RF P33603 was injured while running the bases. The Diagnosis: Hamstring tightness. This is a day-to-day injury expected to last 1 day."
  ],
  "2025-04-02T00:00:00-07:00": [
    "T52: 2B P36987 was injured . The Diagnosis: Sinus infection. This is a day-to-day injury expected to last 1 day.",
    "T49: SP P52269 diagnosed with shoulder tendinitis, is day-to-day for 5 days.",
    "T44: RP P62072 diagnosed with a torn flexor tendon in his elbow, will miss 11 months.",
    "T38: SP P25147 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 3 days.",
    "T42: RP P25116 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 5 days.",
    "T58: RP P25907 was injured while pitching. The diagnosis is not yet known.",
    "T56: SS P30248 was injured being hit by a pitch. The Diagnosis: Bruised calf. This is a day-to-day injury expected to last 4 days.",
    "T33: CL P25610 was injured while pitching. The diagnosis is not yet known.",
    "T49: RP P23761 was injured while pitching. The diagnosis is not yet known.",
    "T32: LF P53121 was injured in a collision at a base. The diagnosis is not yet known."
  ],
  "2025-04-03T00:00:00-07:00": [
    "T33: CL P25610 diagnosed with a tired arm, is day-to-day for 5 days.",
    "T44: LF P29736 was injured while throwing the ball. The diagnosis is not yet known.",
    "T58: RF P54839 was injured while running the bases. The diagnosis is not yet known.",
    "T57: RP P1958 was injured while pitching. The diagnosis is not yet known.",
    "T43: SP P26951 was injured while pitching. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last 2 weeks.",
    "T49: SP P35120 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last one week.",
    "T32: RP P22760 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 2 weeks.",
    "T32: CF P49103 was injured while running the bases. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last one week.",
    "T45: RP P26672 was injured while pitching. The diagnosis is not yet known.",
    "T45: RP P26087 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-04-04T00:00:00-07:00": [
    "T49: RP P23761 diagnosed with a strained hamstring, will miss 2 months.",
    "T58: RP P25907 diagnosed with a tender shoulder, is day-to-day for 5 days.",
    "T44: LF P29736 diagnosed with a forearm strain, is day-to-day for 3 weeks.",
    "T32: LF P53121 diagnosed with a torn ligament in his thumb, will miss 2 months.",
    "T58: RF P54839 diagnosed with back spasms, but will not miss any additional time.",
    "T53: SP P59695 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-04-05T00:00:00-07:00": [
    "T45: P1473 has suffered a setback in his recovery. He is not expected to recover for another 5 days."
  ],
  "2025-04-06T00:00:00-07:00": [
    "T45: RP P26087 diagnosed with shoulder inflammation, will miss 5 months.",
    "T52: 1B P60122 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-04-07T00:00:00-07:00": [
    "T57: RP P1958 diagnosed with forearm inflammation, will miss 4 weeks.",
    "T45: RP P26672 diagnosed with radial nerve compression, will miss 4-5 months.",
    "T47: SP P58334 was injured . The Diagnosis: Migraine. This is a day-to-day injury expected to last 2 days."
  ]
}
