{
  "2025-06-16T00:00:00-07:00": [
    "T44: RP P38781 diagnosed with a sore back, but will not miss any additional time.",
    "T46: SP P30024 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last one week.",
    "T38: CF P57647 was injured while throwing the ball. The Diagnosis: Sprained elbow. This is a day-to-day injury expected to last 2 weeks.",
    "T50: SP P36508 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 1-2 weeks.",
    "T59: 3B P34691 was injured in a collision at a base. The diagnosis is not yet known.",
    "T50: 2B P59290 was injured in a collision at a base. The diagnosis is not yet known.",
    "T44: SP P34825 was injured while pitching. The Diagnosis: Sprained elbow. This is a day-to-day injury expected to last 3-4 weeks."
  ],
  "2025-06-17T00:00:00-07:00": [
    "T49: RP P23761 diagnosed with a sore forearm, is day-to-day for 1 day.",
    "T40: P55609 has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "T50: 2B P59290 diagnosed with a sprained thumb, is day-to-day for 2 weeks.",
    "T34: SP P29686 was injured while pitching. The Diagnosis: Hamstring strain. He's expected to miss about 5 weeks.",
    "T44: CF P53206 was injured while running the bases. The diagnosis is not yet known.",
    "T56: RP P55342 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 2 days.",
    "T49: 2B P33564 was injured while throwing the ball. The Diagnosis: Tired arm. This is a day-to-day injury expected to last 1-2 weeks."
  ],
  "2025-06-18T00:00:00-07:00": [
    "T44: CF P53206 diagnosed with a bruised knee, is day-to-day for 5 days.",
    "T56: SP P54513 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 2 days.",
    "T33: RP P54493 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 1-2 weeks.",
    "T43: SP P22463 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last one week.",
    "T50: SP P29693 was injured while pitching. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last 2 weeks.",
    "T46: 2B P53461 was injured while running the bases. The Diagnosis: Intercostal strain. He's expected to miss about one week."
  ],
  "2025-06-19T00:00:00-07:00": [
    "T49: SP P1816 diagnosed with a hamstring strain, will miss 1-2 weeks.",
    "T40: SP P37027 diagnosed with a torn rotator cuff, will miss 5 months.",
    "T55: RP P48951 was injured while pitching. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 3 days.",
    "T41: RP P22776 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-06-20T00:00:00-07:00": [
    "T41: RP P22776 diagnosed with a stiff back, but will not miss any additional time.",
    "T59: 3B P34691 diagnosed with a torn ligament in his thumb, will miss 2 weeks.",
    "T58: DH P33470 was injured while running the bases. The diagnosis is not yet known.",
    "T55: RF P47317 was injured while throwing the ball. The Diagnosis: Sore thumb. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-06-21T00:00:00-07:00": [
    "T46: P30024 has suffered a setback in his recovery. He is not expected to recover for another 5 days.",
    "T58: DH P33470 diagnosed with a sore groin, is day-to-day for 1 day.",
    "T50: LF P55254 was injured while running the bases. The diagnosis is not yet known.",
    "T47: SS P33871 was injured while running the bases. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 1 day.",
    "T59: SP P37385 was injured while pitching. The Diagnosis: Sore back. This is a day-to-day injury expected to last 6 days.",
    "T58: LF P57 was injured while running the bases. The Diagnosis: Twisted ankle. This is a day-to-day injury expected to last 5 days.",
    "T51: RP P24409 was injured while pitching. The Diagnosis: Mild abdominal strain. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-06-22T00:00:00-07:00": [
    "T50: P27864 has suffered a setback in his recovery. He is not expected to recover for another 1-2 weeks.",
    "T59: LF P28933 was injured . The Diagnosis: Virus. This is a day-to-day injury expected to last 4 days.",
    "T53: LF P39880 was injured . The Diagnosis: Asthma. This is a day-to-day injury expected to last 4 days.",
    "T50: LF P55254 diagnosed with a strained groin muscle, will miss 5 weeks.",
    "T31: SP P52484 was injured while pitching. The Diagnosis: Strained forearm. This is a day-to-day injury expected to last one week.",
    "T59: CF P2174 was injured being hit by a pitch. The Diagnosis: Bruised forearm. This is a day-to-day injury expected to last 2 days.",
    "T51: SP P23344 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 3 days.",
    "T35: CF P53147 was injured being hit by a pitch. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 4 days.",
    "T42: SP P24039 was injured while pitching. The diagnosis is not yet known.",
    "T40: RP P2212 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-06-23T00:00:00-07:00": [
    "T42: SP P24039 diagnosed with shoulder inflammation, will miss 3 weeks."
  ]
}
