{
  "2025-08-04T00:00:00-07:00": [
    "T32: 2B P283 was injured while getting in a fight with a neighbor. The Diagnosis: Broken hamate bone. This injury keeps him out of action for 8 weeks.",
    "T56: SS P50319 diagnosed with a torn ligament in his thumb, will miss 5 weeks.",
    "T56: SS P57934 was injured . The Diagnosis: Food poisoning. This injury keeps him out of action for 3 days.",
    "T32: SP P54970 was injured while pitching. The diagnosis is not yet known.",
    "T46: 2B P53461 was injured while throwing the ball. The Diagnosis: Sore shoulder. This is a day-to-day injury expected to last one week.",
    "T36: SS P33134 was injured while throwing the ball. The Diagnosis: Elbow tendinitis. He's expected to miss about 5 weeks.",
    "T45: SP P40490 was injured while pitching. The diagnosis is not yet known.",
    "T37: 2B P33873 was injured in a collision at a base. The Diagnosis: Sprained wrist. This is a day-to-day injury expected to last 5 days.",
    "T57: 2B P30589 was injured while running the bases. The Diagnosis: Mild hip strain. This is a day-to-day injury expected to last 1-2 weeks.",
    "T35: 2B P36682 was injured while throwing the ball. The Diagnosis: Biceps strain. He's expected to miss about 5-6 weeks.",
    "T42: RP P25116 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 6 days.",
    "T40: SS P55609 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 5 days.",
    "T40: RF P23845 was injured while running the bases. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 5 days.",
    "T40: SS P25221 was injured being hit by a pitch. The Diagnosis: Bruised shin. This is a day-to-day injury expected to last 5 days."
  ],
  "2025-08-05T00:00:00-07:00": [
    "T45: SP P40490 diagnosed with a partially torn labrum, will miss 2-3 months.",
    "T51: SP P54955 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 4 days.",
    "T33: LF P25150 was injured being hit by a pitch. The Diagnosis: Bruised wrist. This is a day-to-day injury expected to last 6 days.",
    "T57: 2B P30589 was injured while running the bases. The diagnosis is not yet known.",
    "T33: C P31093 was injured while running the bases. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last one week."
  ],
  "2025-08-06T00:00:00-07:00": [
    "T57: 2B P30589 diagnosed with a bruised finger, but will not miss any additional time.",
    "T52: 1B P33100 was injured . The Diagnosis: Stomach virus. This is a day-to-day injury expected to last 4 days.",
    "T55: RP P57098 was injured . The Diagnosis: Heat exhaustion. This is a day-to-day injury expected to last 3 days.",
    "T41: SP P40985 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 4 days.",
    "T32: 2B P37609 was injured in a collision at a base. The Diagnosis: Bruised foot. This is a day-to-day injury expected to last 6 days.",
    "T39: SP P55026 was injured while pitching. The diagnosis is not yet known.",
    "T50: SS P56787 was injured while running the bases. The Diagnosis: Mild groin strain. This is a day-to-day injury expected to last 4 days.",
    "T38: SP P55495 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-08-07T00:00:00-07:00": [
    "T59: CF P2174 diagnosed with a torn quad, will miss 6 weeks.",
    "T35: CF P53147 diagnosed with a fractured finger, will miss 5 weeks.",
    "T52: SS P60330 was injured . The Diagnosis: Viral infection. This is a day-to-day injury expected to last 4 days.",
    "T47: 1B P63833 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 4 days.",
    "T52: SP P24167 was injured while pitching. The diagnosis is not yet known.",
    "T37: SS P33265 was injured while running the bases. The diagnosis is not yet known.",
    "T40: SP P35495 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 2 days.",
    "T36: RF P29769 was injured while running the bases. The Diagnosis: Hamstring tightness. This is a day-to-day injury expected to last 4 days.",
    "T36: 1B P39581 was injured being hit by a pitch. The Diagnosis: Fractured wrist. He's expected to miss about 5 weeks."
  ],
  "2025-08-08T00:00:00-07:00": [
    "T37: SS P33265 diagnosed with back spasms, but will not miss any additional time.",
    "T32: SP P54970 diagnosed with bone chips in his elbow, will miss 5 months.",
    "T38: SP P55495 diagnosed with a mild hamstring strain, is day-to-day for 4 days.",
    "T32: RF P26879 was injured while running the bases. The Diagnosis: Elbow contusion. This is a day-to-day injury expected to last 1-2 weeks.",
    "T53: SP P53756 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 6 days.",
    "T44: 2B P50827 was injured while running the bases. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 2 days.",
    "T56: 3B P48985 was injured while running the bases. The Diagnosis: Knee soreness. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-08-09T00:00:00-07:00": [
    "T39: SP P55026 diagnosed with a partially torn ulnar collateral ligament, will miss 7-8 months.",
    "T45: SP P33236 was injured while pitching. The Diagnosis: Dead arm. He's expected to miss about 3 days.",
    "T53: RF P24196 was injured while running the bases. The Diagnosis: Mild calf strain. This is a day-to-day injury expected to last 5 days.",
    "T51: CF P40742 was injured on a defensive play. The diagnosis is not yet known."
  ],
  "2025-08-10T00:00:00-07:00": [
    "T52: SP P24167 diagnosed with a dead arm, will miss 3 days.",
    "T49: RP P23761 was injured while pitching. The Diagnosis: Mild hamstring strain. This is a day-to-day injury expected to last 4 days.",
    "T55: SS P50670 was injured being hit by a pitch. The Diagnosis: Bruised ankle. This is a day-to-day injury expected to last 2 days.",
    "T53: RF P24196 was injured while running the bases. The diagnosis is not yet known.",
    "T33: CL P42908 was injured while pitching. The diagnosis is not yet known.",
    "T36: RP P24227 was injured while pitching. The diagnosis is not yet known.",
    "T41: SP P22503 was injured while pitching. The diagnosis is not yet known.",
    "T42: 3B P22458 was injured while running the bases. The Diagnosis: Oblique strain. He's expected to miss about 5 days.",
    "T60: SP P30254 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days."
  ],
  "2025-08-11T00:00:00-07:00": [
    "T41: SP P22503 diagnosed with back tightness, is day-to-day for 1 day.",
    "T36: RP P24227 diagnosed with a hamstring strain, will miss 5 weeks.",
    "T51: CF P40742 diagnosed with a sore elbow, is day-to-day for 2 weeks.",
    "T33: CL P42908 diagnosed with a sprained ankle, will miss 3 weeks."
  ]
}
