{
  "2025-09-08T00:00:00-07:00": [
    "T60: SP P28926 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 1 day.",
    "T50: 1B P25419 was injured being hit by a pitch. The diagnosis is not yet known.",
    "T40: RF P23845 was injured while running the bases. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 6 days.",
    "T43: RF P36482 was injured in a collision at a base. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 2 weeks.",
    "T31: RP P52484 was injured while pitching. The Diagnosis: Sprained ankle. This is a day-to-day injury expected to last 5 days.",
    "T60: SP P49654 was injured while pitching. The diagnosis is not yet known.",
    "T42: 1B P25154 was injured while running the bases. The Diagnosis: Sore thumb. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-09-09T00:00:00-07:00": [
    "T43: SP P26951 diagnosed with shoulder inflammation, will miss 2-3 months.",
    "T50: SP P34709 diagnosed with a mild hamstring strain, but will not miss any additional time.",
    "T60: SP P49654 diagnosed with a sore shoulder, will miss 4-5 weeks.",
    "T32: SP P52482 diagnosed with a fractured elbow, will miss 8 months.",
    "T60: SP P62014 was injured . The Diagnosis: Flu-like symptoms. This is a day-to-day injury expected to last 1 day.",
    "T37: SP P29832 was injured while pitching. The diagnosis is not yet known.",
    "T43: 3B P53432 was injured while running the bases. The diagnosis is not yet known.",
    "T55: CF P55687 was injured while running the bases. The Diagnosis: Hip flexor strain. This is a day-to-day injury expected to last 6 days.",
    "T53: C P22632 was injured being hit by a pitch. The Diagnosis: Fractured thumb. He's expected to miss about 4 weeks.",
    "T47: SP P2144 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last 6 days.",
    "T38: CF P57647 was injured being hit by a pitch. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 1-2 weeks.",
    "T60: RP P52538 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-09-10T00:00:00-07:00": [
    "T60: RP P52538 diagnosed with a strained triceps, is day-to-day for 4 weeks.",
    "T43: 3B P53432 diagnosed with a strained oblique, is day-to-day for 3-4 weeks.",
    "T51: SP P60210 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 1 day.",
    "T50: SP P36508 was injured while pitching. The Diagnosis: Back stiffness. This is a day-to-day injury expected to last 2 days.",
    "T34: RF P38573 was injured while running the bases. The diagnosis is not yet known.",
    "T35: CF P29786 was injured while throwing the ball. The Diagnosis: Dead arm. He's expected to miss about 4 days.",
    "T57: RF P53267 was injured while running the bases. The Diagnosis: Strained oblique. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-09-11T00:00:00-07:00": [
    "T37: SP P29832 diagnosed with a partially torn labrum, will miss 4 months.",
    "T37: RF P55052 was injured being hit by a pitch. The Diagnosis: Bone marrow edema (knee). He's expected to miss about 6 weeks.",
    "T44: SP P34825 was injured while pitching. The diagnosis is not yet known.",
    "T32: RF P26879 was injured while running the bases. The Diagnosis: Severe hip strain. He's expected to miss about 6-7 weeks."
  ],
  "2025-09-12T00:00:00-07:00": [
    "T36: RP P131 was injured . The Diagnosis: Dizziness and nausea. This is a day-to-day injury expected to last 4 days.",
    "T50: 1B P25419 diagnosed with a fractured finger, will miss 5 weeks.",
    "T34: RF P38573 diagnosed with a broken hand, will miss 3 months.",
    "T35: SP P26430 was injured while pitching. The diagnosis is not yet known.",
    "T47: SP P35903 was injured while pitching. The diagnosis is not yet known.",
    "T31: CF P55780 was injured on a defensive play. The Diagnosis: Sore elbow. This is a day-to-day injury expected to last 3-4 weeks.",
    "T52: LF P1604 was injured being hit by a pitch. The diagnosis is not yet known."
  ],
  "2025-09-13T00:00:00-07:00": [
    "T52: LF P1604 diagnosed with a hand contusion, will miss 5 days.",
    "T44: SP P34825 diagnosed with back spasms, is day-to-day for 2 days.",
    "T50: CL P47957 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 1 day.",
    "T54: RF P48467 was injured . The Diagnosis: Dehydration. This is a day-to-day injury expected to last 3 days.",
    "T60: SP P50887 was injured while pitching. The diagnosis is not yet known.",
    "T55: CF P56774 was injured on a defensive play. The diagnosis is not yet known.",
    "T51: LF P46441 was injured while running the bases. The Diagnosis: Back tightness. This is a day-to-day injury expected to last 4 days.",
    "T42: 2B P1150 was injured while running the bases. The Diagnosis: Strained back. This is a day-to-day injury expected to last 4 days.",
    "T35: SP P25144 was injured while pitching. The diagnosis is not yet known.",
    "T59: SP P37385 was injured while pitching. The Diagnosis: Hamstring soreness. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-09-14T00:00:00-07:00": [
    "T47: SP P35903 diagnosed with back spasms, but will not miss any additional time.",
    "T60: SP P50887 diagnosed with a strained biceps, is day-to-day for 4 weeks.",
    "T42: RF P62026 was injured . The Diagnosis: Flu. This is a day-to-day injury expected to last 2 days.",
    "T38: SP P26985 was injured while pitching. The diagnosis is not yet known.",
    "T40: RP P35495 was injured while pitching. The diagnosis is not yet known.",
    "T47: SP P2144 was injured while pitching. The Diagnosis: Neck stiffness. This is a day-to-day injury expected to last 1 day.",
    "T51: 1B P29037 was injured while running the bases. The Diagnosis: Mild oblique strain. This is a day-to-day injury expected to last 2 days."
  ],
  "2025-09-15T00:00:00-07:00": [
    "T35: SP P25144 diagnosed with an arthritic elbow, will miss 4 months.",
    "T33: P52589 has suffered a setback in his recovery. He is not expected to recover for another 1-2 weeks."
  ]
}
