{
  "2025-05-12T00:00:00-07:00": [
    "T54: RF P37113 diagnosed with a sore ankle, is day-to-day for 4 days.",
    "T51: SP P38786 was injured while pitching. The Diagnosis: Finger blister. This is a day-to-day injury expected to last 1 day.",
    "T50: SP P37307 was injured while pitching. The diagnosis is not yet known.",
    "T42: C P38711 was injured in a collision at a base. The Diagnosis: Sprained knee. This is a day-to-day injury expected to last 4 weeks.",
    "T53: RP P55648 was injured while pitching. The diagnosis is not yet known.",
    "T42: SP P29661 was injured while pitching. The Diagnosis: Forearm stiffness. He's expected to miss about one week.",
    "T42: SP P53263 was injured while pitching. The Diagnosis: Shoulder tendinitis. This is a day-to-day injury expected to last 4 weeks.",
    "T59: LF P28933 was injured while running the bases. The diagnosis is not yet known.",
    "T48: SP P37031 was injured while pitching. The Diagnosis: Strained forearm. This is a day-to-day injury expected to last one week."
  ],
  "2025-05-13T00:00:00-07:00": [
    "T49: SP P24984 diagnosed with radial nerve compression, will miss 4 months.",
    "T59: LF P28933 diagnosed with a strained oblique, is day-to-day for 1 day.",
    "T40: SP P34824 diagnosed with a pulled abdominal muscle, is day-to-day for 4 days.",
    "T50: SP P37307 diagnosed with a sore back, is day-to-day for 2 days.",
    "T53: RP P55648 diagnosed with hamstring soreness, but will not miss any additional time.",
    "T54: LF P22818 was injured in a collision at a base. The diagnosis is not yet known.",
    "T39: RP P22457 was injured while pitching. The Diagnosis: Mild shoulder strain. This is a day-to-day injury expected to last 3 days.",
    "T41: CF P25651 was injured while running the bases. The diagnosis is not yet known.",
    "T41: SP P22503 was injured while pitching. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week.",
    "T31: 2B P2476 was injured while running the bases. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last one week.",
    "T45: RP P53708 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-05-14T00:00:00-07:00": [
    "T46: SP P35495 was injured while pitching. The Diagnosis: Sore ankle. This is a day-to-day injury expected to last 1 day.",
    "T42: LF P34868 was injured while running the bases. The Diagnosis: Strained back. This is a day-to-day injury expected to last one week.",
    "T57: RP P23534 was injured while pitching. The Diagnosis: Fractured shoulder blade. He's expected to miss about 4 weeks.",
    "T54: SP P41703 was injured while pitching. The Diagnosis: Wrist soreness. This is a day-to-day injury expected to last one week.",
    "T44: CF P55236 was injured while throwing the ball. The Diagnosis: Dead arm. He's expected to miss about 5 days.",
    "T44: SP P43033 was injured while pitching. The Diagnosis: Oblique strain. He's expected to miss about 2 weeks."
  ],
  "2025-05-15T00:00:00-07:00": [
    "T54: LF P22818 diagnosed with a strained hamstring, will miss 4 weeks.",
    "T41: CF P25651 diagnosed with a stiff back, is day-to-day for 5 days.",
    "T49: C P22632 was injured being hit by a pitch. The Diagnosis: Knee contusion. This is a day-to-day injury expected to last 4 days.",
    "T55: SP P53617 was injured while pitching. The diagnosis is not yet known.",
    "T39: RP P22457 was injured while pitching. The Diagnosis: Forearm stiffness. He's expected to miss about 6 days."
  ],
  "2025-05-16T00:00:00-07:00": [
    "T45: RP P53708 diagnosed with a strained oblique, will miss 5-6 weeks."
  ],
  "2025-05-17T00:00:00-07:00": [
    "T51: C P23857 was injured . The Diagnosis: Stomach virus. This is a day-to-day injury expected to last 2 days.",
    "T40: SP P52898 was injured . The Diagnosis: Cold. This is a day-to-day injury expected to last 1 day.",
    "T55: SP P53617 diagnosed with elbow inflammation, will miss 3 months.",
    "T56: SP P27493 was injured while pitching. The diagnosis is not yet known.",
    "T54: SP P53369 was injured while pitching. The Diagnosis: Back spasms. This is a day-to-day injury expected to last 2 days.",
    "T59: RP P54894 was injured while pitching. The Diagnosis: Forearm tendinitis. He's expected to miss about 2 weeks.",
    "T40: LF P55546 was injured while running the bases. The diagnosis is not yet known.",
    "T40: RP P26432 was injured while pitching. The diagnosis is not yet known."
  ],
  "2025-05-18T00:00:00-07:00": [
    "T49: P53050 has suffered a setback in his recovery. He is not expected to recover for another 4 days.",
    "T56: SP P60315 was injured . The Diagnosis: Conjunctivitis. This is a day-to-day injury expected to last 5 days.",
    "T48: SP P37031 was injured while pitching. The diagnosis is not yet known.",
    "T42: CF P19950 was injured being hit by a pitch. The Diagnosis: Bruised knee. This is a day-to-day injury expected to last 4 days."
  ],
  "2025-05-19T00:00:00-07:00": [
    "T48: SP P37031 diagnosed with hamstring soreness, is day-to-day for 4 days.",
    "T40: LF P55546 diagnosed with a mild hamstring strain, is day-to-day for 1-2 weeks."
  ]
}
