{
  "2025-10-10T00:00:00-07:00": [
    "T42: 1B P53823 honored: Wins the 2025 TEX Most Valuable Player Award.",
    "T53: LF P33238 honored: Finished 2nd in 2025 TEX Most Valuable Player Award voting.",
    "T53: SS P1578 honored: Finished 3rd in 2025 TEX Most Valuable Player Award voting.",
    "T52: SP P54495 honored: Wins the 2025 SAL Outstanding Pitcher Award.",
    "T52: SP P54284 honored: Finished 2nd in 2025 SAL Outstanding Pitcher Award voting.",
    "T48: SP P55754 honored: Finished 3rd in 2025 SAL Outstanding Pitcher Award voting.",
    "T37: CF P56705 honored: Wins the 2025 MID Most Valuable Player Award.",
    "T53: 1B P27 honored: Finished 2nd in 2025 MID Most Valuable Player Award voting.",
    "T36: SS P26991 honored: Finished 3rd in 2025 MID Most Valuable Player Award voting.",
    "T54: P36650 sets the AL playoff extra-inning game record for bases on balls with 4."
  ],
  "2025-10-11T00:00:00-07:00": [
    "T60: CF P60608 honored: Wins the 2025 SAL Most Valuable Player Award.",
    "T52: RF P53387 honored: Finished 2nd in 2025 SAL Most Valuable Player Award voting.",
    "T58: C P23268 honored: Finished 3rd in 2025 SAL Most Valuable Player Award voting.",
    "T35: SP P56381 honored: Wins the 2025 PIO Outstanding Pitcher Award.",
    "T31: SP P57654 honored: Finished 2nd in 2025 PIO Outstanding Pitcher Award voting.",
    "T35: SP P55112 honored: Finished 3rd in 2025 PIO Outstanding Pitcher Award voting."
  ],
  "2025-10-12T00:00:00-07:00": [
    "T35: SP P56381 honored: Wins the 2025 PIO Most Valuable Player Award.",
    "T45: 1B P58653 honored: Finished 2nd in 2025 PIO Most Valuable Player Award voting.",
    "T44: C P57608 honored: Finished 3rd in 2025 PIO Most Valuable Player Award voting."
  ],
  "2025-10-13T00:00:00-07:00": [
    "T36: SP P55172 honored: Wins the 2025 PCL AC Outstanding Pitcher Award.",
    "T50: RP P57563 honored: Finished 2nd in 2025 PCL AC Outstanding Pitcher Award voting.",
    "T58: SP P39037 honored: Finished 3rd in 2025 PCL AC Outstanding Pitcher Award voting.",
    "T54: SP P23266 honored: Wins the 2025 PCL PC Outstanding Pitcher Award.",
    "T53: SP P47910 honored: Finished 2nd in 2025 PCL PC Outstanding Pitcher Award voting.",
    "T44: SP P27127 honored: Finished 3rd in 2025 PCL PC Outstanding Pitcher Award voting."
  ],
  "2025-10-14T00:00:00-07:00": [
    "T36: LF P57655 honored: Wins the 2025 PCL AC Most Valuable Player Award.",
    "T43: 3B P25203 honored: Finished 2nd in 2025 PCL AC Most Valuable Player Award voting.",
    "T50: 1B P22851 honored: Finished 3rd in 2025 PCL AC Most Valuable Player Award voting.",
    "T54: SS P29681 honored: Wins the 2025 PCL PC Most Valuable Player Award.",
    "T31: CF P55780 honored: Finished 2nd in 2025 PCL PC Most Valuable Player Award voting.",
    "T54: SP P23266 honored: Finished 3rd in 2025 PCL PC Most Valuable Player Award voting."
  ],
  "2025-10-15T00:00:00-07:00": [
    "SS P33265 of the T37 honored: Wins the 2025 MLB NL Division Series MVP Award."
  ],
  "2025-10-16T00:00:00-07:00": [
    "CF P53807 of the T40 honored: Wins the 2025 MLB AL Division Series MVP Award.",
    "1B P53142 of the T47 honored: Wins the 2025 MLB AL Division Series MVP Award."
  ],
  "2025-10-17T00:00:00-07:00": [
    "LF P1614 of the T39 honored: Wins the 2025 MLB NL Division Series MVP Award."
  ]
}
