{
  "2025-10-07T00:00:00-07:00": [
    "T51: RF P32331 honored: Wins the 2025 FSL Most Valuable Player Award.",
    "T47: LF P22770 honored: Finished 2nd in 2025 FSL Most Valuable Player Award voting.",
    "T48: SS P57199 honored: Finished 3rd in 2025 FSL Most Valuable Player Award voting.",
    "T53: SP P52576 honored: Wins the 2025 CAL Outstanding Pitcher Award.",
    "T53: SP P55761 honored: Finished 2nd in 2025 CAL Outstanding Pitcher Award voting.",
    "T39: RP P36523 honored: Finished 3rd in 2025 CAL Outstanding Pitcher Award voting.",
    "T33: SP P2013 honored: Wins the 2025 CAR Outstanding Pitcher Award.",
    "T36: RP P39754 honored: Finished 2nd in 2025 CAR Outstanding Pitcher Award voting.",
    "T33: RP P49762 honored: Finished 3rd in 2025 CAR Outstanding Pitcher Award voting.",
    "T57: SP P55010 honored: Wins the 2025 GCL Outstanding Pitcher Award.",
    "T48: SP P842 honored: Finished 2nd in 2025 GCL Outstanding Pitcher Award voting.",
    "T40: SP P58258 honored: Finished 3rd in 2025 GCL Outstanding Pitcher Award voting.",
    "T32: 1B P24168 honored: Wins the 2025 IL Most Valuable Player Award.",
    "T37: SP P54917 honored: Finished 2nd in 2025 IL Most Valuable Player Award voting.",
    "T32: LF P25194 honored: Finished 3rd in 2025 IL Most Valuable Player Award voting."
  ],
  "2025-10-08T00:00:00-07:00": [
    "T47: SP P57302 honored: Wins the 2025 SL Outstanding Pitcher Award.",
    "T35: CL P57458 honored: Finished 2nd in 2025 SL Outstanding Pitcher Award voting.",
    "T31: SP P57620 honored: Finished 3rd in 2025 SL Outstanding Pitcher Award voting.",
    "T53: C P23186 honored: Wins the 2025 CAL Most Valuable Player Award.",
    "T53: SS P24687 honored: Finished 2nd in 2025 CAL Most Valuable Player Award voting.",
    "T42: 1B P28236 honored: Finished 3rd in 2025 CAL Most Valuable Player Award voting.",
    "T60: SP P52038 honored: Wins the 2025 NYP Outstanding Pitcher Award.",
    "T52: SP P57579 honored: Finished 2nd in 2025 NYP Outstanding Pitcher Award voting.",
    "T34: SP P58895 honored: Finished 3rd in 2025 NYP Outstanding Pitcher Award voting.",
    "T36: LF P57214 honored: Wins the 2025 CAR Most Valuable Player Award.",
    "T36: CF P57103 honored: Finished 2nd in 2025 CAR Most Valuable Player Award voting.",
    "T33: 3B P55171 honored: Finished 3rd in 2025 CAR Most Valuable Player Award voting.",
    "T47: SS P59226 honored: Wins the 2025 GCL Most Valuable Player Award.",
    "T59: LF P60879 honored: Finished 2nd in 2025 GCL Most Valuable Player Award voting.",
    "T57: C P233 honored: Finished 3rd in 2025 GCL Most Valuable Player Award voting."
  ],
  "2025-10-09T00:00:00-07:00": [
    "T56: SP P56742 honored: Wins the 2025 TEX Outstanding Pitcher Award.",
    "T50: CL P59255 honored: Finished 2nd in 2025 TEX Outstanding Pitcher Award voting.",
    "T53: RP P34376 honored: Finished 3rd in 2025 TEX Outstanding Pitcher Award voting.",
    "T47: RF P203 honored: Wins the 2025 SL Most Valuable Player Award.",
    "T32: SS P54988 honored: Finished 2nd in 2025 SL Most Valuable Player Award voting.",
    "T32: CF P56794 honored: Finished 3rd in 2025 SL Most Valuable Player Award voting.",
    "T40: RP P22975 honored: Wins the 2025 MID Outstanding Pitcher Award.",
    "T47: RP P52896 honored: Finished 2nd in 2025 MID Outstanding Pitcher Award voting.",
    "T57: SP P60929 honored: Finished 3rd in 2025 MID Outstanding Pitcher Award voting.",
    "T34: LF P53354 honored: Wins the 2025 NYP Most Valuable Player Award.",
    "T60: SP P52038 honored: Finished 2nd in 2025 NYP Most Valuable Player Award voting.",
    "T42: SS P55725 honored: Finished 3rd in 2025 NYP Most Valuable Player Award voting."
  ],
  "2025-10-10T00:00:00-07:00": [
    "T42: 1B P53823 honored: Wins the 2025 TEX Most Valuable Player Award.",
    "T53: LF P33238 honored: Finished 2nd in 2025 TEX Most Valuable Player Award voting.",
    "T53: SS P1578 honored: Finished 3rd in 2025 TEX Most Valuable Player Award voting.",
    "T52: SP P54495 honored: Wins the 2025 SAL Outstanding Pitcher Award.",
    "T52: SP P54284 honored: Finished 2nd in 2025 SAL Outstanding Pitcher Award voting.",
    "T48: SP P55754 honored: Finished 3rd in 2025 SAL Outstanding Pitcher Award voting.",
    "T37: CF P56705 honored: Wins the 2025 MID Most Valuable Player Award.",
    "T53: 1B P27 honored: Finished 2nd in 2025 MID Most Valuable Player Award voting.",
    "T36: SS P26991 honored: Finished 3rd in 2025 MID Most Valuable Player Award voting."
  ]
}
