{
  "2025-09-29T00:00:00-07:00": [
    "1B P25185 of the T48 honored: Wins the MLB AL Player of the Week Award.",
    "1B P53704 of the T52 honored: Wins the MLB NL Player of the Week Award.",
    "T60: 3B P28445 honored: Wins the 2025 EL Most Valuable Player Award.",
    "T51: LF P57558 honored: Finished 2nd in 2025 EL Most Valuable Player Award voting.",
    "T60: LF P53344 honored: Finished 3rd in 2025 EL Most Valuable Player Award voting."
  ],
  "2025-10-01T00:00:00-07:00": [
    "1B P32314 of the T34 honored: Wins the MLB AL Batter of the Month Award.",
    "1B P45075 of the T46 honored: Wins the MLB NL Batter of the Month Award.",
    "CL P55108 of the T42 honored: Wins the MLB AL Pitcher of the Month Award.",
    "SP P33949 of the T37 honored: Wins the MLB NL Pitcher of the Month Award.",
    "RF P62067 of the T47 honored: Wins the MLB AL Rookie of the Month Award.",
    "C P57250 of the T60 honored: Wins the MLB NL Rookie of the Month Award.",
    "T36: SP P55392 honored: Wins the 2025 AZL AZL Outstanding Pitcher Award.",
    "T36: SP P59382 honored: Finished 2nd in 2025 AZL AZL Outstanding Pitcher Award voting.",
    "T43: SP P56345 honored: Finished 3rd in 2025 AZL AZL Outstanding Pitcher Award voting."
  ],
  "2025-10-02T00:00:00-07:00": [
    "T53: 3B P35931 honored: Wins the 2025 AZL AZL Most Valuable Player Award.",
    "T36: RF P57729 honored: Finished 2nd in 2025 AZL AZL Most Valuable Player Award voting.",
    "T37: C P61287 honored: Finished 3rd in 2025 AZL AZL Most Valuable Player Award voting.",
    "T44: P33563 launches his 400th career home run!"
  ],
  "2025-10-03T00:00:00-07:00": [
    "T51: P54518 pitches a 4-hit shutout against the T60 with 5 strikeouts and 0 BB allowed!"
  ],
  "2025-10-06T00:00:00-07:00": [
    "T47: SP P54977 honored: Wins the 2025 FSL Outstanding Pitcher Award.",
    "T59: SP P56896 honored: Finished 2nd in 2025 FSL Outstanding Pitcher Award voting.",
    "T48: SP P53686 honored: Finished 3rd in 2025 FSL Outstanding Pitcher Award voting.",
    "LF P39461 of the T57 honored: Wins the MLB AL Player of the Week Award.",
    "RF P34915 of the T51 honored: Wins the MLB NL Player of the Week Award.",
    "T37: SP P54917 honored: Wins the 2025 IL Outstanding Pitcher Award.",
    "T37: SP P54352 honored: Finished 2nd in 2025 IL Outstanding Pitcher Award voting.",
    "T37: SP P53421 honored: Finished 3rd in 2025 IL Outstanding Pitcher Award voting."
  ]
}
