{
  "2025-09-22T00:00:00-07:00": [
    "3B P1401 of the T48 honored: Wins the MLB AL Player of the Week Award.",
    "3B P39811 of the T55 honored: Wins the MLB NL Player of the Week Award.",
    "T37: P33265 goes 5-6 against the T56, with 3 2B, 1 HR, 4 RBI and 3 R."
  ],
  "2025-09-23T00:00:00-07:00": [
    "T46: P23766 pitches a 3-hit shutout against the T56 with 11 strikeouts and 3 BB allowed!"
  ],
  "2025-09-24T00:00:00-07:00": [
    "T48: P35498 gets his 2000th career hit!",
    "T37: P33873 goes 5-5 against the T36, with 0 RBI and 3 R."
  ],
  "2025-09-25T00:00:00-07:00": [
    "T57: SP P59400 honored: Wins the 2025 APP Outstanding Pitcher Award.",
    "T43: SP P56476 honored: Finished 2nd in 2025 APP Outstanding Pitcher Award voting.",
    "T47: RP P58311 honored: Finished 3rd in 2025 APP Outstanding Pitcher Award voting.",
    "T60: SP P54618 honored: Wins the 2025 DSL Outstanding Pitcher Award.",
    "T44: SP P31774 honored: Finished 2nd in 2025 DSL Outstanding Pitcher Award voting.",
    "T35: SP P61046 honored: Finished 3rd in 2025 DSL Outstanding Pitcher Award voting."
  ],
  "2025-09-26T00:00:00-07:00": [
    "T57: SP P59400 honored: Wins the 2025 APP Most Valuable Player Award.",
    "T57: 1B P55018 honored: Finished 2nd in 2025 APP Most Valuable Player Award voting.",
    "T43: SP P56476 honored: Finished 3rd in 2025 APP Most Valuable Player Award voting.",
    "T49: RF P49682 honored: Wins the 2025 DSL Most Valuable Player Award.",
    "T60: SP P54618 honored: Finished 2nd in 2025 DSL Most Valuable Player Award voting.",
    "T36: CF P22790 honored: Finished 3rd in 2025 DSL Most Valuable Player Award voting."
  ],
  "2025-09-27T00:00:00-07:00": [
    "T53: SP P42598 honored: Wins the 2025 NWL Outstanding Pitcher Award.",
    "T53: SP P35244 honored: Finished 2nd in 2025 NWL Outstanding Pitcher Award voting.",
    "T53: SP P29515 honored: Finished 3rd in 2025 NWL Outstanding Pitcher Award voting."
  ],
  "2025-09-28T00:00:00-07:00": [
    "T52: SP P34410 honored: Wins the 2025 EL Outstanding Pitcher Award.",
    "T48: SP P56839 honored: Finished 2nd in 2025 EL Outstanding Pitcher Award voting.",
    "T52: SP P55757 honored: Finished 3rd in 2025 EL Outstanding Pitcher Award voting.",
    "T53: 2B P39034 honored: Wins the 2025 NWL Most Valuable Player Award.",
    "T36: 3B P50896 honored: Finished 2nd in 2025 NWL Most Valuable Player Award voting.",
    "T36: RF P59510 honored: Finished 3rd in 2025 NWL Most Valuable Player Award voting."
  ],
  "2025-09-29T00:00:00-07:00": [
    "1B P25185 of the T48 honored: Wins the MLB AL Player of the Week Award.",
    "1B P53704 of the T52 honored: Wins the MLB NL Player of the Week Award.",
    "T60: 3B P28445 honored: Wins the 2025 EL Most Valuable Player Award.",
    "T51: LF P57558 honored: Finished 2nd in 2025 EL Most Valuable Player Award voting.",
    "T60: LF P53344 honored: Finished 3rd in 2025 EL Most Valuable Player Award voting."
  ]
}
