{
  "2025-11-17T00:00:00-08:00": [
    "CL P30472 of the T54 honored: Wins the 2025 MLB AL Reliever of the Year.",
    "RP P26232 of the T58 honored: Finished 2nd in 2025 MLB AL Reliever of the Year voting.",
    "RP P54914 of the T54 honored: Finished 3rd in 2025 MLB AL Reliever of the Year voting.",
    "CL P33474 of the T37 honored: Wins the 2025 MLB NL Reliever of the Year.",
    "RP P37296 of the T39 honored: Finished 2nd in 2025 MLB NL Reliever of the Year voting.",
    "RP P53626 of the T53 honored: Finished 3rd in 2025 MLB NL Reliever of the Year voting."
  ],
  "2025-11-18T00:00:00-08:00": [
    "C P33558 of the T48 honored: Wins the 2025 MLB AL Silver Slugger at C.",
    "1B P32314 of the T34 honored: Wins the 2025 MLB AL Silver Slugger at 1B.",
    "2B P35840 of the T38 honored: Wins the 2025 MLB AL Silver Slugger at 2B.",
    "3B P24322 of the T47 honored: Wins the 2025 MLB AL Silver Slugger at 3B.",
    "SS P35142 of the T34 honored: Wins the 2025 MLB AL Silver Slugger at SS.",
    "RF P28678 of the T38 honored: Wins the 2025 MLB AL Silver Slugger at LF.",
    "RF P62067 of the T47 honored: Wins the 2025 MLB AL Silver Slugger at CF.",
    "RF P53671 of the T33 honored: Wins the 2025 MLB AL Silver Slugger at RF.",
    "1B P53142 of the T47 honored: Wins the 2025 MLB AL Silver Slugger at DH.",
    "SP P1665 of the T31 honored: Wins the 2025 MLB NL Silver Slugger at P.",
    "C P55237 of the T53 honored: Wins the 2025 MLB NL Silver Slugger at C.",
    "1B P55366 of the T37 honored: Wins the 2025 MLB NL Silver Slugger at 1B.",
    "2B P25200 of the T36 honored: Wins the 2025 MLB NL Silver Slugger at 2B.",
    "3B P33873 of the T37 honored: Wins the 2025 MLB NL Silver Slugger at 3B.",
    "SS P23809 of the T46 honored: Wins the 2025 MLB NL Silver Slugger at SS.",
    "LF P48867 of the T53 honored: Wins the 2025 MLB NL Silver Slugger at LF.",
    "RF P36858 of the T37 honored: Wins the 2025 MLB NL Silver Slugger at CF.",
    "RF P23261 of the T52 honored: Wins the 2025 MLB NL Silver Slugger at RF."
  ],
  "2025-11-19T00:00:00-08:00": [
    "RF P62067 of the T47 honored: Wins the 2025 MLB AL Rookie of the Year Award.",
    "RF P53966 of the T34 honored: Finished 2nd in 2025 MLB AL Rookie of the Year Award voting.",
    "C P55093 of the T47 honored: Finished 3rd in 2025 MLB AL Rookie of the Year Award voting.",
    "LF P59438 of the T37 honored: Wins the 2025 MLB NL Rookie of the Year Award.",
    "C P55237 of the T53 honored: Finished 2nd in 2025 MLB NL Rookie of the Year Award voting.",
    "SP P29670 of the T49 honored: Finished 3rd in 2025 MLB NL Rookie of the Year Award voting."
  ],
  "2025-11-20T00:00:00-08:00": [
    "SP P38158 of the T34 honored: Wins the 2025 MLB AL Cy Young Award.",
    "SP P28398 of the T34 honored: Finished 2nd in 2025 MLB AL Cy Young Award voting.",
    "SP P41703 of the T54 honored: Finished 3rd in 2025 MLB AL Cy Young Award voting.",
    "SP P33236 of the T45 honored: Wins the 2025 MLB NL Cy Young Award.",
    "SP P53858 of the T37 honored: Finished 2nd in 2025 MLB NL Cy Young Award voting.",
    "SP P49649 of the T37 honored: Finished 3rd in 2025 MLB NL Cy Young Award voting."
  ],
  "2025-11-21T00:00:00-08:00": [
    "RF P53671 of the T33 honored: Wins the 2025 MLB AL Most Valuable Player Award.",
    "RF P62067 of the T47 honored: Finished 2nd in 2025 MLB AL Most Valuable Player Award voting.",
    "RF P28678 of the T38 honored: Finished 3rd in 2025 MLB AL Most Valuable Player Award voting.",
    "1B P55366 of the T37 honored: Wins the 2025 MLB NL Most Valuable Player Award.",
    "SS P33265 of the T37 honored: Finished 2nd in 2025 MLB NL Most Valuable Player Award voting.",
    "CF P53787 of the T39 honored: Finished 3rd in 2025 MLB NL Most Valuable Player Award voting."
  ]
}
