{
  "2025-10-06T00:00:00-07:00": [
    "T47: SP P54977 honored: Wins the 2025 FSL Outstanding Pitcher Award.",
    "T59: SP P56896 honored: Finished 2nd in 2025 FSL Outstanding Pitcher Award voting.",
    "T48: SP P53686 honored: Finished 3rd in 2025 FSL Outstanding Pitcher Award voting.",
    "LF P39461 of the T57 honored: Wins the MLB AL Player of the Week Award.",
    "RF P34915 of the T51 honored: Wins the MLB NL Player of the Week Award.",
    "T37: SP P54917 honored: Wins the 2025 IL Outstanding Pitcher Award.",
    "T37: SP P54352 honored: Finished 2nd in 2025 IL Outstanding Pitcher Award voting.",
    "T37: SP P53421 honored: Finished 3rd in 2025 IL Outstanding Pitcher Award voting."
  ],
  "2025-10-07T00:00:00-07:00": [
    "T51: RF P32331 honored: Wins the 2025 FSL Most Valuable Player Award.",
    "T47: LF P22770 honored: Finished 2nd in 2025 FSL Most Valuable Player Award voting.",
    "T48: SS P57199 honored: Finished 3rd in 2025 FSL Most Valuable Player Award voting.",
    "T53: SP P52576 honored: Wins the 2025 CAL Outstanding Pitcher Award.",
    "T53: SP P55761 honored: Finished 2nd in 2025 CAL Outstanding Pitcher Award voting.",
    "T39: RP P36523 honored: Finished 3rd in 2025 CAL Outstanding Pitcher Award voting.",
    "T33: SP P2013 honored: Wins the 2025 CAR Outstanding Pitcher Award.",
    "T36: RP P39754 honored: Finished 2nd in 2025 CAR Outstanding Pitcher Award voting.",
    "T33: RP P49762 honored: Finished 3rd in 2025 CAR Outstanding Pitcher Award voting.",
    "T57: SP P55010 honored: Wins the 2025 GCL Outstanding Pitcher Award.",
    "T48: SP P842 honored: Finished 2nd in 2025 GCL Outstanding Pitcher Award voting.",
    "T40: SP P58258 honored: Finished 3rd in 2025 GCL Outstanding Pitcher Award voting.",
    "T32: 1B P24168 honored: Wins the 2025 IL Most Valuable Player Award.",
    "T37: SP P54917 honored: Finished 2nd in 2025 IL Most Valuable Player Award voting.",
    "T32: LF P25194 honored: Finished 3rd in 2025 IL Most Valuable Player Award voting."
  ]
}
