{
  "2025-04-07T00:00:00-07:00": [
    "T33: CF P30724 was designated for assignment and placed on irrevocable waivers.",
    "T33: RP P35425 was designated for assignment and placed on irrevocable waivers.",
    "T33: RP P37039 was designated for assignment and placed on irrevocable waivers.",
    "T46: RP P29658 was designated for assignment and placed on irrevocable waivers.",
    "T46: 3B P21306 was designated for assignment and placed on irrevocable waivers.",
    "T46: RP P53678 was designated for assignment, placed on waivers and taken off the 40-man roster.",
    "T60: RP P27287 was designated for assignment and placed on irrevocable waivers.",
    "T60: C P39487 was designated for assignment and placed on irrevocable waivers.",
    "T60: RP P38820 was designated for assignment and placed on irrevocable waivers.",
    "T60: LF P1428 was designated for assignment and placed on irrevocable waivers.",
    "T60: 3B P23870 was designated for assignment and placed on irrevocable waivers.",
    "T46: 2B P32464 was designated for assignment and placed on irrevocable waivers.",
    "T46: C P22590 was designated for assignment and placed on irrevocable waivers.",
    "T31: Placed RP P29998 on the 7-day disabled list, retroactive to 03/26/2025.",
    "T31: Placed CL P52975 on the 7-day disabled list, retroactive to 03/18/2025.",
    "T31: RP P50232 was designated for assignment and placed on waivers.",
    "T31: RP P265 was designated for assignment and placed on waivers.",
    "T32: Placed LF P53121 on the 60-day disabled list.",
    "T32: Placed RP P22760 on the 60-day disabled list.",
    "T32: RP P49908 was designated for assignment and placed on waivers.",
    "T32: RP P39020 was designated for assignment and placed on waivers.",
    "T32: C P40932 was designated for assignment and placed on waivers.",
    "T32: LF P25194 was designated for assignment and placed on waivers.",
    "T32: Placed C P37613 on the active roster.",
    "T32: Activated C P37613 from the 60-day disabled list.",
    "T33: Placed LF P38612 on irrevocable waivers.",
    "T34: Placed 3B P38573 on the 7-day disabled list, retroactive to 03/30/2025.",
    "T34: C P50313 was designated for assignment and placed on waivers.",
    "T34: Placed RP P33785 on the 60-day disabled list.",
    "T34: 2B P20675 was designated for assignment and placed on waivers.",
    "T34: Placed CL P37285 on the active roster.",
    "T34: Activated CL P37285 from the 60-day disabled list.",
    "T34: LF P24298 was designated for assignment and placed on waivers.",
    "T34: Placed LF P30166 on the active roster.",
    "T34: Activated LF P30166 from the disabled list.",
    "T34: 2B P27176 was designated for assignment and placed on waivers.",
    "T34: Placed RF P25187 on the active roster.",
    "T34: Activated RF P25187 from the disabled list.",
    "T35: Placed SP P29657 on the 7-day disabled list, retroactive to 08/06/2024.",
    "T35: Placed SP P25144 on the 7-day disabled list, retroactive to 03/13/2025.",
    "T35: C P49675 was designated for assignment and placed on waivers.",
    "T35: 3B P50891 was designated for assignment and placed on waivers.",
    "T35: LF P26931 was designated for assignment and placed on waivers.",
    "T36: RP P25133 was designated for assignment and placed on waivers.",
    "T43: Placed SP P26951 on the 7-day disabled list, retroactive to 04/03/2025.",
    "T43: Placed SP P25817 on the 7-day disabled list, retroactive to 03/22/2025.",
    "T43: 2B P49683 was designated for assignment and placed on waivers.",
    "T43: 2B P48806 was designated for assignment and placed on waivers.",
    "T44: Placed RP P62072 on the 60-day disabled list.",
    "T44: SP P29862 was designated for assignment and placed on waivers.",
    "T44: Placed LF P29736 on the 7-day disabled list, retroactive to 04/03/2025.",
    "T44: Placed RP P38781 on the active roster.",
    "T44: Activated RP P38781 from the 60-day disabled list.",
    "T45: Placed SP P24031 on the 60-day disabled list.",
    "T45: Placed 3B P30047 on the 60-day disabled list.",
    "T45: Placed RP P26087 on the 60-day disabled list.",
    "T45: Placed RP P26672 on the 60-day disabled list.",
    "T41: Placed LF P51506 on the 7-day disabled list, retroactive to 04/03/2025.",
    "T41: RP P193 was designated for assignment and placed on irrevocable waivers.",
    "T48: RP P19894 was designated for assignment and placed on waivers.",
    "T48: RP P30109 was designated for assignment and placed on waivers.",
    "T48: RP P20161 was designated for assignment and placed on waivers.",
    "T49: Placed RP P23761 on the 7-day disabled list, retroactive to 04/02/2025.",
    "T49: C P40187 was designated for assignment and placed on waivers.",
    "T49: Placed 3B P39655 on the active roster.",
    "T49: Activated 3B P39655 from the disabled list.",
    "T50: Placed RF P36333 on the 7-day disabled list, retroactive to 03/27/2025.",
    "T50: Placed 2B P28815 on the 60-day disabled list.",
    "T57: RP P52160 was designated for assignment and placed on waivers.",
    "T57: RP P38652 was designated for assignment and placed on waivers.",
    "T57: SS P25119 was designated for assignment and placed on waivers.",
    "T58: Placed RP P25907 on the 7-day disabled list, retroactive to 04/02/2025.",
    "T58: Placed CF P53426 on the active roster.",
    "T58: Activated CF P53426 from the disabled list.",
    "T59: Released former Rule 5 draft pickSP P25430, returned to original Organization T60."
  ],
  "2025-04-08T00:00:00-07:00": [
    "T38: Activated SP P26704 from the disabled list.",
    "T38: 2B P25761 was designated for assignment and placed on irrevocable waivers.",
    "T38: 2B P39486 was designated for assignment and placed on irrevocable waivers.",
    "T38: RP P41084 was designated for assignment and placed on irrevocable waivers.",
    "T38: RP P38832 was designated for assignment and placed on irrevocable waivers.",
    "T38: SP P37628 was designated for assignment and placed on irrevocable waivers.",
    "T51: Placed SP P33604 on the 7-day disabled list, retroactive to 03/25/2025.",
    "T51: Activated RP P38611 from the 60-day disabled list.",
    "T51: SP P48230 was designated for assignment and placed on irrevocable waivers.",
    "T51: 1B P36132 was designated for assignment and placed on waivers (from active).",
    "T51: C P27302 was designated for assignment and placed on irrevocable waivers.",
    "T51: SS P32383 was designated for assignment and placed on irrevocable waivers.",
    "T51: SS P29719 was designated for assignment and placed on irrevocable waivers."
  ],
  "2025-04-11T00:00:00-07:00": [
    "T35: Signed free agent RP P39460 to a 1-year contract worth a total of $1,500,000.",
    "T60: Activated SP P30254 from the disabled list."
  ],
  "2025-04-14T00:00:00-07:00": [
    "The T54 traded nothing to the T53, getting 19-year-old minor league center fielder P58230 in return.",
    "The T53 traded 24-year-old minor league right fielder P55780 to the T31, getting 22-year-old minor league starting pitcher P53271 in return."
  ]
}
