{
  "2025-06-30T00:00:00-07:00": [
    "T35: Signed P62619 to a minor league contract with a signing bonus of $300,000.",
    "The T37 traded 28-year-old shortstop P29575, 24-year-old minor league shortstop P57607 and 25-year-old minor league starting pitcher P55026 to the T39, getting 22-year-old minor league center fielder P32956 in return.",
    "The T58 traded 20-year-old minor league starting pitcher P59107, 26-year-old minor league first baseman P53704 and $250,000 in cash to the T52, getting 21-year-old minor league starting pitcher P57031 in return.",
    "The T56 traded 26-year-old third baseman P24098 to the T37, getting 24-year-old minor league third baseman P57330, 20-year-old minor league starting pitcher P60700 and 22-year-old minor league center fielder P57207 in return.",
    "The T47 traded 23-year-old minor league starting pitcher P55189 to the T56, getting 28-year-old center fielder P25146 in return.",
    "The T40 traded 30-year-old starting pitcher P37027 to the T57, getting $1 in cash in return.",
    "The T53 traded 25-year-old minor league starting pitcher P55336, retaining 10% to the T40, getting 19-year-old minor league starting pitcher P56060 and 25-year-old minor league first baseman P59121 in return.",
    "T31: RP P33991 was designated for assignment and placed on waivers.",
    "T31: Placed SP P52484 on the active roster.",
    "T31: Activated SP P52484 from the disabled list.",
    "T32: CF P24548 was designated for assignment and placed on waivers.",
    "T32: Placed RP P26270 on the active roster.",
    "T34: RP P38740 was designated for assignment and placed on waivers.",
    "T34: Sent DH P30166 to Triple A Pawtucket for injury rehab.",
    "T37: Placed CF P33105 on the 7-day disabled list, retroactive to 06/25/2025.",
    "T37: Placed 3B P24098 on the active roster.",
    "T38: Placed CF P55650 on the active roster.",
    "T38: Activated CF P55650 from the disabled list.",
    "T42: Placed SP P29661 on the 60-day disabled list.",
    "T42: Placed RP P25116 on the 7-day disabled list, retroactive to 06/29/2025.",
    "T44: Placed SP P54892 on the active roster.",
    "T44: Activated SP P54892 from the disabled list.",
    "T44: Placed SP P43033 on the active roster.",
    "T44: Activated SP P43033 from the disabled list.",
    "T45: Sent RP P24221 to Triple A Oklahoma City for injury rehab.",
    "T46: Placed SP P35495 on the 7-day disabled list, retroactive to 06/26/2025.",
    "T49: Placed SP P1816 on the active roster.",
    "T49: Activated SP P1816 from the disabled list.",
    "T49: Sent RP P23761 to Triple A Las Vegas for injury rehab.",
    "T49: Sent RP P59482 to Triple A Las Vegas for injury rehab.",
    "T55: LF P38680 was designated for assignment and placed on waivers.",
    "T56: Sent SP P27493 to Triple A Memphis for injury rehab.",
    "T56: Placed 2B P28860 on the 7-day disabled list, retroactive to 06/25/2025.",
    "T58: Placed RP P36248 on the 7-day disabled list, retroactive to 06/26/2025."
  ],
  "2025-07-01T00:00:00-07:00": [
    "T41: Signed P60615 to a minor league contract with a signing bonus of $230,000."
  ],
  "2025-07-02T00:00:00-07:00": [
    "T54: Signed P62779 to a minor league contract with a signing bonus of $200,000.",
    "T60: Signed P62904 to a minor league contract with a signing bonus of $2,200,000.",
    "T45: Signed P60598 to a minor league contract with a signing bonus of $2,200,000."
  ],
  "2025-07-03T00:00:00-07:00": [
    "T60: Activated SS P53701 from the disabled list.",
    "T60: Sent SS P53701 to Triple A Syracuse for injury rehab."
  ],
  "2025-07-05T00:00:00-07:00": [
    "T34: Signed P62926 to a minor league contract with a signing bonus of $2,400,000.",
    "T34: Signed P62653 to a minor league contract with a signing bonus of $2,000,000.",
    "T41: Signed P62280 to a minor league contract with a signing bonus of $150,000."
  ],
  "2025-07-06T00:00:00-07:00": [
    "T55: Claimed 1B P29691 off waivers from Cleveland.",
    "T47: Claimed RP P22760 off waivers from Atlanta."
  ],
  "2025-07-07T00:00:00-07:00": [
    "T45: Signed P60737 to a minor league contract with a signing bonus of $1,650,000.",
    "The T36 traded 25-year-old minor league right fielder P55589 to the T46, getting 23-year-old minor league catcher P53456 in return.",
    "The T40 traded 24-year-old minor league right fielder P55742 and 20-year-old minor league closer P60882 to the T46, getting 32-year-old starting pitcher P35495, retaining 100% in return.",
    "The T36 traded $1 in cash to the T37, getting 39-year-old third baseman P19583 in return.",
    "The T57 traded 22-year-old minor league third baseman P55324, 22-year-old minor league center fielder P56821 and 21-year-old minor league starting pitcher P57579 to the T52, getting 31-year-old starting pitcher P39616 and 29-year-old second baseman P38928 in return."
  ]
}
