{
  "2025-03-17T00:00:00-07:00": [
    "T31: Placed SP P33991 on the 60-day disabled list.",
    "T34: Placed RP P33526 on the 60-day disabled list.",
    "T34: Placed LF P30166 on the 7-day disabled list, retroactive to 03/16/2025.",
    "T34: Placed RF P25187 on the 7-day disabled list, retroactive to 03/16/2025.",
    "T38: Placed SP P23822 on the 60-day disabled list.",
    "T38: Placed SP P26704 on the 7-day disabled list, retroactive to 03/10/2025.",
    "T39: RP P51461 was designated for assignment and placed on waivers.",
    "T42: Placed SP P53238 on the 60-day disabled list.",
    "T42: Placed SP P34703 on the 60-day disabled list.",
    "T43: Placed RP P58305 on the 7-day disabled list, retroactive to 03/14/2025.",
    "T43: Placed CL P35250 on the 60-day disabled list.",
    "T44: SS P1495 was designated for assignment and placed on waivers.",
    "T44: Placed RP P39243 on the active roster.",
    "T45: LF P41409 was designated for assignment and placed on waivers.",
    "T45: 3B P38979 was designated for assignment and placed on waivers.",
    "T46: RP P28919 was designated for assignment and placed on waivers.",
    "T48: 2B P21025 was designated for assignment and placed on waivers.",
    "T49: Placed 3B P39655 on the 7-day disabled list, retroactive to 03/03/2025.",
    "T49: C P40187 was designated for assignment and placed on waivers.",
    "T49: Placed C P40187 on the active roster.",
    "T55: Placed 1B P38604 on waivers.",
    "T55: Placed RF P47317 on waivers.",
    "T55: Placed 2B P35263 on waivers.",
    "T55: Placed RP P32847 on waivers.",
    "T55: Placed RP P36352 on waivers.",
    "T55: Placed LF P38680 on irrevocable waivers."
  ],
  "2025-03-27T00:00:00-07:00": [
    "T33: Placed RP P53722 on the 60-day disabled list."
  ],
  "2025-03-28T00:00:00-07:00": [
    "T60: Placed SP P30254 on the 7-day disabled list, retroactive to 03/24/2025."
  ],
  "2025-04-03T00:00:00-07:00": [
    "T33: Placed CL P25610 on the 7-day disabled list, retroactive to 04/02/2025."
  ],
  "2025-04-07T00:00:00-07:00": [
    "T33: CF P30724 was designated for assignment and placed on irrevocable waivers.",
    "T33: RP P35425 was designated for assignment and placed on irrevocable waivers.",
    "T33: RP P37039 was designated for assignment and placed on irrevocable waivers.",
    "T46: RP P29658 was designated for assignment and placed on irrevocable waivers.",
    "T46: 3B P21306 was designated for assignment and placed on irrevocable waivers.",
    "T46: RP P53678 was designated for assignment, placed on waivers and taken off the 40-man roster.",
    "T60: RP P27287 was designated for assignment and placed on irrevocable waivers.",
    "T60: C P39487 was designated for assignment and placed on irrevocable waivers.",
    "T60: RP P38820 was designated for assignment and placed on irrevocable waivers.",
    "T60: LF P1428 was designated for assignment and placed on irrevocable waivers.",
    "T60: 3B P23870 was designated for assignment and placed on irrevocable waivers.",
    "T46: 2B P32464 was designated for assignment and placed on irrevocable waivers.",
    "T46: C P22590 was designated for assignment and placed on irrevocable waivers."
  ]
}
