{
  "2025-06-16T00:00:00-07:00": [
    "T31: SP P1407 was designated for assignment and placed on waivers.",
    "T37: Sent SS P33265 to Triple A Louisville for injury rehab.",
    "T37: RP P19499 was designated for assignment and placed on waivers.",
    "T37: 3B P19583 was designated for assignment and placed on waivers.",
    "T38: Placed RF P28678 on the 7-day disabled list, retroactive to 06/15/2025.",
    "T38: Placed 1B P54928 on the active roster.",
    "T38: Activated 1B P54928 from the disabled list.",
    "T38: Released former Rule 5 draft pick3B P25141, returned to original Organization T47.",
    "T38: Placed SP P33166 on the active roster.",
    "T38: Activated SP P33166 from the disabled list.",
    "T44: Placed RF P35161 on the 60-day disabled list.",
    "T44: Placed SP P43033 on the 7-day disabled list, retroactive to 06/15/2025.",
    "T46: Placed SS P23809 on the active roster.",
    "T46: Activated SS P23809 from the disabled list.",
    "T47: LF P27347 was designated for assignment and placed on waivers.",
    "T47: Placed RF P27200 on the active roster.",
    "T47: Activated RF P27200 from the disabled list.",
    "T48: RP P26270 was designated for assignment and placed on waivers.",
    "T48: Placed RP P30475 on the 7-day disabled list, retroactive to 06/15/2025.",
    "T49: Placed SP P1816 on the 7-day disabled list, retroactive to 06/15/2025.",
    "T49: Placed RP P23761 on the 7-day disabled list, retroactive to 06/15/2025.",
    "T49: Placed RP P59482 on the 7-day disabled list, retroactive to 06/11/2025.",
    "T49: Placed SP P35120 on the active roster.",
    "T49: Activated SP P35120 from the disabled list.",
    "T50: Placed LF P55254 on the active roster.",
    "T50: Activated LF P55254 from the disabled list.",
    "T54: Placed CF P24455 on the 7-day disabled list, retroactive to 06/14/2025.",
    "T54: Placed CF P28737 on the active roster.",
    "T54: Activated CF P28737 from the disabled list.",
    "T54: Placed LF P22818 on the active roster.",
    "T54: Activated LF P22818 from the disabled list.",
    "T57: Placed RP P23534 on the active roster.",
    "T57: Activated RP P23534 from the disabled list."
  ],
  "2025-06-17T00:00:00-07:00": [
    "T57: Signed P62618 to a minor league contract with a signing bonus of $430,000.",
    "T57: Signed P62772 to a minor league contract with a signing bonus of $150,000.",
    "T43: Signed P62868 to a minor league contract with a signing bonus of $150,000.",
    "T47: Signed P62531 to a minor league contract with a signing bonus of $260,000.",
    "T47: Signed P63124 to a minor league contract with a signing bonus of $150,000.",
    "T44: Signed P59056 to a minor league contract with a signing bonus of $700,000.",
    "T32: Signed P62939 to a minor league contract with a signing bonus of $150,000.",
    "T37: Signed P63123 to a minor league contract with a signing bonus of $250,000.",
    "T52: Signed P62899 to a minor league contract with a signing bonus of $3,211,000.",
    "T52: Signed P62508 to a minor league contract with a signing bonus of $150,000."
  ],
  "2025-06-18T00:00:00-07:00": [
    "T48: Signed P63253 to a minor league contract with a signing bonus of $1,600,000.",
    "T40: Signed P57052 to a minor league contract with a signing bonus of $150,000.",
    "T32: Signed P60531 to a minor league contract with a signing bonus of $320,000.",
    "T46: Signed P62214 to a minor league contract with a signing bonus of $1,325,000.",
    "T52: Signed P62770 to a minor league contract with a signing bonus of $250,000.",
    "T39: Signed P62786 to a minor league contract with a signing bonus of $380,000.",
    "T39: Signed P62734 to a minor league contract with a signing bonus of $150,000.",
    "T53: Signed P62809 to a minor league contract with a signing bonus of $1,210,000.",
    "T55: Signed P62829 to a minor league contract with a signing bonus of $150,000."
  ],
  "2025-06-19T00:00:00-07:00": [
    "T48: Signed P63269 to a minor league contract with a signing bonus of $600,000.",
    "T59: Signed P62690 to a minor league contract with a signing bonus of $150,000.",
    "T40: Signed P63137 to a minor league contract with a signing bonus of $200,000.",
    "T47: Signed P63008 to a minor league contract with a signing bonus of $190,000.",
    "T44: Signed P63310 to a minor league contract with a signing bonus of $2,730,000.",
    "T58: Signed P63280 to a minor league contract with a signing bonus of $250,000.",
    "T42: Signed P63342 to a minor league contract with a signing bonus of $1,500,000.",
    "T32: Signed P62607 to a minor league contract with a signing bonus of $260,000.",
    "T41: Signed P61127 to a minor league contract with a signing bonus of $4,100,000.",
    "T41: Signed P62656 to a minor league contract with a signing bonus of $670,000.",
    "T36: Signed P59486 to a minor league contract with a signing bonus of $310,000.",
    "T37: Signed P58904 to a minor league contract with a signing bonus of $150,000.",
    "T56: Signed P62828 to a minor league contract with a signing bonus of $1,460,000.",
    "T31: Signed P63092 to a minor league contract with a signing bonus of $330,000.",
    "T45: Signed P62648 to a minor league contract with a signing bonus of $2,800,000."
  ],
  "2025-06-20T00:00:00-07:00": [
    "T36: Signed C P33889 to a 1-year contract extension worth a total of $900,000.",
    "T34: Signed P62238 to a minor league contract with a signing bonus of $450,000.",
    "T57: Signed P62598 to a minor league contract with a signing bonus of $1,500,000.",
    "T40: Signed P63090 to a minor league contract with a signing bonus of $280,000.",
    "T56: Signed P62642 to a minor league contract with a signing bonus of $460,000.",
    "T31: Signed P62240 to a minor league contract with a signing bonus of $330,000.",
    "T39: Signed P62961 to a minor league contract with a signing bonus of $1,230,000.",
    "T39: Signed P61069 to a minor league contract with a signing bonus of $250,000.",
    "T39: Signed P61173 to a minor league contract with a signing bonus of $180,000.",
    "T53: Signed P62962 to a minor league contract with a signing bonus of $180,000.",
    "T55: Signed P62988 to a minor league contract with a signing bonus of $2,550,000."
  ],
  "2025-06-21T00:00:00-07:00": [
    "T34: Signed P62276 to a minor league contract with a signing bonus of $1,330,000.",
    "T34: Signed P62984 to a minor league contract with a signing bonus of $150,000.",
    "T57: Signed P62530 to a minor league contract with a signing bonus of $270,000.",
    "T38: Signed P62218 to a minor league contract with a signing bonus of $2,600,000.",
    "T43: Signed P62511 to a minor league contract with a signing bonus of $290,000.",
    "T50: Signed P62561 to a minor league contract with a signing bonus of $2,200,000.",
    "T42: Signed P62261 to a minor league contract with a signing bonus of $150,000.",
    "T37: Signed P62946 to a minor league contract with a signing bonus of $1,000,000.",
    "T31: Signed P63216 to a minor league contract with a signing bonus of $1,850,000.",
    "T31: Signed P63108 to a minor league contract with a signing bonus of $150,000.",
    "T45: Signed P62707 to a minor league contract with a signing bonus of $190,000.",
    "T45: Signed P63066 to a minor league contract with a signing bonus of $150,000.",
    "T53: Signed P62862 to a minor league contract with a signing bonus of $150,000."
  ],
  "2025-06-22T00:00:00-07:00": [
    "T53: Claimed C P20225 off waivers from Baltimore.",
    "T33: Signed P62627 to a minor league contract with a signing bonus of $800,000.",
    "T48: Signed P63119 to a minor league contract with a signing bonus of $220,000.",
    "T48: Signed P62858 to a minor league contract with a signing bonus of $150,000.",
    "T57: Signed P63081 to a minor league contract with a signing bonus of $2,000,000.",
    "T40: Signed P63161 to a minor league contract with a signing bonus of $3,800,000.",
    "T44: Signed P62997 to a minor league contract with a signing bonus of $2,020,000.",
    "T44: Signed P63261 to a minor league contract with a signing bonus of $350,000.",
    "T50: Signed P62260 to a minor league contract with a signing bonus of $410,000.",
    "T41: Signed P63160 to a minor league contract with a signing bonus of $400,000.",
    "T37: Signed P61380 to a minor league contract with a signing bonus of $2,000,000.",
    "T53: Signed P63289 to a minor league contract with a signing bonus of $2,200,000."
  ],
  "2025-06-23T00:00:00-07:00": [
    "T33: Signed P62219 to a minor league contract with a signing bonus of $400,000.",
    "T57: Signed P61012 to a minor league contract with a signing bonus of $190,000.",
    "T43: Signed P63056 to a minor league contract with a signing bonus of $4,800,000.",
    "T47: Signed P62585 to a minor league contract with a signing bonus of $470,000.",
    "T58: Signed P60600 to a minor league contract with a signing bonus of $390,000.",
    "T41: Signed P62888 to a minor league contract with a signing bonus of $350,000.",
    "T36: Signed P62564 to a minor league contract with a signing bonus of $210,000.",
    "T37: Signed P62588 to a minor league contract with a signing bonus of $370,000.",
    "T52: Signed P63019 to a minor league contract with a signing bonus of $750,000.",
    "T31: Signed P63157 to a minor league contract with a signing bonus of $630,000.",
    "T53: Signed P62489 to a minor league contract with a signing bonus of $250,000.",
    "The T34 traded 37-year-old reliever P33526 to the T37, getting 40-year-old reliever P19499 in return.",
    "The T37 traded 23-year-old minor league center fielder P26631, 24-year-old second baseman P53432 and 24-year-old minor league starting pitcher P53072 to the T43, getting 29-year-old center fielder P21191, retaining 65% in return.",
    "The T53 traded 25-year-old shortstop P50265, 23-year-old minor league starting pitcher P58689 and 21-year-old minor league starting pitcher P60602 to the T56, getting 27-year-old shortstop P30248 in return.",
    "The T41 traded 35-year-old shortstop P36297 and 22-year-old minor league starting pitcher P54675 to the T59, getting 25-year-old shortstop P50889 and 28-year-old minor league first baseman P21187 in return.",
    "The T53 traded 27-year-old minor league reliever P30039 to the T57, getting 22-year-old minor league starting pitcher P61242 in return."
  ]
}
