{
  "2025-07-21T00:00:00-07:00": [
    "The T33 traded nothing to the T53, getting 27-year-old reliever P29663, retaining 100% in return.",
    "The T34 traded 20-year-old minor league first baseman P54631 to the T37, getting 20-year-old minor league starting pitcher P55846 in return.",
    "The T40 traded 29-year-old reliever P23428 to the T34, getting 19-year-old minor league starting pitcher P61226 in return.",
    "The T58 traded 21-year-old minor league reliever P57590 and 22-year-old minor league closer P58790 to the T52, getting 31-year-old shortstop P22552 in return.",
    "T33: Placed RP P29663 on the active roster.",
    "T33: Placed SP P22048 on irrevocable waivers.",
    "T33: Placed 2B P32425 on the 7-day disabled list, retroactive to 07/19/2025.",
    "T33: Placed CF P55381 on the 7-day disabled list, retroactive to 07/13/2025.",
    "T33: Placed C P31093 on waivers.",
    "T34: Placed RP P23428 on the active roster.",
    "T35: Placed SP P8 on the 7-day disabled list, retroactive to 07/20/2025.",
    "T43: Placed SP P42765 on the 7-day disabled list, retroactive to 07/19/2025.",
    "T43: Placed CL P52958 on the active roster.",
    "T43: Activated CL P52958 from the disabled list.",
    "T43: Placed RP P26298 on the 7-day disabled list, retroactive to 07/19/2025.",
    "T43: LF P1440 was designated for assignment and placed on waivers.",
    "T45: Placed SP P38782 on the 7-day disabled list, retroactive to 07/12/2025.",
    "T45: Placed CF P1473 on the active roster.",
    "T45: Activated CF P1473 from the disabled list.",
    "T45: Placed SP P24221 on the active roster.",
    "T45: Activated SP P24221 from the disabled list.",
    "T48: Placed C P33558 on the 7-day disabled list, retroactive to 07/13/2025.",
    "T49: Sent RP P23601 to Triple A Las Vegas for injury rehab.",
    "T58: Placed LF P25233 on the 7-day disabled list, retroactive to 07/19/2025."
  ],
  "2025-07-23T00:00:00-07:00": [
    "T35: Fired scouting director Won-keun Park.",
    "T35: Signed scouting director Brian Cashman to a 4-year, $954,000 per year contract."
  ],
  "2025-07-24T00:00:00-07:00": [
    "T60: Placed RP P22192 on the 60-day disabled list."
  ],
  "2025-07-25T00:00:00-07:00": [
    "T45: Signed RP P49738 to a 1-year contract extension worth a total of $940,000."
  ],
  "2025-07-26T00:00:00-07:00": [
    "T60: Placed CF P50651 on the 7-day disabled list, retroactive to 07/25/2025."
  ],
  "2025-07-27T00:00:00-07:00": [
    "T37: Claimed RP P40220 off waivers from Chicago."
  ],
  "2025-07-28T00:00:00-07:00": [
    "T45: Signed SP P33236 to a 2-year contract extension worth a total of $32,160,000.",
    "The T34 traded 25-year-old minor league starting pitcher P54993, retaining 100% and 18-year-old minor league shortstop P58470 to the T33, getting nothing in return.",
    "The T47 traded 21-year-old minor league starting pitcher P54473 to the T41, getting 19-year-old minor league center fielder P60857 and 19-year-old minor league center fielder P61503 in return.",
    "The T37 traded 23-year-old minor league catcher P55583 to the T36, getting nothing in return.",
    "The T57 traded 21-year-old minor league starting pitcher P58818, 22-year-old minor league shortstop P55591 and 23-year-old minor league reliever P55734 to the T42, getting 29-year-old right fielder P39288 in return.",
    "The T57 traded 25-year-old center fielder P26641 to the T40, getting 20-year-old minor league shortstop P59605 in return.",
    "The T40 traded 22-year-old minor league center fielder P57428 to the T49, getting 24-year-old reliever P24589 in return.",
    "The T52 traded 23-year-old minor league right fielder P26281 to the T47, getting 31-year-old starting pitcher P37102, 28-year-old minor league right fielder P49108, 23-year-old minor league starting pitcher P54977 and 23-year-old minor league starting pitcher P27981 in return.",
    "T31: 2B P50648 was designated for assignment and placed on waivers.",
    "T31: CL P52975 was designated for assignment and placed on waivers.",
    "T32: RP P26270 was designated for assignment and placed on waivers.",
    "T32: Placed RP P25031 on the active roster.",
    "T32: Activated RP P25031 from the disabled list.",
    "T32: Placed LF P37047 on the active roster.",
    "T32: Activated LF P37047 from the disabled list.",
    "T33: Sent CF P55381 to Triple A Norfolk for injury rehab.",
    "T33: Placed SP P54993 on the 7-day disabled list, retroactive to 06/09/2025.",
    "T34: Placed 3B P25187 on the 7-day disabled list, retroactive to 07/27/2025.",
    "T39: LF P37072 was designated for assignment and placed on waivers.",
    "T42: Placed RP P25116 on the active roster.",
    "T42: Activated RP P25116 from the disabled list.",
    "T44: Placed 2B P46900 on the active roster.",
    "T44: Activated 2B P46900 from the disabled list.",
    "T44: Released LF P29736.",
    "T45: Placed SP P24031 on the active roster.",
    "T45: Activated SP P24031 from the 60-day disabled list.",
    "T45: Placed SP P24031 on the 7-day disabled list, retroactive to 03/21/2025.",
    "T41: Placed CF P30804 on the 7-day disabled list, retroactive to 07/27/2025.",
    "T41: SP P22806 was designated for assignment and placed on irrevocable waivers.",
    "T49: RF P28841 was designated for assignment and placed on waivers.",
    "T49: 3B P39655 was designated for assignment and placed on waivers.",
    "T58: Placed C P23917 on the 7-day disabled list, retroactive to 07/23/2025.",
    "T58: Placed SS P55249 on the active roster.",
    "T58: Activated SS P55249 from the disabled list.",
    "T58: Placed RF P24176 on the active roster.",
    "T58: Activated RF P24176 from the disabled list.",
    "T58: LF P39019 was designated for assignment and placed on waivers.",
    "T58: Placed SS P22552 on the active roster.",
    "The T37 traded 27-year-old second baseman P25145, 26-year-old minor league starting pitcher P29927 and 22-year-old minor league catcher P20459 to the T44, getting 30-year-old second baseman P46900 and 22-year-old minor league shortstop P53943 in return.",
    "The T53 traded 22-year-old minor league reliever P60599 to the T49, getting 38-year-old catcher P22632, retaining 100% in return.",
    "The T40 traded 23-year-old minor league starting pitcher P55757 and 19-year-old minor league starting pitcher P44664 to the T52, getting 33-year-old reliever P38752 in return.",
    "The T39 traded 20-year-old minor league starting pitcher P59249, 23-year-old minor league starting pitcher P60728 and 24-year-old minor league center fielder P57020 to the T49, getting 32-year-old second baseman P33564 in return.",
    "The T40 traded 21-year-old minor league starting pitcher P57498 to the T39, getting 26-year-old third baseman P50249 in return.",
    "The T40 traded 23-year-old reliever P53268, 21-year-old minor league left fielder P55847 and 22-year-old minor league starting pitcher P54919 to the T39, getting 27-year-old right fielder P33764 in return.",
    "T37: Placed RP P33526 on the active roster."
  ],
  "2025-08-04T00:00:00-07:00": [
    "The T54 traded 23-year-old minor league closer P59323 to the T52, getting 37-year-old closer P27466, retaining 100% in return.",
    "The T58 traded 24-year-old minor league starting pitcher P58906 and 27-year-old catcher P53431 to the T52, getting 33-year-old catcher P50013 in return.",
    "The T53 traded 32-year-old minor league starting pitcher P39611, 23-year-old minor league starting pitcher P56742 and $1 in cash to the T56, getting 21-year-old minor league starting pitcher P18663 in return.",
    "The T56 traded 33-year-old right fielder P34049, retaining 50% to the T48, getting 30-year-old left fielder P38630 and 29-year-old minor league reliever P1469 in return.",
    "The T57 traded 23-year-old minor league starting pitcher P53512 to the T42, getting 23-year-old minor league starting pitcher P55734 in return."
  ]
}
