{
  "2025-05-19T00:00:00-07:00": [
    "T33: Placed C P1439 on the active roster.",
    "T33: Activated C P1439 from the disabled list.",
    "T35: Placed CF P52197 on the active roster.",
    "T35: Activated CF P52197 from the disabled list.",
    "T35: Placed LF P53205 on the active roster.",
    "T35: Activated LF P53205 from the disabled list.",
    "T43: RP P1376 was designated for assignment and placed on waivers.",
    "T43: Placed SP P26951 on the active roster.",
    "T43: Activated SP P26951 from the disabled list.",
    "T43: Placed RP P58305 on the active roster.",
    "T43: Activated RP P58305 from the disabled list.",
    "T43: Sent SP P25817 to Triple A Omaha for injury rehab.",
    "T44: Placed SP P43033 on the 7-day disabled list, retroactive to 05/14/2025.",
    "T45: Placed RP P53708 on the 7-day disabled list, retroactive to 05/13/2025.",
    "T45: Placed SP P53651 on the active roster.",
    "T45: Activated SP P53651 from the disabled list.",
    "T48: SP P21968 was designated for assignment and placed on waivers.",
    "T55: Placed SP P53617 on the 60-day disabled list.",
    "T54: Placed LF P22818 on the 7-day disabled list, retroactive to 05/13/2025.",
    "T56: Placed SP P27493 on the 7-day disabled list, retroactive to 05/17/2025.",
    "T58: RP P23073 was designated for assignment and placed on waivers."
  ],
  "2025-05-20T00:00:00-07:00": [
    "T60: 2B P29709 was designated for assignment and placed on irrevocable waivers.",
    "T60: C P22590 was designated for assignment and placed on irrevocable waivers."
  ],
  "2025-05-22T00:00:00-07:00": [
    "T60: Signed free agent RP P29662 to a 1-year contract worth a total of $366,000."
  ],
  "2025-05-23T00:00:00-07:00": [
    "T52: Signed free agent SS P22552 to a 1-year contract worth a total of $507,500."
  ],
  "2025-05-24T00:00:00-07:00": [
    "T60: Placed CL P30307 on the 7-day disabled list, retroactive to 05/23/2025."
  ],
  "2025-05-26T00:00:00-07:00": [
    "The T39 traded 23-year-old minor league closer P59401 to the T58, getting 30-year-old reliever P23073 in return."
  ]
}
