{
  "2025-06-23T00:00:00-07:00": [
    "T33: Signed P62219 to a minor league contract with a signing bonus of $400,000.",
    "T57: Signed P61012 to a minor league contract with a signing bonus of $190,000.",
    "T43: Signed P63056 to a minor league contract with a signing bonus of $4,800,000.",
    "T47: Signed P62585 to a minor league contract with a signing bonus of $470,000.",
    "T58: Signed P60600 to a minor league contract with a signing bonus of $390,000.",
    "T41: Signed P62888 to a minor league contract with a signing bonus of $350,000.",
    "T36: Signed P62564 to a minor league contract with a signing bonus of $210,000.",
    "T37: Signed P62588 to a minor league contract with a signing bonus of $370,000.",
    "T52: Signed P63019 to a minor league contract with a signing bonus of $750,000.",
    "T31: Signed P63157 to a minor league contract with a signing bonus of $630,000.",
    "T53: Signed P62489 to a minor league contract with a signing bonus of $250,000.",
    "The T34 traded 37-year-old reliever P33526 to the T37, getting 40-year-old reliever P19499 in return.",
    "The T37 traded 23-year-old minor league center fielder P26631, 24-year-old second baseman P53432 and 24-year-old minor league starting pitcher P53072 to the T43, getting 29-year-old center fielder P21191, retaining 65% in return.",
    "The T53 traded 25-year-old shortstop P50265, 23-year-old minor league starting pitcher P58689 and 21-year-old minor league starting pitcher P60602 to the T56, getting 27-year-old shortstop P30248 in return.",
    "The T41 traded 35-year-old shortstop P36297 and 22-year-old minor league starting pitcher P54675 to the T59, getting 25-year-old shortstop P50889 and 28-year-old minor league first baseman P21187 in return.",
    "The T53 traded 27-year-old minor league reliever P30039 to the T57, getting 22-year-old minor league starting pitcher P61242 in return.",
    "T31: Placed SP P52484 on the 7-day disabled list, retroactive to 06/22/2025.",
    "T34: Placed SP P29686 on the 7-day disabled list, retroactive to 06/17/2025.",
    "T34: Placed SP P55046 on the active roster.",
    "T34: Activated SP P55046 from the disabled list.",
    "T34: Placed RP P19499 on the active roster.",
    "T35: Placed CF P29786 on the active roster.",
    "T35: Activated CF P29786 from the disabled list.",
    "T38: SS P29691 was designated for assignment and placed on waivers.",
    "T42: Placed SP P24039 on the 7-day disabled list, retroactive to 06/22/2025.",
    "T43: Placed 2B P53432 on the active roster.",
    "T43: Placed SP P22463 on the 7-day disabled list, retroactive to 06/18/2025.",
    "T43: Placed CF P26631 on the active roster.",
    "T43: Placed RP P53072 on the active roster.",
    "T43: Placed RF P36482 on the active roster.",
    "T43: Activated RF P36482 from the disabled list.",
    "T43: Sent RP P38933 to Triple A Omaha for injury rehab.",
    "T45: Placed RP P53708 on the active roster.",
    "T45: Activated RP P53708 from the disabled list.",
    "T46: Placed SP P30024 on the 7-day disabled list, retroactive to 06/22/2025.",
    "T48: Placed SP P53054 on the active roster.",
    "T48: Activated SP P53054 from the disabled list.",
    "T48: Placed 2B P25190 on the active roster.",
    "T48: Activated 2B P25190 from the disabled list.",
    "T48: Sent RP P30475 to Triple A Scranton WB for injury rehab.",
    "T51: Placed 2B P42045 on the active roster.",
    "T51: Activated 2B P42045 from the disabled list.",
    "T53: Placed C P20225 on the active roster.",
    "T53: Placed SS P30248 on the active roster.",
    "T53: Placed RP P55648 on the active roster.",
    "T53: Activated RP P55648 from the disabled list.",
    "T57: Placed RP P30039 on the active roster."
  ],
  "2025-06-24T00:00:00-07:00": [
    "T35: Signed P62510 to a minor league contract with a signing bonus of $1,420,000.",
    "T35: Signed P62945 to a minor league contract with a signing bonus of $150,000.",
    "T40: Signed P62594 to a minor league contract with a signing bonus of $500,000.",
    "T47: Signed P62223 to a minor league contract with a signing bonus of $1,000,000.",
    "T50: Signed P61315 to a minor league contract with a signing bonus of $190,000.",
    "T54: Signed P63060 to a minor league contract with a signing bonus of $150,000.",
    "T32: Signed P62879 to a minor league contract with a signing bonus of $1,250,000.",
    "T32: Signed P62872 to a minor league contract with a signing bonus of $1,900,000.",
    "T49: Signed P62254 to a minor league contract with a signing bonus of $280,000.",
    "T36: Signed P60955 to a minor league contract with a signing bonus of $420,000.",
    "T52: Signed P62890 to a minor league contract with a signing bonus of $370,000.",
    "T56: Signed P63036 to a minor league contract with a signing bonus of $210,000.",
    "T45: Signed P62998 to a minor league contract with a signing bonus of $420,000."
  ],
  "2025-06-25T00:00:00-07:00": [
    "T59: Signed P63063 to a minor league contract with a signing bonus of $300,000.",
    "T35: Signed P60854 to a minor league contract with a signing bonus of $550,000.",
    "T44: Signed P63109 to a minor league contract with a signing bonus of $240,000.",
    "T42: Signed P59525 to a minor league contract with a signing bonus of $600,000.",
    "T51: Signed P62278 to a minor league contract with a signing bonus of $1,940,000.",
    "T46: Signed P60518 to a minor league contract with a signing bonus of $650,000.",
    "T55: Signed P62769 to a minor league contract with a signing bonus of $350,000.",
    "T55: Signed P62819 to a minor league contract with a signing bonus of $230,000."
  ],
  "2025-06-26T00:00:00-07:00": [
    "T35: Signed P60982 to a minor league contract with a signing bonus of $210,000.",
    "T43: Signed P63228 to a minor league contract with a signing bonus of $200,000.",
    "T47: Signed P63013 to a minor league contract with a signing bonus of $280,000.",
    "T44: Signed P62600 to a minor league contract with a signing bonus of $150,000.",
    "T46: Signed P63200 to a minor league contract with a signing bonus of $2,200,000.",
    "T56: Signed P63212 to a minor league contract with a signing bonus of $150,000.",
    "T45: Signed P62297 to a minor league contract with a signing bonus of $810,000.",
    "T45: Signed P62705 to a minor league contract with a signing bonus of $1,400,000."
  ],
  "2025-06-27T00:00:00-07:00": [
    "T45: Signed RP P25151 to a 1-year contract extension worth a total of $10,390,000.",
    "T52: Signed SP P39616 to a 4-year contract extension worth a total of $34,480,000.",
    "T51: Signed P62517 to a minor league contract with a signing bonus of $1,440,000."
  ],
  "2025-06-28T00:00:00-07:00": [
    "T47: Signed P63113 to a minor league contract with a signing bonus of $1,350,000.",
    "T42: Signed P63112 to a minor league contract with a signing bonus of $2,000,000.",
    "T42: Signed P62296 to a minor league contract with a signing bonus of $200,000.",
    "T32: Signed P62932 to a minor league contract with a signing bonus of $180,000.",
    "T46: Signed P62258 to a minor league contract with a signing bonus of $325,000.",
    "T56: Signed P63141 to a minor league contract with a signing bonus of $570,000.",
    "T45: Signed P63052 to a minor league contract with a signing bonus of $430,000.",
    "T45: Signed P60684 to a minor league contract with a signing bonus of $270,000."
  ],
  "2025-06-29T00:00:00-07:00": [
    "T32: Claimed RP P26270 off waivers from New York.",
    "T56: Signed P62944 to a minor league contract with a signing bonus of $300,000."
  ],
  "2025-06-30T00:00:00-07:00": [
    "T35: Signed P62619 to a minor league contract with a signing bonus of $300,000.",
    "The T37 traded 28-year-old shortstop P29575, 24-year-old minor league shortstop P57607 and 25-year-old minor league starting pitcher P55026 to the T39, getting 22-year-old minor league center fielder P32956 in return.",
    "The T58 traded 20-year-old minor league starting pitcher P59107, 26-year-old minor league first baseman P53704 and $250,000 in cash to the T52, getting 21-year-old minor league starting pitcher P57031 in return.",
    "The T56 traded 26-year-old third baseman P24098 to the T37, getting 24-year-old minor league third baseman P57330, 20-year-old minor league starting pitcher P60700 and 22-year-old minor league center fielder P57207 in return.",
    "The T47 traded 23-year-old minor league starting pitcher P55189 to the T56, getting 28-year-old center fielder P25146 in return.",
    "The T40 traded 30-year-old starting pitcher P37027 to the T57, getting $1 in cash in return.",
    "The T53 traded 25-year-old minor league starting pitcher P55336, retaining 10% to the T40, getting 19-year-old minor league starting pitcher P56060 and 25-year-old minor league first baseman P59121 in return."
  ]
}
