{
  "2025-08-04T00:00:00-07:00": [
    "The T54 traded 23-year-old minor league closer P59323 to the T52, getting 37-year-old closer P27466, retaining 100% in return.",
    "The T58 traded 24-year-old minor league starting pitcher P58906 and 27-year-old catcher P53431 to the T52, getting 33-year-old catcher P50013 in return.",
    "The T53 traded 32-year-old minor league starting pitcher P39611, 23-year-old minor league starting pitcher P56742 and $1 in cash to the T56, getting 21-year-old minor league starting pitcher P18663 in return.",
    "The T56 traded 33-year-old right fielder P34049, retaining 50% to the T48, getting 30-year-old left fielder P38630 and 29-year-old minor league reliever P1469 in return.",
    "The T57 traded 23-year-old minor league starting pitcher P53512 to the T42, getting 23-year-old minor league starting pitcher P55734 in return.",
    "T31: Placed RP P29998 on the 7-day disabled list, retroactive to 07/31/2025.",
    "T34: Placed 3B P25187 on the active roster.",
    "T34: Activated 3B P25187 from the disabled list.",
    "T37: RP P33526 was designated for assignment and placed on waivers.",
    "T37: Placed 2B P46900 on the active roster.",
    "T37: Placed CF P55052 on the active roster.",
    "T37: Activated CF P55052 from the disabled list.",
    "T38: Placed SP P23995 on the 60-day disabled list.",
    "T44: Placed 2B P25145 on the active roster.",
    "T44: Placed RP P29927 on the active roster.",
    "T46: Placed SP P30024 on the active roster.",
    "T46: Activated SP P30024 from the disabled list.",
    "T48: Sent SP P18682 to Triple A Scranton WB for injury rehab.",
    "T48: Placed C P33558 on the active roster.",
    "T48: Activated C P33558 from the disabled list.",
    "T48: Placed RF P34049 on the active roster.",
    "T48: Placed SP P22420 on the 60-day disabled list.",
    "T50: Placed LF P55254 on the active roster.",
    "T50: Activated LF P55254 from the disabled list.",
    "T50: Released C P48037.",
    "T51: Placed 2B P42045 on the 7-day disabled list, retroactive to 07/28/2025.",
    "T55: Placed 2B P35263 on the active roster.",
    "T55: Activated 2B P35263 from the 60-day disabled list.",
    "T55: Released 2B P29929.",
    "T54: Placed RP P27466 on the active roster.",
    "T56: Placed LF P38630 on the active roster.",
    "T56: Placed SS P50319 on the 7-day disabled list, retroactive to 08/03/2025.",
    "T58: Placed C P50013 on the active roster.",
    "T59: Placed RF P37158 on the active roster."
  ],
  "2025-08-10T00:00:00-07:00": [
    "T58: Claimed SP P26704 off waivers from Cleveland.",
    "T58: Claimed RP P26270 off waivers from Atlanta."
  ],
  "2025-08-11T00:00:00-07:00": [
    "The T47 traded 22-year-old minor league starting pitcher P52534 to the T50, getting 22-year-old minor league shortstop P61146 in return.",
    "The T50 traded 21-year-old minor league center fielder P57188 to the T37, getting 20-year-old minor league catcher P45631 in return."
  ]
}
