{
  "2025-04-14T00:00:00-07:00": [
    "The T54 traded nothing to the T53, getting 19-year-old minor league center fielder P58230 in return.",
    "The T53 traded 24-year-old minor league right fielder P55780 to the T31, getting 22-year-old minor league starting pitcher P53271 in return.",
    "T33: Placed RP P34021 on irrevocable waivers.",
    "T33: Sent CL P25610 to Triple A Norfolk for injury rehab.",
    "T35: Placed SP P25144 on the active roster.",
    "T35: Activated SP P25144 from the disabled list.",
    "T38: Placed 2B P39486 on the active roster.",
    "T44: Placed RF P35161 on the 7-day disabled list, retroactive to 04/11/2025.",
    "T44: Placed CF P53206 on the 7-day disabled list, retroactive to 04/12/2025.",
    "T44: Placed CF P44749 on the active roster.",
    "T44: Placed C P37330 on the 7-day disabled list, retroactive to 04/13/2025.",
    "T41: Sent LF P51506 to Triple A New Orleans for injury rehab.",
    "T50: Placed 3B P23933 on the 7-day disabled list, retroactive to 04/09/2025.",
    "T50: Placed CF P52940 on the 7-day disabled list, retroactive to 03/11/2025.",
    "T57: Placed RP P33217 on the 7-day disabled list, retroactive to 04/12/2025.",
    "T58: Sent RP P25907 to Triple A Round Rock for injury rehab."
  ],
  "2025-04-19T00:00:00-07:00": [
    "T60: Signed free agent SP P41211 to a 1-year contract worth a total of $590,000.",
    "T42: Claimed RP P53678 off waivers from Milwaukee."
  ],
  "2025-04-20T00:00:00-07:00": [
    "T60: Signed free agent RP P29800 to a 1-year contract worth a total of $740,000.",
    "T60: Placed RP P52538 on the 7-day disabled list, retroactive to 04/19/2025.",
    "T41: Claimed RP P19894 off waivers from New York.",
    "T41: Claimed RP P30109 off waivers from New York.",
    "T54: Claimed LF P26931 off waivers from Chicago.",
    "T40: Claimed 2B P49683 off waivers from Kansas City.",
    "T41: Claimed RP P37544 off waivers from Minnesota.",
    "T40: Claimed RP P29862 off waivers from Los Angeles.",
    "T60: Claimed 2B P29709 off waivers from Houston.",
    "T41: Claimed RP P39020 off waivers from Atlanta.",
    "T54: Claimed C P40187 off waivers from New York.",
    "T60: Claimed 2B P32464 off waivers from Milwaukee.",
    "T60: Claimed C P22590 off waivers from Milwaukee.",
    "T42: Claimed RP P1479 off waivers from San Francisco."
  ],
  "2025-04-21T00:00:00-07:00": [
    "T60: C P25231 was designated for assignment and placed on irrevocable waivers."
  ]
}
