{
  "2025-11-08T00:00:00-08:00": [
    "T48: RF P34049 has executed his contract year option.",
    "T57: 2B P30589 has executed his contract year option.",
    "T59: SP P34312 has executed his contract year option.",
    "T59: RF P28933 has met the vesting criteria in his contract.",
    "T40: 2B P41819 has exercised his contract opt-out.",
    "T44: 1B P50059 has decided not to opt out of the remaining portion of his contract.",
    "T44: SP P34825 declines his contract option.",
    "T44: 2B P50827 has decided not to opt out of the remaining portion of his contract.",
    "T50: RP P32357 has exercised his contract opt-out.",
    "T54: RP P38850 has decided not to opt out of the remaining portion of his contract.",
    "T54: RP P38836 has exercised his contract opt-out.",
    "T54: 3B P34032 has exercised his contract opt-out.",
    "T54: CF P37113 has decided not to opt out of the remaining portion of his contract.",
    "T42: 3B P22458 has exercised his contract opt-out.",
    "T42: SP P23444 has exercised his contract opt-out.",
    "T49: RP P35120 has decided not to opt out of the remaining portion of his contract.",
    "T49: CF P32849 has exercised his contract opt-out.",
    "T51: SP P54518 has exercised his contract opt-out.",
    "T60: RF P33603 has decided not to opt out of the remaining portion of his contract.",
    "T60: C P36243 has executed his contract year option.",
    "T56: SP P42128 has exercised his contract opt-out.",
    "T56: SP P54513 has failed to meet the vesting criteria in his contract.",
    "T56: 1B P56436 has executed his contract year option.",
    "T56: SP P27493 has decided not to opt out of the remaining portion of his contract.",
    "T39: 2B P33564 declines his contract option.",
    "T45: RP P26087 has failed to meet the vesting criteria in his contract.",
    "T55: SP P52164 has decided not to opt out of the remaining portion of his contract.",
    "T55: C P48236 has exercised his contract opt-out.",
    "T48: SP P18682 retires.",
    "T36: 3B P19583 retires.",
    "T53: C P22632 retires.",
    "T32: RP P23086 retires.",
    "T60: RP P26537 retires.",
    "T60: RP P30307 retires.",
    "T32: SP P33609 retires.",
    "T57: SP P37027 retires.",
    "T44: 1B P46500 retires.",
    "T55: SP P32847 retires.",
    "T59: RF P37158 retires.",
    "T37: Placed SP P54917 on the active roster.",
    "T37: Activated SP P54917 from the 60-day disabled list.",
    "T37: Placed SP P29832 on the active roster.",
    "T37: Activated SP P29832 from the 60-day disabled list.",
    "T37: Placed RF P55052 on the active roster.",
    "T37: Activated RF P55052 from the disabled list.",
    "T43: Placed SP P22463 on the active roster.",
    "T43: Activated SP P22463 from the disabled list.",
    "T43: Placed 3B P53432 on the active roster.",
    "T43: Activated 3B P53432 from the disabled list.",
    "T43: Placed 3B P37049 on the active roster.",
    "T43: Activated 3B P37049 from the disabled list.",
    "T44: Placed RP P32862 on the active roster.",
    "T44: Activated RP P32862 from the 60-day disabled list.",
    "T44: Placed RF P35161 on the active roster.",
    "T44: Activated RF P35161 from the 60-day disabled list.",
    "T45: Executed the contract year option of 1B P38604.",
    "T45: Placed SP P40490 on the active roster.",
    "T45: Activated SP P40490 from the 60-day disabled list.",
    "T47: RP P32319 was designated for assignment and placed on waivers.",
    "T47: SS P50333 was designated for assignment and placed on waivers.",
    "T47: Placed SS P50333 on the active roster.",
    "T47: Placed SP P35903 on the active roster.",
    "T47: Activated SP P35903 from the disabled list.",
    "T49: SP P52269 was designated for assignment and placed on waivers.",
    "T50: Executed the contract year option of SP P34824.",
    "T51: Executed the contract year option of 1B P29037.",
    "T51: Executed the contract year option of RF P91.",
    "T54: Voided the team option year(s) of 3B P27218.",
    "T54: Executed the contract year option of CL P30472.",
    "T58: Placed SS P55249 on the active roster.",
    "T58: Activated SS P55249 from the disabled list."
  ],
  "2025-11-10T00:00:00-08:00": [
    "The T49 traded nothing to the T40, getting 19-year-old minor league center fielder P63090 in return.",
    "The T35 traded nothing to the T40, getting 22-year-old minor league reliever P61076 in return.",
    "The T54 traded 29-year-old starting pitcher P25142 and 21-year-old minor league starting pitcher P53981 to the T55, getting 28-year-old right fielder P47317, 25-year-old minor league starting pitcher P23961 and 19-year-old minor league reliever P61316 in return.",
    "The T49 traded nothing to the T39, getting 19-year-old minor league shortstop P63138 in return.",
    "The T34 traded nothing to the T33, getting 19-year-old minor league shortstop P60793 in return.",
    "The T37 traded nothing to the T43, getting 22-year-old minor league center fielder P63056 in return.",
    "The T50 traded 30-year-old catcher P1421 to the T55, getting 22-year-old minor league closer P61183 and 18-year-old minor league starting pitcher P62988 in return.",
    "The T53 traded 21-year-old minor league starting pitcher P63321 to the T33, getting 23-year-old minor league catcher P62219 in return.",
    "The T54 traded 26-year-old second baseman P50259 to the T37, getting 29-year-old catcher P48873 in return.",
    "The T34 traded 27-year-old shortstop P29923 to the T52, getting 18-year-old minor league starting pitcher P61489 in return.",
    "The T36 traded 23-year-old minor league reliever P58673 to the T37, getting 26-year-old third baseman P24098 and 22-year-old minor league closer P61371 in return.",
    "The T40 traded 23-year-old minor league starting pitcher P60855 to the T37, getting 27-year-old starting pitcher P50296 and 21-year-old minor league center fielder P58947 in return.",
    "The T40 traded 22-year-old minor league first baseman P59252, 24-year-old minor league right fielder P53195 and 22-year-old minor league starting pitcher P55779 to the T50, getting 28-year-old third baseman P23933, 19-year-old minor league first baseman P60555 and 21-year-old minor league center fielder P61224 in return.",
    "The T59 traded 33-year-old first baseman P34691 and 28-year-old starting pitcher P30082 to the T44, getting 24-year-old minor league first baseman P22847, 19-year-old minor league center fielder P62997, 19-year-old minor league center fielder P63109 and 29-year-old minor league shortstop P1495 in return.",
    "The T34 traded 19-year-old minor league shortstop P59918 to the T58, getting 20-year-old minor league catcher P56205 in return.",
    "The T53 traded 26-year-old catcher P20225 to the T52, getting 20-year-old minor league starting pitcher P62508 in return.",
    "The T52 traded $69 in cash to the T37, getting 30-year-old second baseman P46900, retaining 25% in return.",
    "The T39 traded 27-year-old starting pitcher P58314 to the T43, getting 23-year-old minor league third baseman P25385 in return.",
    "The T54 traded 30-year-old catcher P40187 to the T49, getting 17-year-old minor league starting pitcher P63822 in return.",
    "The T58 traded 27-year-old minor league left fielder P20036 to the T51, getting 21-year-old minor league starting pitcher P58330 and 20-year-old minor league left fielder P60885 in return.",
    "The T54 traded 28-year-old center fielder P28737, retaining 10% to the T51, getting 22-year-old minor league closer P62517 and 18-year-old minor league starting pitcher P59941 in return.",
    "The T34 traded 29-year-old starting pitcher P50132, retaining 10%, 23-year-old minor league catcher P22894, 24-year-old minor league reliever P57442 and 18-year-old minor league catcher P62730 to the T51, getting 30-year-old starting pitcher P38786 and 27-year-old catcher P23857 in return.",
    "The T47 traded 33-year-old reliever P38571, 36-year-old right fielder P27200, 21-year-old minor league first baseman P55918, 21-year-old minor league starting pitcher P63113 and 22-year-old minor league closer P62223 to the T49, getting 32-year-old left fielder P37072, retaining 50% and 21-year-old minor league left fielder P57045 in return."
  ]
}
