{
  "2025-08-18T00:00:00-07:00": [
    "The T57 traded 27-year-old minor league starting pitcher P243 and 19-year-old minor league starting pitcher P61141 to the T49, getting 29-year-old left fielder P39461 in return.",
    "T32: Placed 1B P19 on the 7-day disabled list, retroactive to 08/14/2025.",
    "T32: Placed RF P26879 on the active roster.",
    "T32: Activated RF P26879 from the disabled list.",
    "T33: Placed CL P42908 on the 7-day disabled list, retroactive to 08/10/2025.",
    "T33: Placed SP P24376 on the active roster.",
    "T33: Activated SP P24376 from the 60-day disabled list.",
    "T33: Placed C P31093 on waivers.",
    "T34: Placed RP P28592 on the 7-day disabled list, retroactive to 08/14/2025.",
    "T34: Placed RP P33785 on the active roster.",
    "T34: Activated RP P33785 from the 60-day disabled list.",
    "T35: Placed RP P53687 on the active roster.",
    "T35: Activated RP P53687 from the disabled list.",
    "T39: Placed LF P37072 on the active roster.",
    "T39: LF P37072 was designated for assignment and placed on waivers.",
    "T43: Placed RP P58305 on the 7-day disabled list, retroactive to 08/15/2025.",
    "T43: Placed RP P26298 on the active roster.",
    "T43: Activated RP P26298 from the disabled list.",
    "T43: Placed 3B P53432 on the active roster.",
    "T43: Activated 3B P53432 from the disabled list.",
    "T45: Placed SP P40490 on the 60-day disabled list.",
    "T45: Placed SP P38782 on the active roster.",
    "T45: Activated SP P38782 from the disabled list.",
    "T45: Sent SP P24031 to Triple A Oklahoma City for injury rehab.",
    "T49: Placed SP P243 on the active roster.",
    "T49: Transferred RP P23027 to the 60-day DL.",
    "T50: Placed SS P31862 on the active roster.",
    "T50: Activated SS P31862 from the disabled list.",
    "T51: Placed 3B P1392 on the 7-day disabled list, retroactive to 08/16/2025.",
    "T56: Sent SP P27493 to Triple A Memphis for injury rehab.",
    "T57: Placed LF P39461 on the active roster.",
    "T57: Placed RF P53267 on the active roster.",
    "T57: Activated RF P53267 from the disabled list.",
    "T58: SP P41003 was designated for assignment and placed on waivers.",
    "T58: Placed RP P26704 on the active roster."
  ],
  "2025-08-24T00:00:00-07:00": [
    "T50: Claimed SP P34824 off waivers from Detroit.",
    "T38: Claimed RP P23601 off waivers from New York."
  ],
  "2025-08-25T00:00:00-07:00": [
    "T55: Signed SP P34452 to a 1-year contract extension worth a total of $1,036,500."
  ]
}
